tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
/*******************************************************************************
* Copyright (C) 2017, Huada Semiconductor Co.,Ltd All rights reserved.
*
* This software is owned and published by:
* Huada Semiconductor Co.,Ltd ("HDSC").
*
* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
*
* This software contains source code for use with HDSC
* components. This software is licensed by HDSC to be adapted only
* for use in systems utilizing HDSC components. HDSC shall not be
* responsible for misuse or illegal use of this software for devices not
* supported herein. HDSC is providing this software "AS IS" and will
* not be responsible for issues arising from incorrect user implementation
* of the software.
*
* Disclaimer:
* HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
* REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),
* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
* WARRANTY OF NONINFRINGEMENT.
* HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
* SAVINGS OR PROFITS,
* EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
* FROM, THE SOFTWARE.
*
* This software may be replicated in part or whole for the licensed use,
* with the restriction that this Disclaimer and Copyright notice must be
* included with each copy of this software, whether used in part or whole,
* at all times.
*/
/******************************************************************************/
/** \\file HC32L15.h
**
** Auto generate.
** Headerfile for HC32L15 series MCU
**
** History:
**
**   - 2017-07-04  0.1   First version for Device Driver Library of Module.
**
******************************************************************************/

#ifndef __HC32L15_H__
#define __HC32L15_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************
* Configuration of the Cortex-M0P Processor and Core Peripherals
******************************************************************************/
#define __MPU_PRESENT           0 /* No MPU                                       */
#define __NVIC_PRIO_BITS        2 /* M0P uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig  0 /* Set to 1 if different SysTick Config is used */

/******************************************************************************
* Interrupt Number Definition
******************************************************************************/
typedef enum IRQn
{
    NMI_IRQn            = -14, /*  2 Non Maskable                            */
    HardFault_IRQn      = -13, /*  3 Hard Fault                              */
    SVC_IRQn            = -5,  /* 11 SV Call                                 */
    PendSV_IRQn         = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn        = -1,  /* 15 System Tick                             */
    
    CSV_IRQn            = 0 ,
    SWDT_IRQn           = 1 ,
    LVD_IRQn            = 2 ,
    EXINT0_7_IRQn       = 4 ,
    EXINT8_15_IRQn      = 5 ,
    DTIM_IRQn           = 6 ,
    MSC0RX_IRQn         = 7 ,
    MSC0TX_IRQn         = 8 ,
    MSC1RX_IRQn         = 9 ,
    MSC1TX_IRQn         = 10,
    MSC2RX_IRQn         = 11,
    MSC2TX_IRQn         = 12,
    MSC4RX_IRQn         = 15,
    MSC4TX_IRQn         = 16,
    MSC5RX_IRQn         = 17,
    MSC5TX_IRQn         = 18,
    MSC6RX_IRQn         = 19,
    MSC6TX_IRQn         = 20,
    OSC_WU_RTC_IRQn     = 24,
    ADC_IRQn            = 25,
    VC_IRQn             = 26,
    SCI_IRQn            = 27,
    CTIM0_7_FLASH_IRQn  = 31,
    
    
} IRQn_Type;


#include <core_cm0plus.h>
#include <stdint.h>

#define SUCCESS         (0)
#define ERROR           (-1)

#ifndef NULL
#define NULL            (0)
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

typedef struct
{
    __IO uint32_t ADC_EN                    : 1;
    __IO uint32_t ADC_CLK_SEL               : 2;
    uint32_t RESERVED3                      : 3;
    __IO uint32_t ADC_VREF                  : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t ADC_CHL_SEL               : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t ADCIE                     : 1;
    __IO uint32_t ADCIF                     : 1;
} stc_adc_ctl1_field_t;

typedef struct
{
    __IO uint8_t ADC_START                  : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t ADC_ALIGN                  : 1;
    __IO uint8_t ADC_MODE                   : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t VINBUF_EN                  : 1;
    __IO uint8_t ADC_SAMPLE_SEL             : 2;
} stc_adc_ctl2_field_t;

typedef struct
{
    __IO uint16_t RESULT                    :16;
} stc_adc_result_field_t;

typedef struct
{
    __IO uint32_t CMPIF                     : 1;
} stc_adc_adcmpif_field_t;

typedef struct
{
    __IO uint32_t CMPF                      : 1;
} stc_adc_adcmpf_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t CMPEN                     : 1;
    __IO uint16_t CMPIE                     : 1;
    __IO uint16_t CMPTRIG                   : 1;
    __IO uint16_t CMPCNT                    : 3;
    uint16_t RESERVED8                      : 5;
    __IO uint16_t CMPCNT_ST                 : 3;
} stc_adc_adcmpctl_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 6;
    __IO uint16_t CDL                       :10;
} stc_adc_adcmpl_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 6;
    __IO uint16_t CDH                       :10;
} stc_adc_adcmph_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t FUNC_SEL                  : 2;
    __IO uint16_t KEY_SEL                   : 2;
    __IO uint16_t STEP_EN                   : 1;
    uint16_t RESERVED6                      : 1;
    __IO uint16_t DFA_EN                    : 1;
    __IO uint16_t DFA_STA                   : 1;
    __IO uint16_t RAND_TEN                  : 1;
    __IO uint16_t DUMMY_EN                  : 1;
    __IO uint16_t DUMMY_SEL                 : 2;
} stc_aes_con_field_t;

typedef struct
{
    __IO uint32_t DATA0                     :32;
} stc_aes_data0_field_t;

typedef struct
{
    __IO uint32_t DATA1                     :32;
} stc_aes_data1_field_t;

typedef struct
{
    __IO uint32_t DATA2                     :32;
} stc_aes_data2_field_t;

typedef struct
{
    __IO uint32_t DATA3                     :32;
} stc_aes_data3_field_t;

typedef struct
{
    __IO uint32_t KEY0                      :32;
} stc_aes_key0_field_t;

typedef struct
{
    __IO uint32_t KEY1                      :32;
} stc_aes_key1_field_t;

typedef struct
{
    __IO uint32_t KEY2                      :32;
} stc_aes_key2_field_t;

typedef struct
{
    __IO uint32_t KEY3                      :32;
} stc_aes_key3_field_t;

typedef struct
{
    __IO uint32_t KEY4                      :32;
} stc_aes_key4_field_t;

typedef struct
{
    __IO uint32_t KEY5                      :32;
} stc_aes_key5_field_t;

typedef struct
{
    __IO uint32_t KEY6                      :32;
} stc_aes_key6_field_t;

typedef struct
{
    __IO uint32_t KEY7                      :32;
} stc_aes_key7_field_t;

typedef struct
{
    __IO uint32_t RNG0                      :32;
} stc_aes_rng0_field_t;

typedef struct
{
    __IO uint32_t RNG1                      :32;
} stc_aes_rng1_field_t;

typedef struct
{
    __IO uint8_t INT_EN                     : 1;
    __IO uint8_t ALM_INT                    : 1;
} stc_aes_int_con_field_t;

typedef struct
{
    __IO uint8_t DIV_EN                     : 1;
} stc_aes_div_en_field_t;

typedef struct
{
    __IO uint8_t CLK_SEL                    : 1;
    __IO uint8_t BUZ_ST                     : 1;
} stc_buzzer_buz_ctl_field_t;

typedef struct
{
    __IO uint8_t BUZ_CNT                    : 8;
} stc_buzzer_buz_cnt_field_t;

typedef struct
{
    __IO uint8_t HC_EN                      : 1;
    __IO uint8_t MAIN_EN                    : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t SUB_EN                     : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t INPUT                      : 3;
} stc_clock_ctrl_field_t;

typedef struct
{
    __IO uint8_t HC_RDY                     : 1;
    __IO uint8_t MAIN_RDY                   : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t SUB_RDY                    : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t SRC                        : 3;
} stc_clock_clk_stb_field_t;

typedef struct
{
    __IO uint32_t STBM                      : 2;
    __IO uint32_t DSTBEN                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SPLV                      : 1;
    uint32_t RESERVED5                      :11;
    __IO uint32_t KEY                       :16;
} stc_clock_lpm_ctl_field_t;

typedef struct
{
    __IO uint16_t PWR                       : 1;
    __IO uint16_t RSTB                      : 1;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t LVDR                      : 1;
    __IO uint16_t SWWDG                     : 1;
    __IO uint16_t HWWDG                     : 1;
    __IO uint16_t CSV                       : 1;
    __IO uint16_t AF                        : 1;
    __IO uint16_t SW                        : 1;
} stc_clock_stat_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 3;
} stc_clock_bc_div_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 2;
} stc_clock_apb0_ctrl_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t RST                        : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t EN                         : 1;
} stc_clock_apb1_ctrl_field_t;

typedef struct
{
    __IO uint8_t SWDS                       : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t SWCKE                      : 1;
    __IO uint8_t HWCKE                      : 1;
    __IO uint8_t DTCKE                      : 1;
} stc_clock_clk_ctl_field_t;

typedef struct
{
    __IO uint8_t MAINWT                     : 4;
    __IO uint8_t SUBWT                      : 4;
} stc_clock_cswt_field_t;

typedef struct
{
    __IO uint16_t MFCME                     : 1;
    __IO uint16_t SFCME                     : 1;
    __IO uint16_t MFCMRE                    : 1;
    __IO uint16_t SFCMRE                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t AFDE                      : 1;
    __IO uint16_t AFDRE                     : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t AFDCC                     : 3;
} stc_clock_fcm_ctl_field_t;

typedef struct
{
    __IO uint8_t MCFDF                      : 1;
    __IO uint8_t SCFDF                      : 1;
} stc_clock_fcm_str_field_t;

typedef struct
{
    __IO uint16_t AFDWH                     :16;
} stc_clock_afdwh_ctl_field_t;

typedef struct
{
    __IO uint16_t AFDWL                     :16;
} stc_clock_afdwl_ctl_field_t;

typedef struct
{
    __IO uint16_t AFDC                      :16;
} stc_clock_afdc_ctl_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 5;
    __IO uint8_t SWWDG_BRK                  : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t HWWDG_BRK                  : 1;
} stc_clock_dbwdt_ctrl_field_t;

typedef struct
{
    __IO uint8_t MAINEN                     : 1;
    __IO uint8_t SUBEN                      : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t MCSVIE                     : 1;
    __IO uint8_t SCSVIE                     : 1;
    __IO uint8_t FCSEN                      : 1;
} stc_clock_int_ctrl_field_t;

typedef struct
{
    __IO uint8_t MAIN                       : 1;
    __IO uint8_t SUB                        : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t MCSVI                      : 1;
    __IO uint8_t SCSVI                      : 1;
    __IO uint8_t FCS                        : 1;
} stc_clock_int_pend_field_t;

typedef struct
{
    __IO uint8_t MAIN                       : 1;
    __IO uint8_t SUB                        : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t MCSVC                      : 1;
    __IO uint8_t SCSVC                      : 1;
    __IO uint8_t FCS                        : 1;
} stc_clock_int_clr_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t SEL01                     : 4;
    __IO uint16_t SEL23                     : 4;
} stc_ctiosel03_ctsel0123_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t SEL45                     : 4;
    __IO uint16_t SEL67                     : 4;
} stc_ctiosel47_ctsel4567_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t EDGS                      : 2;
    __IO uint16_t MASK                      : 1;
    __IO uint16_t RSTEN                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_ppg_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_ppg_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_ppg_tcr2_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t FUNC                      : 3;
    __IO uint16_t T32                       : 1;
    __IO uint16_t EDGS                      : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_pwc_tcr_field_t;

typedef struct
{
    __IO uint8_t OVIR                       : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t MCIR                       : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t OVIE                       : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t MCIE                       : 1;
    __IO uint8_t ERR                        : 1;
} stc_ct_pwc_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_pwc_tcr2_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t EDGS                      : 2;
    __IO uint16_t MASK                      : 1;
    __IO uint16_t RSTEN                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_pwm_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    __IO uint8_t DTMIR                      : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    __IO uint8_t DTMIE                      : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_pwm_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_pwm_tcr2_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    __IO uint16_t T32                       : 1;
    __IO uint16_t EDGS                      : 2;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t CLKS                      : 3;
} stc_ct_rt_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_rt_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t GTIE                       : 1;
} stc_ct_rt_tcr2_field_t;

typedef struct
{
    __IO uint32_t ONESHOT                   : 1;
    __IO uint32_t TMRSIZE                   : 1;
    __IO uint32_t TMRPRE                    : 2;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t INTEN                     : 1;
    __IO uint32_t TMRMODE                   : 1;
    __IO uint32_t TMREN                     : 1;
} stc_dtim_timerctrl_field_t;

typedef struct
{
    __IO uint32_t TMRINTST                  : 1;
} stc_dtim_timerris_field_t;

typedef struct
{
    __IO uint32_t TMRMINTST                 : 1;
} stc_dtim_timermis_field_t;

typedef struct
{
    __IO uint32_t EN0                       : 1;
    __IO uint32_t EN1                       : 1;
    __IO uint32_t EN2                       : 1;
    __IO uint32_t EN3                       : 1;
    __IO uint32_t EN4                       : 1;
    __IO uint32_t EN5                       : 1;
    __IO uint32_t EN6                       : 1;
    __IO uint32_t EN7                       : 1;
    __IO uint32_t EN8                       : 1;
    __IO uint32_t EN9                       : 1;
    __IO uint32_t EN10                      : 1;
    __IO uint32_t EN11                      : 1;
    __IO uint32_t EN12                      : 1;
    __IO uint32_t EN13                      : 1;
    __IO uint32_t EN14                      : 1;
    __IO uint32_t EN15                      : 1;
} stc_extint_inten_field_t;

typedef struct
{
    __IO uint32_t SRC0                      : 1;
    __IO uint32_t SRC1                      : 1;
    __IO uint32_t SRC2                      : 1;
    __IO uint32_t SRC3                      : 1;
    __IO uint32_t SRC4                      : 1;
    __IO uint32_t SRC5                      : 1;
    __IO uint32_t SRC6                      : 1;
    __IO uint32_t SRC7                      : 1;
    __IO uint32_t SRC8                      : 1;
    __IO uint32_t SRC9                      : 1;
    __IO uint32_t SRC10                     : 1;
    __IO uint32_t SRC11                     : 1;
    __IO uint32_t SRC12                     : 1;
    __IO uint32_t SRC13                     : 1;
    __IO uint32_t SRC14                     : 1;
    __IO uint32_t SRC15                     : 1;
} stc_extint_intsrc_field_t;

typedef struct
{
    __IO uint32_t CLR0                      : 1;
    __IO uint32_t CLR1                      : 1;
    __IO uint32_t CLR2                      : 1;
    __IO uint32_t CLR3                      : 1;
    __IO uint32_t CLR4                      : 1;
    __IO uint32_t CLR5                      : 1;
    __IO uint32_t CLR6                      : 1;
    __IO uint32_t CLR7                      : 1;
    __IO uint32_t CLR8                      : 1;
    __IO uint32_t CLR9                      : 1;
    __IO uint32_t CLR10                     : 1;
    __IO uint32_t CLR11                     : 1;
    __IO uint32_t CLR12                     : 1;
    __IO uint32_t CLR13                     : 1;
    __IO uint32_t CLR14                     : 1;
    __IO uint32_t CLR15                     : 1;
} stc_extint_intclr_field_t;

typedef struct
{
    __IO uint32_t LVLL0                     : 1;
    __IO uint32_t LVLH0                     : 1;
    __IO uint32_t LVLL1                     : 1;
    __IO uint32_t LVLH1                     : 1;
    __IO uint32_t LVLL2                     : 1;
    __IO uint32_t LVLH2                     : 1;
    __IO uint32_t LVLL3                     : 1;
    __IO uint32_t LVLH3                     : 1;
    __IO uint32_t LVLL4                     : 1;
    __IO uint32_t LVLH4                     : 1;
    __IO uint32_t LVLL5                     : 1;
    __IO uint32_t LVLH5                     : 1;
    __IO uint32_t LVLL6                     : 1;
    __IO uint32_t LVLH6                     : 1;
    __IO uint32_t LVLL7                     : 1;
    __IO uint32_t LVLH7                     : 1;
    __IO uint32_t LVLL8                     : 1;
    __IO uint32_t LVLH8                     : 1;
    __IO uint32_t LVLL9                     : 1;
    __IO uint32_t LVLH9                     : 1;
    __IO uint32_t LVLL10                    : 1;
    __IO uint32_t LVLH10                    : 1;
    __IO uint32_t LVLL11                    : 1;
    __IO uint32_t LVLH11                    : 1;
    __IO uint32_t LVLL12                    : 1;
    __IO uint32_t LVLH12                    : 1;
    __IO uint32_t LVLL13                    : 1;
    __IO uint32_t LVLH13                    : 1;
    __IO uint32_t LVLL14                    : 1;
    __IO uint32_t LVLH14                    : 1;
    __IO uint32_t LVLL15                    : 1;
    __IO uint32_t LVLH15                    : 1;
} stc_extint_intlvl_field_t;

typedef struct
{
    __IO uint16_t SRC                       : 1;
} stc_extint_nmisrc_field_t;

typedef struct
{
    __IO uint16_t CLR                       : 1;
} stc_extint_nmiclr_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget0_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget1_field_t;

