tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget2_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget3_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget4_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget5_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fget6_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
} stc_fastio_fget7_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
} stc_fastio_fget8_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset0_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset1_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset2_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset3_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset4_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset5_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
    __IO uint8_t P6                         : 1;
    __IO uint8_t P7                         : 1;
} stc_fastio_fset6_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
    __IO uint8_t P1                         : 1;
    __IO uint8_t P2                         : 1;
    __IO uint8_t P3                         : 1;
    __IO uint8_t P4                         : 1;
    __IO uint8_t P5                         : 1;
} stc_fastio_fset7_field_t;

typedef struct
{
    __IO uint8_t P0                         : 1;
} stc_fastio_fset8_field_t;

typedef struct
{
    __IO uint32_t PRGM                      : 1;
    __IO uint32_t PERS                      : 1;
    __IO uint32_t CERS                      : 1;
    __IO uint32_t DPSTB                     : 1;
    uint32_t RESERVED4                      :12;
    __IO uint32_t FRWPW                     :16;
} stc_flash_focr_field_t;

typedef struct
{
    __IO uint32_t LOCK2K                    :32;
} stc_flash_flcr0_field_t;

typedef struct
{
    __IO uint32_t LOCK2K                    :32;
} stc_flash_flcr1_field_t;

typedef struct
{
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t KEYVIO                    : 1;
    __IO uint32_t ACCVIO                    : 1;
    __IO uint32_t ERR                       : 1;
    __IO uint32_t OPVIO                     : 1;
    __IO uint32_t CFM                       : 1;
    uint32_t RESERVED6                      :10;
    __IO uint32_t FRWPW                     :16;
} stc_flash_fstr_field_t;

typedef struct
{
    __IO uint32_t FIE                       : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t FWTC                      : 2;
} stc_flash_fwcicr_field_t;

typedef struct
{
    __IO uint32_t UD0                       :32;
} stc_flash_fudr0_field_t;

typedef struct
{
    __IO uint32_t UD1                       :32;
} stc_flash_fudr1_field_t;

typedef struct
{
    __IO uint32_t UD2                       :32;
} stc_flash_fudr2_field_t;

typedef struct
{
    __IO uint32_t UD3                       :32;
} stc_flash_fudr3_field_t;

typedef struct
{
    __IO uint8_t TNVS                       : 8;
} stc_flash_tnvs_field_t;

typedef struct
{
    __IO uint8_t TPROG                      : 8;
} stc_flash_tprog_field_t;

typedef struct
{
    __IO uint8_t TPGS                       : 8;
} stc_flash_tpgs_field_t;

typedef struct
{
    __IO uint8_t TRCVPGM                    : 8;
} stc_flash_trcvpgm_field_t;

typedef struct
{
    __IO uint8_t TRCVPERS                   : 8;
} stc_flash_trcvpers_field_t;

typedef struct
{
    __IO uint8_t TRCVCERS                   : 8;
} stc_flash_trcvcers_field_t;

typedef struct
{
    __IO uint8_t TPERS                      : 8;
} stc_flash_tpers_field_t;

typedef struct
{
    __IO uint8_t TCERS                      : 8;
} stc_flash_tcers_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_fn0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_fn1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_fn2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_fn3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_fn4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_fn5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_fn6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_fn7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_fn8_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_pu0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_pu1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_pu2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_pu3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_pu4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_pu5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_pu6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_pu7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_pu8_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_dir0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_dir1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_dir2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_dir3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_dir4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_dir5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_dir6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_dir7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_dir8_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_get0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_get1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_get2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_get3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_get4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_get5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_get6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_get7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_get8_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_set0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_set1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_set2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_set3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_set4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_set5_field_t;

