tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_set6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_set7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_set8_field_t;

typedef struct
{
    __IO uint16_t ADE00                     : 1;
    __IO uint16_t ADE01                     : 1;
    __IO uint16_t ADE02                     : 1;
    __IO uint16_t ADE03                     : 1;
    __IO uint16_t ADE04                     : 1;
    __IO uint16_t ADE05                     : 1;
    __IO uint16_t ADE06                     : 1;
    __IO uint16_t ADE07                     : 1;
    __IO uint16_t ADE08                     : 1;
    __IO uint16_t ADE09                     : 1;
    __IO uint16_t ADE10                     : 1;
    __IO uint16_t ADE11                     : 1;
    __IO uint16_t ADE12                     : 1;
    __IO uint16_t ADE13                     : 1;
    __IO uint16_t ADE14                     : 1;
    __IO uint16_t ADE15                     : 1;
} stc_gpio_analog_field_t;

typedef struct
{
    __IO uint8_t SUBCS                      : 2;
    __IO uint8_t MAINCS                     : 2;
} stc_gpio_sps_field_t;

typedef struct
{
    __IO uint16_t NMIS                      : 1;
    __IO uint16_t CROUTE                    : 2;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RTCCOE                    : 2;
    __IO uint16_t SUBOUTE                   : 2;
    __IO uint16_t SWDEN                     : 1;
} stc_gpio_fn_sel00_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TIOA0E                    : 2;
    __IO uint32_t TIOB0S                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t TIOA1S                    : 2;
    __IO uint32_t TIOA1E                    : 2;
    __IO uint32_t TIOB1S                    : 2;
    uint32_t RESERVED14                     : 4;
    __IO uint32_t TIOA2E                    : 2;
    __IO uint32_t TIOB2S                    : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t TIOA3S                    : 2;
    __IO uint32_t TIOA3E                    : 2;
    __IO uint32_t TIOB3S                    : 2;
} stc_gpio_fn_sel02_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TIOA4E                    : 2;
    __IO uint32_t TIOB4S                    : 2;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t TIOA5S                    : 2;
    __IO uint32_t TIOA5E                    : 2;
    __IO uint32_t TIOB5S                    : 2;
    uint32_t RESERVED14                     : 4;
    __IO uint32_t TIOA6E                    : 2;
    __IO uint32_t TIOB6S                    : 2;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t TIOA7S                    : 2;
    __IO uint32_t TIOA7E                    : 2;
    __IO uint32_t TIOB7S                    : 2;
} stc_gpio_fn_sel03_field_t;

typedef struct
{
    __IO uint32_t EINT00S                   : 2;
    __IO uint32_t EINT01S                   : 2;
    __IO uint32_t EINT02S                   : 2;
    __IO uint32_t EINT03S                   : 2;
    __IO uint32_t EINT04S                   : 2;
    __IO uint32_t EINT05S                   : 2;
    __IO uint32_t EINT06S                   : 2;
    __IO uint32_t EINT07S                   : 2;
    __IO uint32_t EINT08S                   : 2;
    __IO uint32_t EINT09S                   : 2;
    __IO uint32_t EINT10S                   : 2;
    __IO uint32_t EINT11S                   : 2;
    __IO uint32_t EINT12S                   : 2;
    __IO uint32_t EINT13S                   : 2;
    __IO uint32_t EINT14S                   : 2;
    __IO uint32_t EINT15S                   : 2;
} stc_gpio_fn_sel04_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t SIN0S                     : 2;
    __IO uint32_t SOT0B                     : 2;
    __IO uint32_t SCK0B                     : 2;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t RTS1E                     : 2;
    __IO uint32_t CTS1S                     : 2;
    __IO uint32_t SIN1S                     : 2;
    __IO uint32_t SOT1B                     : 2;
    __IO uint32_t SCK1B                     : 2;
    __IO uint32_t SCS10B                    : 2;
} stc_gpio_fn_sel05_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t SIN2S                     : 2;
    __IO uint32_t SOT2B                     : 2;
    __IO uint32_t SCK2B                     : 2;
    __IO uint32_t SCS20B                    : 2;
    __IO uint32_t SCS21E                    : 2;
    __IO uint32_t SCS22E                    : 2;
} stc_gpio_fn_sel06_field_t;

typedef struct
{
    __IO uint32_t RTS4E                     : 2;
    __IO uint32_t CTS4S                     : 2;
    __IO uint32_t SIN4S                     : 2;
    __IO uint32_t SOT4B                     : 2;
    __IO uint32_t SCK4B                     : 2;
    __IO uint32_t SCS40B                    : 2;
    __IO uint32_t SCS41E                    : 2;
    uint32_t RESERVED14                     : 6;
    __IO uint32_t SIN5S                     : 2;
    __IO uint32_t SOT5B                     : 2;
    __IO uint32_t SCK5B                     : 2;
    __IO uint32_t SCS50B                    : 2;
} stc_gpio_fn_sel07_field_t;

typedef struct
{
    __IO uint32_t RTS6E                     : 2;
    __IO uint32_t CTS6S                     : 2;
    __IO uint32_t SIN6S                     : 2;
    __IO uint32_t SOT6B                     : 2;
    __IO uint32_t SCK6B                     : 2;
    __IO uint32_t SCS60B                    : 2;
    __IO uint32_t SCS61E                    : 2;
    __IO uint32_t SCS62E                    : 2;
} stc_gpio_fn_sel08_field_t;

typedef struct
{
    __IO uint16_t VCOE                      : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t BZOE                      : 2;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t ICCKE                     : 2;
    __IO uint16_t ICIOB                     : 2;
    __IO uint16_t ICRSTE                    : 2;
} stc_gpio_fn_sel09_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_odr0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_odr1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_odr2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_odr3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_odr4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_odr5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_odr6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_odr7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_odr8_field_t;

typedef struct
{
    __IO uint8_t LVDIE                      : 1;
} stc_gpio_lvdie_field_t;

typedef struct
{
    __IO uint8_t P00                        : 1;
    __IO uint8_t P01                        : 1;
    __IO uint8_t P02                        : 1;
    __IO uint8_t P03                        : 1;
    __IO uint8_t P04                        : 1;
    __IO uint8_t P05                        : 1;
    __IO uint8_t P06                        : 1;
    __IO uint8_t P07                        : 1;
} stc_gpio_fsete0_field_t;

typedef struct
{
    __IO uint8_t P10                        : 1;
    __IO uint8_t P11                        : 1;
    __IO uint8_t P12                        : 1;
    __IO uint8_t P13                        : 1;
    __IO uint8_t P14                        : 1;
    __IO uint8_t P15                        : 1;
    __IO uint8_t P16                        : 1;
    __IO uint8_t P17                        : 1;
} stc_gpio_fsete1_field_t;

typedef struct
{
    __IO uint8_t P20                        : 1;
    __IO uint8_t P21                        : 1;
    __IO uint8_t P22                        : 1;
    __IO uint8_t P23                        : 1;
    __IO uint8_t P24                        : 1;
    __IO uint8_t P25                        : 1;
    __IO uint8_t P26                        : 1;
    __IO uint8_t P27                        : 1;
} stc_gpio_fsete2_field_t;

typedef struct
{
    __IO uint8_t P30                        : 1;
    __IO uint8_t P31                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t P34                        : 1;
    __IO uint8_t P35                        : 1;
    __IO uint8_t P36                        : 1;
    __IO uint8_t P37                        : 1;
} stc_gpio_fsete3_field_t;

typedef struct
{
    __IO uint8_t P40                        : 1;
    __IO uint8_t P41                        : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t P45                        : 1;
    __IO uint8_t P46                        : 1;
    __IO uint8_t P47                        : 1;
} stc_gpio_fsete4_field_t;

typedef struct
{
    __IO uint8_t P50                        : 1;
    __IO uint8_t P51                        : 1;
    __IO uint8_t P52                        : 1;
    __IO uint8_t P53                        : 1;
    __IO uint8_t P54                        : 1;
    __IO uint8_t P55                        : 1;
    __IO uint8_t P56                        : 1;
    __IO uint8_t P57                        : 1;
} stc_gpio_fsete5_field_t;

typedef struct
{
    __IO uint8_t P60                        : 1;
    __IO uint8_t P61                        : 1;
    __IO uint8_t P62                        : 1;
    __IO uint8_t P63                        : 1;
    __IO uint8_t P64                        : 1;
    __IO uint8_t P65                        : 1;
    __IO uint8_t P66                        : 1;
    __IO uint8_t P67                        : 1;
} stc_gpio_fsete6_field_t;

typedef struct
{
    __IO uint8_t P70                        : 1;
    __IO uint8_t P71                        : 1;
    __IO uint8_t P72                        : 1;
    __IO uint8_t P73                        : 1;
    __IO uint8_t P74                        : 1;
} stc_gpio_fsete7_field_t;

typedef struct
{
    __IO uint8_t P80                        : 1;
} stc_gpio_fsete8_field_t;

typedef struct
{
    __IO uint8_t IE                         : 1;
    __IO uint8_t RSTEN                      : 1;
    __IO uint8_t CLKS                       : 1;
} stc_hwwdt_wdt_ctl_field_t;

typedef struct
{
    __IO uint8_t STA                        : 1;
} stc_hwwdt_wdt_sta_field_t;

typedef struct
{
    __IO uint32_t NMI                       : 1;
    __IO uint32_t HWWDG                     : 1;
} stc_irqc_irq_st02_field_t;

typedef struct
{
    __IO uint32_t AFDI                      : 1;
    __IO uint32_t MCSV                      : 1;
    __IO uint32_t SCSV                      : 1;
} stc_irqc_irq00pend_field_t;

typedef struct
{
    __IO uint32_t SWWDG                     : 1;
} stc_irqc_irq01pend_field_t;

typedef struct
{
    __IO uint32_t LVD                       : 1;
} stc_irqc_irq02pend_field_t;

typedef struct
{
    __IO uint32_t EXTI0                     : 1;
    __IO uint32_t EXTI1                     : 1;
    __IO uint32_t EXTI2                     : 1;
    __IO uint32_t EXTI3                     : 1;
    __IO uint32_t EXTI4                     : 1;
    __IO uint32_t EXTI5                     : 1;
    __IO uint32_t EXTI6                     : 1;
    __IO uint32_t EXTI7                     : 1;
} stc_irqc_irq04pend_field_t;

typedef struct
{
    __IO uint32_t EXTI8                     : 1;
    __IO uint32_t EXTI9                     : 1;
    __IO uint32_t EXTI10                    : 1;
    __IO uint32_t EXTI11                    : 1;
    __IO uint32_t EXTI12                    : 1;
    __IO uint32_t EXTI13                    : 1;
    __IO uint32_t EXTI14                    : 1;
    __IO uint32_t EXTI15                    : 1;
} stc_irqc_irq05pend_field_t;

typedef struct
{
    __IO uint32_t DTI1                      : 1;
    __IO uint32_t DTI2                      : 1;
} stc_irqc_irq06pend_field_t;

typedef struct
{
    __IO uint32_t MSC0INT                   : 1;
} stc_irqc_irq07pend_field_t;

typedef struct
{
    __IO uint32_t MSC0INT0                  : 1;
    __IO uint32_t MSC0INT1                  : 1;
} stc_irqc_irq08pend_field_t;

typedef struct
{
    __IO uint32_t MSC1INT                   : 1;
} stc_irqc_irq09pend_field_t;

typedef struct
{
    __IO uint32_t MSC1INT0                  : 1;
    __IO uint32_t MSC1INT1                  : 1;
} stc_irqc_irq10pend_field_t;

typedef struct
{
    __IO uint32_t MSC2INT                   : 1;
} stc_irqc_irq11pend_field_t;

typedef struct
{
    __IO uint32_t MSC2INT0                  : 1;
    __IO uint32_t MSC2INT1                  : 1;
} stc_irqc_irq12pend_field_t;

typedef struct
{
    __IO uint32_t MSC4INT                   : 1;
} stc_irqc_irq15pend_field_t;

typedef struct
{
    __IO uint32_t MSC4INT0                  : 1;
    __IO uint32_t MSC4INT1                  : 1;
} stc_irqc_irq16pend_field_t;

typedef struct
{
    __IO uint32_t MSC5INT                   : 1;
} stc_irqc_irq17pend_field_t;

typedef struct
{
    __IO uint32_t MSC5INT0                  : 1;
    __IO uint32_t MSC5INT1                  : 1;
} stc_irqc_irq18pend_field_t;

typedef struct
{
    __IO uint32_t MSC6INT                   : 1;
} stc_irqc_irq19pend_field_t;

typedef struct
{
    __IO uint32_t MSC6INT0                  : 1;
    __IO uint32_t MSC6INT1                  : 1;
} stc_irqc_irq20pend_field_t;

typedef struct
{
    __IO uint32_t MOSCI                     : 1;
    __IO uint32_t SOSCI                     : 1;
    uint32_t RESERVED2                      : 3;
    __IO uint32_t RTCI                      : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t RAMI                      : 1;
} stc_irqc_irq24pend_field_t;

typedef struct
{
    __IO uint32_t ADCCNVI                   : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t ADCCMPI                   : 1;
} stc_irqc_irq25pend_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 5;
    __IO uint32_t VCI                       : 1;
} stc_irqc_irq26pend_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 6;
    __IO uint32_t ICCI                      : 1;
} stc_irqc_irq27pend_field_t;

typedef struct
{
    __IO uint32_t CTIIRQ0CH0                : 1;
    __IO uint32_t CTIIRQ1CH0                : 1;
    __IO uint32_t CTIIRQ0CH1                : 1;
    __IO uint32_t CTIIRQ1CH1                : 1;
    __IO uint32_t CTIIRQ0CH2                : 1;
    __IO uint32_t CTIIRQ1CH2                : 1;
    __IO uint32_t CTIIRQ0CH3                : 1;
    __IO uint32_t CTIIRQ1CH3                : 1;
    __IO uint32_t CTIIRQ0CH4                : 1;
    __IO uint32_t CTIIRQ1CH4                : 1;
    __IO uint32_t CTIIRQ0CH5                : 1;
    __IO uint32_t CTIIRQ1CH5                : 1;
    __IO uint32_t CTIIRQ0CH6                : 1;
    __IO uint32_t CTIIRQ1CH6                : 1;
    __IO uint32_t CTIIRQ0CH7                : 1;
    __IO uint32_t CTIIRQ1CH7                : 1;
    uint32_t RESERVED16                     :11;
    __IO uint32_t FLASHI                    : 1;
} stc_irqc_irq31pend_field_t;

typedef struct
{
    __IO uint8_t CLKSEL                     : 1;
    __IO uint8_t LCD_FRAME                  : 2;
    __IO uint8_t BIAS                       : 2;
    __IO uint8_t LCD_MODE                   : 3;
} stc_lcdc_lcdcr0_field_t;

typedef struct
{
    __IO uint8_t VLCD                       : 3;
    __IO uint8_t CT                         : 3;
    __IO uint8_t CMOD                       : 1;
} stc_lcdc_lcdcr1_field_t;

typedef struct
{
    __IO uint8_t CP_FREQ                    : 2;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t VSEL                       : 2;
    __IO uint8_t WSEL                       : 1;
} stc_lcdc_lcdcr2_field_t;

typedef struct
{
    __IO uint8_t LCD_EN                     : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t LCD_BUF                    : 2;
} stc_lcdc_lcdcr3_field_t;

typedef struct
{
    __IO uint8_t VE0                        : 1;
    __IO uint8_t VE1                        : 1;
    __IO uint8_t VE2                        : 1;
    __IO uint8_t VE3                        : 1;
    __IO uint8_t VE4                        : 1;
} stc_lcdc_lcddvc_field_t;

typedef struct
{
    __IO uint8_t COME0                      : 1;
    __IO uint8_t COME1                      : 1;
    __IO uint8_t COME2                      : 1;
    __IO uint8_t COME3                      : 1;
    __IO uint8_t COME4                      : 1;
    __IO uint8_t COME5                      : 1;
    __IO uint8_t COME6                      : 1;
    __IO uint8_t COME7                      : 1;
} stc_lcdc_lcdce0_field_t;

typedef struct
{
    __IO uint8_t SEGE0                      : 1;
    __IO uint8_t SEGE1                      : 1;
    __IO uint8_t SEGE2                      : 1;
    __IO uint8_t SEGE3                      : 1;
    __IO uint8_t SEGE4                      : 1;
    __IO uint8_t SEGE5                      : 1;
    __IO uint8_t SEGE6                      : 1;
    __IO uint8_t SEGE7                      : 1;
} stc_lcdc_lcdse0_field_t;

typedef struct
{
    __IO uint8_t SEGE8                      : 1;
    __IO uint8_t SEGE9                      : 1;
    __IO uint8_t SEGE10                     : 1;
    __IO uint8_t SEGE11                     : 1;
    __IO uint8_t SEGE12                     : 1;
    __IO uint8_t SEGE13                     : 1;
    __IO uint8_t SEGE14                     : 1;
    __IO uint8_t SEGE15                     : 1;
} stc_lcdc_lcdse1_field_t;

typedef struct
{
    __IO uint8_t SEGE16                     : 1;
    __IO uint8_t SEGE17                     : 1;
    __IO uint8_t SEGE18                     : 1;
    __IO uint8_t SEGE19                     : 1;
    __IO uint8_t SEGE20                     : 1;
    __IO uint8_t SEGE21                     : 1;
    __IO uint8_t SEGE22                     : 1;
    __IO uint8_t SEGE23                     : 1;
} stc_lcdc_lcdse2_field_t;

typedef struct
{
    __IO uint8_t SEGE24                     : 1;
    __IO uint8_t SEGE25                     : 1;
    __IO uint8_t SEGE26                     : 1;
    __IO uint8_t SEGE27                     : 1;
    __IO uint8_t SEGE28                     : 1;
    __IO uint8_t SEGE29                     : 1;
    __IO uint8_t SEGE30                     : 1;
    __IO uint8_t SEGE31                     : 1;
} stc_lcdc_lcdse3_field_t;

typedef struct
{
    __IO uint8_t SEGE32                     : 1;
    __IO uint8_t SEGE33                     : 1;
    __IO uint8_t SEGE34                     : 1;
    __IO uint8_t SEGE35                     : 1;
    __IO uint8_t SEGE36                     : 1;
    __IO uint8_t SEGE37                     : 1;
    __IO uint8_t SEGE38                     : 1;
    __IO uint8_t SEGE39                     : 1;
} stc_lcdc_lcdse4_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_i2c_mr_field_t;

typedef struct
{
    __IO uint8_t INTF                       : 1;
    __IO uint8_t BERF                       : 1;
    __IO uint8_t INTE                       : 1;
    __IO uint8_t CNDDIE                     : 1;
    __IO uint8_t WTSEL                      : 1;
    __IO uint8_t ACKE                       : 1;
    __IO uint8_t OFITS                      : 1;
    __IO uint8_t MSS                        : 1;
} stc_msc_i2c_bc_field_t;

typedef struct
{
    __IO uint8_t BSS                        : 1;
    __IO uint8_t STPCC                      : 1;
    __IO uint8_t ITSCC                      : 1;
    __IO uint8_t ABL                        : 1;
    __IO uint8_t TRX                        : 1;
    __IO uint8_t RAD                        : 1;
    __IO uint8_t ACKF                       : 1;
    __IO uint8_t FBB                        : 1;
} stc_msc_i2c_bs_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    __IO uint8_t TBIIE                      : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t TEFS                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_i2c_sr_field_t;

