tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
typedef struct
{
    __IO uint16_t BRS                       :15;
} stc_msc_i2c_brs_field_t;

typedef struct
{
    __IO uint8_t ADDR                       : 7;
    __IO uint8_t AE                         : 1;
} stc_msc_i2c_sa_field_t;

typedef struct
{
    __IO uint8_t MSK                        : 7;
    __IO uint8_t EN                         : 1;
} stc_msc_i2c_samsk_field_t;

typedef struct
{
    __IO uint8_t BEC                        : 1;
    __IO uint8_t DOE                        : 1;
    __IO uint8_t SCLOC                      : 1;
    __IO uint8_t SDAOC                      : 1;
    __IO uint8_t SCLS                       : 1;
    __IO uint8_t SDAS                       : 1;
} stc_msc_i2c_ebcr_field_t;

typedef struct
{
    __IO uint8_t DOE                        : 1;
    __IO uint8_t CKE                        : 1;
    __IO uint8_t TDS                        : 1;
    __IO uint8_t CINV                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_spi_mr_field_t;

typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    __IO uint8_t SPIMODE                    : 1;
    __IO uint8_t MSS                        : 1;
    __IO uint8_t PCL                        : 1;
} stc_msc_spi_cr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t DTRWS                      : 2;
    __IO uint8_t CSFE                       : 1;
    __IO uint8_t DL3                        : 1;
    __IO uint8_t SOPS                       : 1;
} stc_msc_spi_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    uint8_t RESERVED4                       : 3;
    __IO uint8_t RECLR                      : 1;
} stc_msc_spi_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
} stc_msc_spi_brs_field_t;

typedef struct
{
    __IO uint8_t CSHDLY                     : 8;
} stc_msc_spi_cstmg0_field_t;

typedef struct
{
    __IO uint8_t CSSDLY                     : 8;
} stc_msc_spi_cstmg1_field_t;

typedef struct
{
    __IO uint16_t CSDS                      :16;
} stc_msc_spi_cstmg32_field_t;

typedef struct
{
    __IO uint16_t TMRE                      : 1;
    __IO uint16_t CLKDIV                    : 4;
    uint16_t RESERVED5                      : 1;
    __IO uint16_t SYNTE                     : 1;
    __IO uint16_t TIE                       : 1;
    __IO uint16_t TIF                       : 1;
    uint16_t RESERVED9                      : 2;
    __IO uint16_t CSER                      : 1;
    __IO uint16_t CSEIE                     : 1;
    __IO uint16_t TBEE                      : 1;
} stc_msc_spi_eacr_field_t;

typedef struct
{
    __IO uint16_t TMR                       :16;
} stc_msc_spi_tmr_field_t;

typedef struct
{
    __IO uint16_t TMC                       :16;
} stc_msc_spi_tmc_field_t;

typedef struct
{
    __IO uint16_t CSOE                      : 1;
    __IO uint16_t CSEN0                     : 1;
    __IO uint16_t CSEN1                     : 1;
    __IO uint16_t CSEN2                     : 1;
    __IO uint16_t CSEN3                     : 1;
    __IO uint16_t CSLVS                     : 1;
    __IO uint16_t CSTODIV                   : 3;
    __IO uint16_t CSAH                      : 1;
    __IO uint16_t CSAD                      : 2;
    __IO uint16_t CSAE                      : 2;
    __IO uint16_t CSAS                      : 2;
} stc_msc_spi_cscr_field_t;

typedef struct
{
    __IO uint8_t CS1DL                      : 4;
    __IO uint8_t CS1TDS                     : 1;
    __IO uint8_t CS1SPI                     : 1;
    __IO uint8_t CS1CINV                    : 1;
    __IO uint8_t CS1CSLVS                   : 1;
} stc_msc_spi_csfr0_field_t;

typedef struct
{
    __IO uint8_t CS2DL                      : 4;
    __IO uint8_t CS2TDS                     : 1;
    __IO uint8_t CS2SPI                     : 1;
    __IO uint8_t CS2CINV                    : 1;
    __IO uint8_t CS2CSLVS                   : 1;
} stc_msc_spi_csfr1_field_t;

typedef struct
{
    __IO uint8_t CS3DL                      : 4;
    __IO uint8_t CS3TDS                     : 1;
    __IO uint8_t CS3SPI                     : 1;
    __IO uint8_t CS3CINV                    : 1;
    __IO uint8_t CS3CSLVS                   : 1;
} stc_msc_spi_csfr2_field_t;

typedef struct
{
    __IO uint8_t DOE                        : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TDS                        : 1;
    __IO uint8_t SBLS                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_uart_mr_field_t;

typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t PCL                        : 1;
} stc_msc_uart_cr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t PS                         : 1;
    __IO uint8_t PE                         : 1;
    __IO uint8_t INV                        : 1;
    __IO uint8_t ESBLS                      : 1;
    __IO uint8_t FCEB                       : 1;
} stc_msc_uart_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    __IO uint8_t FEF                        : 1;
    __IO uint8_t PEF                        : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_uart_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
    __IO uint16_t EXT                       : 1;
} stc_msc_uart_brs_field_t;

typedef struct
{
    __IO uint16_t COMP                      :10;
    uint16_t RESERVED10                     : 5;
    __IO uint16_t CEN                       : 1;
} stc_msc_uart_comp_field_t;

typedef struct
{
    __IO uint32_t TRMKEY                    :32;
} stc_osc_hicr_trmkey_field_t;

typedef struct
{
    __IO uint32_t CR4MFTRM                  : 9;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t CR16MFTRM                 : 9;
} stc_osc_hicr_ftrm_field_t;

typedef struct
{
    __IO uint32_t CR4MTTRM                  : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t CR16MTTRM                 : 4;
} stc_osc_hicr_ttrm_field_t;

typedef struct
{
    __IO uint8_t FMC                        : 2;
} stc_osc_hicr_fmc_field_t;

typedef struct
{
    __IO uint8_t CSR                        : 3;
} stc_osc_hicr_csr_field_t;

typedef struct
{
    __IO uint32_t HXSEL                     : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t HIBS                      : 2;
} stc_osc_hsxt_pwrctl_field_t;

typedef struct
{
    __IO uint32_t LCSEL                     : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t LIBS                      : 2;
} stc_osc_lsxt_pwrctl_field_t;

typedef struct
{
    __IO uint8_t PE                         : 1;
    __IO uint8_t PIE                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t PERROR                     : 1;
} stc_parity_ctl_field_t;

typedef struct
{
    __IO uint32_t ADDR                      :32;
} stc_parity_addr_field_t;

typedef struct
{
    __IO uint32_t MSCCLK0                   : 1;
    __IO uint32_t MSCCLK1                   : 1;
    __IO uint32_t MSCCLK2                   : 1;
    __IO uint32_t MSCCLK4                   : 1;
    __IO uint32_t MSCCLK5                   : 1;
    __IO uint32_t MSCCLK6                   : 1;
    uint32_t RESERVED6                      :10;
    __IO uint32_t ADCCLK                    : 1;
    uint32_t RESERVED17                     :11;
    __IO uint32_t GIOCLK                    : 1;
} stc_pcg_clken0_field_t;

typedef struct
{
    __IO uint32_t MSCRST0                   : 1;
    __IO uint32_t MSCRST1                   : 1;
    __IO uint32_t MSCRST2                   : 1;
    __IO uint32_t MSCRST4                   : 1;
    __IO uint32_t MSCRST5                   : 1;
    __IO uint32_t MSCRST6                   : 1;
    uint32_t RESERVED6                      :10;
    __IO uint32_t ADCRST                    : 1;
} stc_pcg_rstctl0_field_t;

typedef struct
{
    __IO uint32_t CTMCLK0123                : 1;
    __IO uint32_t CTMCLK4567                : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t VCCLK                     : 1;
} stc_pcg_clken1_field_t;

typedef struct
{
    __IO uint32_t CTMRST0123                : 1;
    __IO uint32_t CTMRST4567                : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t VCRST                     : 1;
} stc_pcg_rstctl1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t BUZCLK                    : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t AESCLK                    : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t SCICLK                    : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LCDCCLK                   : 1;
} stc_pcg_clken2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t BUZRST                    : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t AESRST                    : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t SCIRST                    : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LCDCRST                   : 1;
} stc_pcg_rstctl2_field_t;

typedef struct
{
    __IO uint32_t ST                        : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t STAT                      : 1;
    __IO uint32_t SWRST                     : 1;
    __IO uint32_t SENSP                     : 1;
    __IO uint32_t SENRST                    : 1;
    __IO uint32_t BUSY                      : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SENE                      : 1;
    __IO uint32_t MINE                      : 1;
    __IO uint32_t HOUE                      : 1;
    __IO uint32_t DAYE                      : 1;
    __IO uint32_t MONE                      : 1;
    __IO uint32_t YEAE                      : 1;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t INTSSF                    : 1;
    __IO uint32_t INTSF                     : 1;
    __IO uint32_t INTMF                     : 1;
    __IO uint32_t INTHF                     : 1;
    __IO uint32_t INTTMF                    : 1;
    __IO uint32_t INTALF                    : 1;
    __IO uint32_t INTERF                    : 1;
    __IO uint32_t INTCRF                    : 1;
    __IO uint32_t INTSSIEN                  : 1;
    __IO uint32_t INTSIEN                   : 1;
    __IO uint32_t INTMIEN                   : 1;
    __IO uint32_t INTHIEN                   : 1;
    __IO uint32_t INTTMIEN                  : 1;
    __IO uint32_t INTALIEN                  : 1;
    __IO uint32_t INTERIEN                  : 1;
    __IO uint32_t INTCRIEN                  : 1;
} stc_rtc_rtcctl1_field_t;

typedef struct
{
    __IO uint32_t RCTRL                     : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t TCST                      : 1;
    __IO uint32_t TCEN                      : 1;
    __IO uint32_t TCRUN                     : 1;
} stc_rtc_rtcctl2_field_t;

typedef struct
{
    __IO uint32_t CC                        :24;
} stc_rtc_ccs_field_t;

typedef struct
{
    __IO uint8_t LS                         : 4;
    __IO uint8_t HS                         : 3;
} stc_rtc_sen_field_t;

typedef struct
{
    __IO uint8_t LM                         : 4;
    __IO uint8_t HM                         : 3;
} stc_rtc_min_field_t;

typedef struct
{
    __IO uint8_t LH                         : 4;
    __IO uint8_t HH                         : 2;
} stc_rtc_hour_field_t;

typedef struct
{
    __IO uint8_t LD                         : 4;
    __IO uint8_t HD                         : 2;
} stc_rtc_date_field_t;

typedef struct
{
    __IO uint8_t WK                         : 3;
} stc_rtc_week_field_t;

typedef struct
{
    __IO uint8_t LMON                       : 4;
    __IO uint8_t HMON                       : 1;
} stc_rtc_mon_field_t;

typedef struct
{
    __IO uint8_t LY                         : 4;
    __IO uint8_t HY                         : 4;
} stc_rtc_year_field_t;

typedef struct
{
    __IO uint8_t LS                         : 4;
    __IO uint8_t HS                         : 3;
} stc_rtc_asen_field_t;

typedef struct
{
    __IO uint8_t LM                         : 4;
    __IO uint8_t HM                         : 3;
} stc_rtc_amin_field_t;

typedef struct
{
    __IO uint8_t LH                         : 4;
    __IO uint8_t HH                         : 2;
} stc_rtc_ahour_field_t;

typedef struct
{
    __IO uint8_t LD                         : 4;
    __IO uint8_t HD                         : 2;
} stc_rtc_adate_field_t;

typedef struct
{
    __IO uint8_t LMON                       : 4;
    __IO uint8_t HMON                       : 1;
} stc_rtc_amon_field_t;

typedef struct
{
    __IO uint8_t LY                         : 4;
    __IO uint8_t HY                         : 4;
} stc_rtc_ayear_field_t;

typedef struct
{
    __IO uint32_t VAL                       :18;
} stc_rtc_tval_field_t;

typedef struct
{
    __IO uint8_t SCLKI                      : 1;
} stc_rtc_sclki_field_t;

typedef struct
{
    __IO uint8_t SCLKS                      : 2;
} stc_rtc_sclks_field_t;

typedef struct
{
    __IO uint16_t CALVAL                    :10;
} stc_rtc_calval_field_t;

typedef struct
{
    __IO uint8_t CALEN                      : 1;
} stc_rtc_calen_field_t;

typedef struct
{
    __IO uint8_t DIVX                       : 4;
} stc_rtc_clkdivx_field_t;

typedef struct
{
    __IO uint8_t DIVEN                      : 1;
    __IO uint8_t DIVRDY                     : 1;
} stc_rtc_clkdivc_field_t;

typedef struct
{
    __IO uint16_t CALCYC                    : 9;
} stc_rtc_calcyc_field_t;

typedef struct
{
    __IO uint8_t CODIV2                     : 1;
} stc_rtc_rtcodiv_field_t;

typedef struct
{
    __IO uint16_t SSSR0                     : 1;
    __IO uint16_t SSSR1                     : 1;
    __IO uint16_t SSSR2                     : 1;
    __IO uint16_t SSSR3                     : 1;
    __IO uint16_t SSSR4                     : 1;
    __IO uint16_t SSSR5                     : 1;
    __IO uint16_t SSSR6                     : 1;
    __IO uint16_t SSSR7                     : 1;
} stc_sbssr_ctsssr_field_t;

typedef struct
{
    __IO uint8_t EN                         : 1;
    __IO uint8_t FL_EN                      : 1;
    __IO uint8_t PARITY_CHECK_EN            : 1;
    __IO uint8_t RETRY_EN                   : 1;
    __IO uint8_t EDC_EN                     : 1;
    __IO uint8_t ETU_CNT_EN                 : 1;
    __IO uint8_t RX_FIFO_CLR                : 1;
    __IO uint8_t TX_FIFO_CLR                : 1;
} stc_sci_con_field_t;

typedef struct
{
    __IO uint8_t T_MODE                     : 1;
    __IO uint8_t PARITY                     : 1;
    __IO uint8_t CDCVT                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t EDC_MODE                   : 1;
    __IO uint8_t RETRY_TIMES                : 3;
} stc_sci_mode_field_t;

typedef struct
{
    __IO uint8_t RX_FIN                     : 1;
    __IO uint8_t RX_ERR                     : 1;
    __IO uint8_t TX_FIN                     : 1;
    __IO uint8_t TX_ERR                     : 1;
    __IO uint8_t ETU_CNT_FIN                : 1;
    __IO uint8_t STAT                       : 1;
    __IO uint8_t RX_OVR                     : 1;
    __IO uint8_t RX_NE                      : 1;
} stc_sci_status_field_t;

typedef struct
{
    __IO uint8_t RX_EPTB                    : 1;
    __IO uint8_t RX_FUL                     : 1;
    __IO uint8_t RX_UDR                     : 1;
    __IO uint8_t RX_OVR                     : 1;
    __IO uint8_t TX_EPTB                    : 1;
    __IO uint8_t TX_FUL                     : 1;
    __IO uint8_t TX_UDR                     : 1;
    __IO uint8_t TX_EPT                     : 1;
} stc_sci_fifo_status_field_t;

typedef struct
{
    __IO uint8_t RX_FIFO_DEPTH              : 4;
    __IO uint8_t TX_FIFO_DEPTH              : 4;
} stc_sci_fifo_depth_field_t;

typedef struct
{
    __IO uint8_t DATA                       : 8;
} stc_sci_data_field_t;

typedef struct
{
    __IO uint16_t EDC_DATA                  :16;
} stc_sci_edc_data_field_t;

typedef struct
{
    __IO uint16_t SBDR                      :14;
    __IO uint16_t ETU_SEL                   : 2;
} stc_sci_sbdr_field_t;

typedef struct
{
    __IO uint16_t ETU_CNT                   :16;
} stc_sci_etu_cnt_field_t;

typedef struct
{
    __IO uint8_t FL_NUM                     : 3;
} stc_sci_f1_num_field_t;

typedef struct
{
    __IO uint8_t RESET_EN                   : 1;
    __IO uint8_t RESET                      : 1;
    __IO uint8_t CLK_EN                     : 1;
    __IO uint8_t CLK_SEL                    : 2;
} stc_sci_clk_rst_field_t;

typedef struct
{
    __IO uint8_t WAKEUP_INT_EN              : 1;
    __IO uint8_t ETU_CNT_INT_EN             : 1;
    __IO uint8_t INT_EN                     : 1;
} stc_sci_int_en_field_t;

typedef struct
{
    __IO uint8_t WAKEUP_INT                 : 1;
} stc_sci_wakeup_int_field_t;

typedef struct
{
    __IO uint8_t IE                         : 1;
    __IO uint8_t RSTEN                      : 1;
    __IO uint8_t TMWD                       : 2;
    __IO uint8_t WDM                        : 1;
} stc_swwdt_wdt_ctl_field_t;

typedef struct
{
    __IO uint8_t STA                        : 1;
} stc_swwdt_wdt_sta_field_t;

typedef struct
{
    __IO uint8_t TRG                        : 1;
} stc_swwdt_wdt_mdc_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr0_field_t;

typedef struct
{
    __IO uint32_t UID                       :32;
} stc_uid_uidr1_field_t;

typedef struct
{
    __IO uint32_t UID                       :16;
} stc_uid_uidr2_field_t;

typedef struct
{
    __IO uint16_t VC_EN                     : 1;
    __IO uint16_t VC_OUT                    : 1;
    __IO uint16_t VC_NMODE                  : 2;
    __IO uint16_t VC_PMODE                  : 2;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t VCVOL_SEL                 : 6;
    __IO uint16_t VCDIV_EN                  : 1;
    __IO uint16_t VCDIV_SEL                 : 1;
} stc_vc_ctl1_field_t;

typedef struct
{
    __IO uint16_t VC_FILTER_EN              : 1;
    __IO uint16_t VC_RESPONSE               : 3;
    __IO uint16_t VC_EXBUF                  : 1;
    __IO uint16_t VCINT_FALLING             : 1;
    __IO uint16_t VCINT_RISING              : 1;
    __IO uint16_t VCINT_HIGH                : 1;
    __IO uint16_t VC2PT                     : 1;
    __IO uint16_t VCIE                      : 1;
    __IO uint16_t VCIF                      : 1;
    __IO uint16_t VC_HYS_SEL                : 2;
} stc_vc_ctl2_field_t;

typedef struct
{
    __IO uint8_t VC_TM0G                    : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t VC_TM2G                    : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t VCIN_NEG_SEL               : 2;
    __IO uint8_t VCIN_POS_SEL               : 2;
} stc_vc_ctl3_field_t;

typedef struct
{
    __IO uint8_t LVD_EN                     : 1;
    __IO uint8_t LVD_SRST                   : 1;
    __IO uint8_t LVD_VIN                    : 2;
    __IO uint8_t LVD_VSET                   : 4;
} stc_wsunit_lvd_ctrl1_field_t;

typedef struct
{
    __IO uint8_t LVD_HYS_EN                 : 1;
    __IO uint8_t LVD_F_EN                   : 1;
    __IO uint8_t LVD_F_SET                  : 3;
    __IO uint8_t LVD_IE                     : 2;
} stc_wsunit_lvd_ctrl2_field_t;

typedef struct
{
    __IO uint16_t LVD_IRQ                   : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t LVD_OUT                   : 1;
} stc_wsunit_lvd_str_field_t;

typedef struct
{
    __IO uint8_t LVD_CLR                    : 1;
} stc_wsunit_lvd_clr_field_t;

typedef struct
{
    __IO uint8_t LVD2_EN                    : 1;
    __IO uint8_t LVD2_VSET                  : 3;
    __IO uint8_t LVD2_IE                    : 1;
} stc_wsunit_lvd2_ctl_field_t;

typedef struct
{
    __IO uint16_t LVD2_IRQ                  : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t SENSE_STA                 : 1;
    __IO uint16_t LVD2_STA                  : 1;
} stc_wsunit_lvd2_str_field_t;

typedef struct
{
    __IO uint8_t LVD2_CLR                   : 1;
} stc_wsunit_lvd2_clr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t AUTOSWEN                  : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t KEY                       :16;
} stc_wsunit_ldo_ctl_field_t;

typedef struct
{
    __IO uint8_t BGR_EN                     : 1;
} stc_wsunit_bgr_ctl_field_t;

typedef struct
{
    __IO uint8_t RTCE                       : 1;
} stc_wsunit_clk_ctl1_field_t;

typedef struct
{
    __IO uint8_t RTCCKE                     : 1;
    __IO uint8_t LCDCKE                     : 1;
    __IO uint8_t WDTCKE                     : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UARTCKE                    : 1;
} stc_wsunit_clk_ctl2_field_t;

typedef struct
{
    __IO uint8_t IMAINSEL                   : 2;
} stc_wsunit_mosc_ctl_field_t;

typedef struct
{
    __IO uint8_t RAMP                       : 1;
} stc_wsunit_ds_ramp_field_t;

typedef struct
{
    __IO uint8_t REINTX                     : 1;
    __IO uint8_t RELVDR                     : 1;
} stc_wsunit_wake_rsr_field_t;

typedef struct
{
    __IO uint8_t RERTCI                     : 1;
    __IO uint8_t RELVDI                     : 1;
    __IO uint8_t REWU0I                     : 1;
    __IO uint8_t REWU1I                     : 1;
    __IO uint8_t REWU2I                     : 1;
    __IO uint8_t REWU3I                     : 1;
} stc_wsunit_wake_isr_field_t;

typedef struct
{
    __IO uint8_t RERTCE                     : 1;
    __IO uint8_t RELVDE                     : 1;
    __IO uint8_t REWU0E                     : 1;
    __IO uint8_t REWU1E                     : 1;
    __IO uint8_t REWU2E                     : 1;
    __IO uint8_t REWU3E                     : 1;
} stc_wsunit_wake_ier_field_t;

typedef struct
{
    __IO uint8_t WUI0LV                     : 1;
    __IO uint8_t WUI1LV                     : 1;
    __IO uint8_t WUI2LV                     : 1;
    __IO uint8_t WUI3LV                     : 1;
} stc_wsunit_wake_lvr_field_t;


