tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
typedef struct
{
    union
    {
        __IO uint32_t CTL1;
        stc_adc_ctl1_field_t CTL1_f;
    };
    union
    {
        __IO uint8_t CTL2;
        stc_adc_ctl2_field_t CTL2_f;
    };
    uint8_t RESERVED2[7];
    union
    {
        __IO uint16_t RESULT;
        stc_adc_result_field_t RESULT_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint32_t ADCMPIF;
        stc_adc_adcmpif_field_t ADCMPIF_f;
    };
    union
    {
        __IO uint32_t ADCMPF;
        stc_adc_adcmpf_field_t ADCMPF_f;
    };
    union
    {
        __IO uint16_t ADCMPCTL;
        stc_adc_adcmpctl_field_t ADCMPCTL_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t ADCMPL;
        stc_adc_adcmpl_field_t ADCMPL_f;
    };
    union
    {
        __IO uint16_t ADCMPH;
        stc_adc_adcmph_field_t ADCMPH_f;
    };
}M0P_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CON;
        stc_aes_con_field_t CON_f;
    };
    uint8_t RESERVED1[14];
    union
    {
        __IO uint32_t DATA0;
        stc_aes_data0_field_t DATA0_f;
    };
    union
    {
        __IO uint32_t DATA1;
        stc_aes_data1_field_t DATA1_f;
    };
    union
    {
        __IO uint32_t DATA2;
        stc_aes_data2_field_t DATA2_f;
    };
    union
    {
        __IO uint32_t DATA3;
        stc_aes_data3_field_t DATA3_f;
    };
    union
    {
        __IO uint32_t KEY0;
        stc_aes_key0_field_t KEY0_f;
    };
    union
    {
        __IO uint32_t KEY1;
        stc_aes_key1_field_t KEY1_f;
    };
    union
    {
        __IO uint32_t KEY2;
        stc_aes_key2_field_t KEY2_f;
    };
    union
    {
        __IO uint32_t KEY3;
        stc_aes_key3_field_t KEY3_f;
    };
    union
    {
        __IO uint32_t KEY4;
        stc_aes_key4_field_t KEY4_f;
    };
    union
    {
        __IO uint32_t KEY5;
        stc_aes_key5_field_t KEY5_f;
    };
    union
    {
        __IO uint32_t KEY6;
        stc_aes_key6_field_t KEY6_f;
    };
    union
    {
        __IO uint32_t KEY7;
        stc_aes_key7_field_t KEY7_f;
    };
    union
    {
        __IO uint32_t RNG0;
        stc_aes_rng0_field_t RNG0_f;
    };
    union
    {
        __IO uint32_t RNG1;
        stc_aes_rng1_field_t RNG1_f;
    };
    uint8_t RESERVED15[8];
    union
    {
        __IO uint8_t INT_CON;
        stc_aes_int_con_field_t INT_CON_f;
    };
    uint8_t RESERVED16[15];
    union
    {
        __IO uint8_t DIV_EN;
        stc_aes_div_en_field_t DIV_EN_f;
    };
}M0P_AES_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t BUZ_CTL;
        stc_buzzer_buz_ctl_field_t BUZ_CTL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t BUZ_CNT;
        stc_buzzer_buz_cnt_field_t BUZ_CNT_f;
    };
}M0P_BUZZER_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CTRL;
        stc_clock_ctrl_field_t CTRL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t CLK_STB;
        stc_clock_clk_stb_field_t CLK_STB_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint32_t LPM_CTL;
        stc_clock_lpm_ctl_field_t LPM_CTL_f;
    };
    union
    {
        __IO uint16_t STAT;
        stc_clock_stat_field_t STAT_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t BC_DIV;
        stc_clock_bc_div_field_t BC_DIV_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t APB0_CTRL;
        stc_clock_apb0_ctrl_field_t APB0_CTRL_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t APB1_CTRL;
        stc_clock_apb1_ctrl_field_t APB1_CTRL_f;
    };
    uint8_t RESERVED7[7];
    union
    {
        __IO uint8_t CLK_CTL;
        stc_clock_clk_ctl_field_t CLK_CTL_f;
    };
    uint8_t RESERVED8[15];
    union
    {
        __IO uint8_t CSWT;
        stc_clock_cswt_field_t CSWT_f;
    };
    uint8_t RESERVED9[15];
    union
    {
        __IO uint16_t FCM_CTL;
        stc_clock_fcm_ctl_field_t FCM_CTL_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint8_t FCM_STR;
        stc_clock_fcm_str_field_t FCM_STR_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint16_t AFDWH_CTL;
        stc_clock_afdwh_ctl_field_t AFDWH_CTL_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t AFDWL_CTL;
        stc_clock_afdwl_ctl_field_t AFDWL_CTL_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t AFDC_CTL;
        stc_clock_afdc_ctl_field_t AFDC_CTL_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint8_t DBWDT_CTRL;
        stc_clock_dbwdt_ctrl_field_t DBWDT_CTRL_f;
    };
    uint8_t RESERVED15[11];
    union
    {
        __IO uint8_t INT_CTRL;
        stc_clock_int_ctrl_field_t INT_CTRL_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t INT_PEND;
        stc_clock_int_pend_field_t INT_PEND_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t INT_CLR;
        stc_clock_int_clr_field_t INT_CLR_f;
    };
}M0P_CLOCK_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTSEL0123;
        stc_ctiosel03_ctsel0123_field_t CTSEL0123_f;
    };
}M0P_CTIOSEL03_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTSEL4567;
        stc_ctiosel47_ctsel4567_field_t CTSEL4567_f;
    };
}M0P_CTIOSEL47_TypeDef;

typedef struct
{
    __IO uint16_t LWRR;
    uint8_t RESERVED1[2];
    __IO uint16_t HWRR;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_ppg_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_ppg_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_ppg_tcr2_field_t TCR2_f;
    };
}M0P_CT_PPG_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    __IO uint16_t DBUF;
    uint8_t RESERVED1[6];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwc_tcr_field_t TCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwc_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwc_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWC_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[2];
    __IO uint16_t DUT;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwm_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwm_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwm_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWM_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[6];
    __IO uint16_t TCNT;
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_rt_tcr_field_t TCR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_rt_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_rt_tcr2_field_t TCR2_f;
    };
}M0P_CT_RT_TypeDef;

typedef struct
{
    __IO uint32_t TIMERLOAD;
    __IO uint32_t TIMERVALUE;
    union
    {
        __IO uint32_t TIMERCTRL;
        stc_dtim_timerctrl_field_t TIMERCTRL_f;
    };
    __IO uint32_t TIMERINTCLR;
    union
    {
        __IO uint32_t TIMERRIS;
        stc_dtim_timerris_field_t TIMERRIS_f;
    };
    union
    {
        __IO uint32_t TIMERMIS;
        stc_dtim_timermis_field_t TIMERMIS_f;
    };
    __IO uint32_t TIMERBGLOAD;
}M0P_DTIM_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t INTEN;
        stc_extint_inten_field_t INTEN_f;
    };
    union
    {
        __IO uint32_t INTSRC;
        stc_extint_intsrc_field_t INTSRC_f;
    };
    union
    {
        __IO uint32_t INTCLR;
        stc_extint_intclr_field_t INTCLR_f;
    };
    union
    {
        __IO uint32_t INTLVL;
        stc_extint_intlvl_field_t INTLVL_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint16_t NMISRC;
        stc_extint_nmisrc_field_t NMISRC_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t NMICLR;
        stc_extint_nmiclr_field_t NMICLR_f;
    };
}M0P_EXTINT_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t FGET0;
        stc_fastio_fget0_field_t FGET0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FGET1;
        stc_fastio_fget1_field_t FGET1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t FGET2;
        stc_fastio_fget2_field_t FGET2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FGET3;
        stc_fastio_fget3_field_t FGET3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FGET4;
        stc_fastio_fget4_field_t FGET4_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t FGET5;
        stc_fastio_fget5_field_t FGET5_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FGET6;
        stc_fastio_fget6_field_t FGET6_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t FGET7;
        stc_fastio_fget7_field_t FGET7_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t FGET8;
        stc_fastio_fget8_field_t FGET8_f;
    };
    uint8_t RESERVED9[31];
    union
    {
        __IO uint8_t FSET0;
        stc_fastio_fset0_field_t FSET0_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t FSET1;
        stc_fastio_fset1_field_t FSET1_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t FSET2;
        stc_fastio_fset2_field_t FSET2_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t FSET3;
        stc_fastio_fset3_field_t FSET3_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t FSET4;
        stc_fastio_fset4_field_t FSET4_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t FSET5;
        stc_fastio_fset5_field_t FSET5_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t FSET6;
        stc_fastio_fset6_field_t FSET6_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t FSET7;
        stc_fastio_fset7_field_t FSET7_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t FSET8;
        stc_fastio_fset8_field_t FSET8_f;
    };
}M0P_FASTIO_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t FOCR;
        stc_flash_focr_field_t FOCR_f;
    };
    union
    {
        __IO uint32_t FLCR0;
        stc_flash_flcr0_field_t FLCR0_f;
    };
    union
    {
        __IO uint32_t FLCR1;
        stc_flash_flcr1_field_t FLCR1_f;
    };
    union
    {
        __IO uint32_t FSTR;
        stc_flash_fstr_field_t FSTR_f;
    };
    union
    {
        __IO uint32_t FWCICR;
        stc_flash_fwcicr_field_t FWCICR_f;
    };
    union
    {
        __IO uint32_t FUDR0;
        stc_flash_fudr0_field_t FUDR0_f;
    };
    union
    {
        __IO uint32_t FUDR1;
        stc_flash_fudr1_field_t FUDR1_f;
    };
    union
    {
        __IO uint32_t FUDR2;
        stc_flash_fudr2_field_t FUDR2_f;
    };
    union
    {
        __IO uint32_t FUDR3;
        stc_flash_fudr3_field_t FUDR3_f;
    };
    union
    {
        __IO uint8_t TNVS;
        stc_flash_tnvs_field_t TNVS_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t TPROG;
        stc_flash_tprog_field_t TPROG_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t TPGS;
        stc_flash_tpgs_field_t TPGS_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t TRCVPGM;
        stc_flash_trcvpgm_field_t TRCVPGM_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t TRCVPERS;
        stc_flash_trcvpers_field_t TRCVPERS_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t TRCVCERS;
        stc_flash_trcvcers_field_t TRCVCERS_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t TPERS;
        stc_flash_tpers_field_t TPERS_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t TCERS;
        stc_flash_tcers_field_t TCERS_f;
    };
}M0P_FLASH_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t FN0;
        stc_gpio_fn0_field_t FN0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FN1;
        stc_gpio_fn1_field_t FN1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t FN2;
        stc_gpio_fn2_field_t FN2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FN3;
        stc_gpio_fn3_field_t FN3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FN4;
        stc_gpio_fn4_field_t FN4_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t FN5;
        stc_gpio_fn5_field_t FN5_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FN6;
        stc_gpio_fn6_field_t FN6_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t FN7;
        stc_gpio_fn7_field_t FN7_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t FN8;
        stc_gpio_fn8_field_t FN8_f;
    };
    uint8_t RESERVED9[223];
    union
    {
        __IO uint8_t PU0;
        stc_gpio_pu0_field_t PU0_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t PU1;
        stc_gpio_pu1_field_t PU1_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t PU2;
        stc_gpio_pu2_field_t PU2_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t PU3;
        stc_gpio_pu3_field_t PU3_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t PU4;
        stc_gpio_pu4_field_t PU4_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t PU5;
        stc_gpio_pu5_field_t PU5_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t PU6;
        stc_gpio_pu6_field_t PU6_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t PU7;
        stc_gpio_pu7_field_t PU7_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t PU8;
        stc_gpio_pu8_field_t PU8_f;
    };
    uint8_t RESERVED18[223];
    union
    {
        __IO uint8_t DIR0;
        stc_gpio_dir0_field_t DIR0_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t DIR1;
        stc_gpio_dir1_field_t DIR1_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint8_t DIR2;
        stc_gpio_dir2_field_t DIR2_f;
    };
    uint8_t RESERVED21[3];
    union
    {
        __IO uint8_t DIR3;
        stc_gpio_dir3_field_t DIR3_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint8_t DIR4;
        stc_gpio_dir4_field_t DIR4_f;
    };
    uint8_t RESERVED23[3];
    union
    {
        __IO uint8_t DIR5;
        stc_gpio_dir5_field_t DIR5_f;
    };
    uint8_t RESERVED24[3];
    union
    {
        __IO uint8_t DIR6;
        stc_gpio_dir6_field_t DIR6_f;
    };
    uint8_t RESERVED25[3];
    union
    {
        __IO uint8_t DIR7;
        stc_gpio_dir7_field_t DIR7_f;
    };
    uint8_t RESERVED26[3];
    union
    {
        __IO uint8_t DIR8;
        stc_gpio_dir8_field_t DIR8_f;
    };
    uint8_t RESERVED27[223];
    union
    {
        __IO uint8_t GET0;
        stc_gpio_get0_field_t GET0_f;
    };
    uint8_t RESERVED28[3];
    union
    {
        __IO uint8_t GET1;
        stc_gpio_get1_field_t GET1_f;
    };
    uint8_t RESERVED29[3];
    union
    {
        __IO uint8_t GET2;
        stc_gpio_get2_field_t GET2_f;
    };
    uint8_t RESERVED30[3];
    union
    {
        __IO uint8_t GET3;
        stc_gpio_get3_field_t GET3_f;
    };
    uint8_t RESERVED31[3];
    union
    {
        __IO uint8_t GET4;
        stc_gpio_get4_field_t GET4_f;
    };
    uint8_t RESERVED32[3];
    union
    {
        __IO uint8_t GET5;
        stc_gpio_get5_field_t GET5_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t GET6;
        stc_gpio_get6_field_t GET6_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint8_t GET7;
        stc_gpio_get7_field_t GET7_f;
    };
    uint8_t RESERVED35[3];
    union
    {
        __IO uint8_t GET8;
        stc_gpio_get8_field_t GET8_f;
    };
    uint8_t RESERVED36[223];
    union
    {
        __IO uint8_t SET0;
        stc_gpio_set0_field_t SET0_f;
    };
    uint8_t RESERVED37[3];
    union
    {
        __IO uint8_t SET1;
        stc_gpio_set1_field_t SET1_f;
    };
    uint8_t RESERVED38[3];
    union
    {
        __IO uint8_t SET2;
        stc_gpio_set2_field_t SET2_f;
    };
    uint8_t RESERVED39[3];
    union
    {
        __IO uint8_t SET3;
        stc_gpio_set3_field_t SET3_f;
    };
    uint8_t RESERVED40[3];
    union
    {
        __IO uint8_t SET4;
        stc_gpio_set4_field_t SET4_f;
    };
    uint8_t RESERVED41[3];
    union
    {
        __IO uint8_t SET5;
        stc_gpio_set5_field_t SET5_f;
    };
    uint8_t RESERVED42[3];
    union
    {
        __IO uint8_t SET6;
        stc_gpio_set6_field_t SET6_f;
    };
    uint8_t RESERVED43[3];
    union
    {
        __IO uint8_t SET7;
        stc_gpio_set7_field_t SET7_f;
    };
    uint8_t RESERVED44[3];
    union
    {
        __IO uint8_t SET8;
        stc_gpio_set8_field_t SET8_f;
    };
    uint8_t RESERVED45[223];
    union
    {
        __IO uint16_t ANALOG;
        stc_gpio_analog_field_t ANALOG_f;
    };
    uint8_t RESERVED46[126];
    union
    {
        __IO uint8_t SPS;
        stc_gpio_sps_field_t SPS_f;
    };
    uint8_t RESERVED47[127];
    union
    {
        __IO uint16_t FN_SEL00;
        stc_gpio_fn_sel00_field_t FN_SEL00_f;
    };
    uint8_t RESERVED48[6];
    union
    {
        __IO uint32_t FN_SEL02;
        stc_gpio_fn_sel02_field_t FN_SEL02_f;
    };
    union
    {
        __IO uint32_t FN_SEL03;
        stc_gpio_fn_sel03_field_t FN_SEL03_f;
    };
    union
    {
        __IO uint32_t FN_SEL04;
        stc_gpio_fn_sel04_field_t FN_SEL04_f;
    };
    union
    {
        __IO uint32_t FN_SEL05;
        stc_gpio_fn_sel05_field_t FN_SEL05_f;
    };
    union
    {
        __IO uint32_t FN_SEL06;
        stc_gpio_fn_sel06_field_t FN_SEL06_f;
    };
    union
    {
        __IO uint32_t FN_SEL07;
        stc_gpio_fn_sel07_field_t FN_SEL07_f;
    };
    union
    {
        __IO uint32_t FN_SEL08;
        stc_gpio_fn_sel08_field_t FN_SEL08_f;
    };
    union
    {
        __IO uint16_t FN_SEL09;
        stc_gpio_fn_sel09_field_t FN_SEL09_f;
    };
    uint8_t RESERVED56[218];
    union
    {
        __IO uint8_t ODR0;
        stc_gpio_odr0_field_t ODR0_f;
    };
    uint8_t RESERVED57[3];
    union
    {
        __IO uint8_t ODR1;
        stc_gpio_odr1_field_t ODR1_f;
    };
    uint8_t RESERVED58[3];
    union
    {
        __IO uint8_t ODR2;
        stc_gpio_odr2_field_t ODR2_f;
    };
    uint8_t RESERVED59[3];
    union
    {
        __IO uint8_t ODR3;
        stc_gpio_odr3_field_t ODR3_f;
    };
    uint8_t RESERVED60[3];
    union
    {
        __IO uint8_t ODR4;
        stc_gpio_odr4_field_t ODR4_f;
    };
    uint8_t RESERVED61[3];
    union
    {
        __IO uint8_t ODR5;
        stc_gpio_odr5_field_t ODR5_f;
    };
    uint8_t RESERVED62[3];
    union
    {
        __IO uint8_t ODR6;
        stc_gpio_odr6_field_t ODR6_f;
    };
    uint8_t RESERVED63[3];
    union
    {
        __IO uint8_t ODR7;
        stc_gpio_odr7_field_t ODR7_f;
    };
    uint8_t RESERVED64[3];
    union
    {
        __IO uint8_t ODR8;
        stc_gpio_odr8_field_t ODR8_f;
    };
    uint8_t RESERVED65[31];
    union
    {
        __IO uint8_t LVDIE;
        stc_gpio_lvdie_field_t LVDIE_f;
    };
    uint8_t RESERVED66[447];
    union
    {
        __IO uint8_t FSETE0;
        stc_gpio_fsete0_field_t FSETE0_f;
    };
    uint8_t RESERVED67[3];
    union
    {
        __IO uint8_t FSETE1;
        stc_gpio_fsete1_field_t FSETE1_f;
    };
    uint8_t RESERVED68[3];
    union
    {
        __IO uint8_t FSETE2;
        stc_gpio_fsete2_field_t FSETE2_f;
    };
    uint8_t RESERVED69[3];
    union
    {
        __IO uint8_t FSETE3;
        stc_gpio_fsete3_field_t FSETE3_f;
    };
    uint8_t RESERVED70[3];
    union
    {
        __IO uint8_t FSETE4;
        stc_gpio_fsete4_field_t FSETE4_f;
    };
    uint8_t RESERVED71[3];
    union
    {
        __IO uint8_t FSETE5;
        stc_gpio_fsete5_field_t FSETE5_f;
    };
    uint8_t RESERVED72[3];
    union
    {
        __IO uint8_t FSETE6;
        stc_gpio_fsete6_field_t FSETE6_f;
    };
    uint8_t RESERVED73[3];
    union
    {
        __IO uint8_t FSETE7;
        stc_gpio_fsete7_field_t FSETE7_f;
    };
    uint8_t RESERVED74[3];
    union
    {
        __IO uint8_t FSETE8;
        stc_gpio_fsete8_field_t FSETE8_f;
    };
}M0P_GPIO_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_hwwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint8_t WDT_INTCLR;
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t WDT_STA;
        stc_hwwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[3];
    __IO uint32_t WDT_LCK;
}M0P_HWWDT_TypeDef;

typedef struct
{
    uint8_t RESERVED0[16];
    union
    {
        __IO uint32_t IRQ_ST02;
        stc_irqc_irq_st02_field_t IRQ_ST02_f;
    };
    union
    {
        __IO uint32_t IRQ00PEND;
        stc_irqc_irq00pend_field_t IRQ00PEND_f;
    };
    union
    {
        __IO uint32_t IRQ01PEND;
        stc_irqc_irq01pend_field_t IRQ01PEND_f;
    };
    union
    {
        __IO uint32_t IRQ02PEND;
        stc_irqc_irq02pend_field_t IRQ02PEND_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint32_t IRQ04PEND;
        stc_irqc_irq04pend_field_t IRQ04PEND_f;
    };
    union
    {
        __IO uint32_t IRQ05PEND;
        stc_irqc_irq05pend_field_t IRQ05PEND_f;
    };
    union
    {
        __IO uint32_t IRQ06PEND;
        stc_irqc_irq06pend_field_t IRQ06PEND_f;
    };
    union
    {
        __IO uint32_t IRQ07PEND;
        stc_irqc_irq07pend_field_t IRQ07PEND_f;
    };
    union
    {
        __IO uint32_t IRQ08PEND;
        stc_irqc_irq08pend_field_t IRQ08PEND_f;
    };
    union
    {
        __IO uint32_t IRQ09PEND;
        stc_irqc_irq09pend_field_t IRQ09PEND_f;
    };
    union
    {
        __IO uint32_t IRQ10PEND;
        stc_irqc_irq10pend_field_t IRQ10PEND_f;
    };
    union
    {
        __IO uint32_t IRQ11PEND;
        stc_irqc_irq11pend_field_t IRQ11PEND_f;
    };
    union
    {
        __IO uint32_t IRQ12PEND;
        stc_irqc_irq12pend_field_t IRQ12PEND_f;
    };
    uint8_t RESERVED13[8];
    union
    {
        __IO uint32_t IRQ15PEND;
        stc_irqc_irq15pend_field_t IRQ15PEND_f;
    };
    union
    {
        __IO uint32_t IRQ16PEND;
        stc_irqc_irq16pend_field_t IRQ16PEND_f;
    };
    union
    {
        __IO uint32_t IRQ17PEND;
        stc_irqc_irq17pend_field_t IRQ17PEND_f;
    };
    union
    {
        __IO uint32_t IRQ18PEND;
        stc_irqc_irq18pend_field_t IRQ18PEND_f;
    };
    union
    {
        __IO uint32_t IRQ19PEND;
        stc_irqc_irq19pend_field_t IRQ19PEND_f;
    };
    union
    {
        __IO uint32_t IRQ20PEND;
        stc_irqc_irq20pend_field_t IRQ20PEND_f;
    };
    uint8_t RESERVED19[12];
    union
    {
        __IO uint32_t IRQ24PEND;
        stc_irqc_irq24pend_field_t IRQ24PEND_f;
    };
    union
    {
        __IO uint32_t IRQ25PEND;
        stc_irqc_irq25pend_field_t IRQ25PEND_f;
    };
    union
    {
        __IO uint32_t IRQ26PEND;
        stc_irqc_irq26pend_field_t IRQ26PEND_f;
    };
    union
    {
        __IO uint32_t IRQ27PEND;
        stc_irqc_irq27pend_field_t IRQ27PEND_f;
    };
    uint8_t RESERVED23[12];
    union
    {
        __IO uint32_t IRQ31PEND;
        stc_irqc_irq31pend_field_t IRQ31PEND_f;
    };
}M0P_IRQC_TypeDef;

