tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
typedef struct
{
    union
    {
        __IO uint8_t LCDCR0;
        stc_lcdc_lcdcr0_field_t LCDCR0_f;
    };
    union
    {
        __IO uint8_t LCDCR1;
        stc_lcdc_lcdcr1_field_t LCDCR1_f;
    };
    union
    {
        __IO uint8_t LCDCR2;
        stc_lcdc_lcdcr2_field_t LCDCR2_f;
    };
    union
    {
        __IO uint8_t LCDCR3;
        stc_lcdc_lcdcr3_field_t LCDCR3_f;
    };
    union
    {
        __IO uint8_t LCDDVC;
        stc_lcdc_lcddvc_field_t LCDDVC_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t LCDCE0;
        stc_lcdc_lcdce0_field_t LCDCE0_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t LCDSE0;
        stc_lcdc_lcdse0_field_t LCDSE0_f;
    };
    union
    {
        __IO uint8_t LCDSE1;
        stc_lcdc_lcdse1_field_t LCDSE1_f;
    };
    union
    {
        __IO uint8_t LCDSE2;
        stc_lcdc_lcdse2_field_t LCDSE2_f;
    };
    union
    {
        __IO uint8_t LCDSE3;
        stc_lcdc_lcdse3_field_t LCDSE3_f;
    };
    union
    {
        __IO uint8_t LCDSE4;
        stc_lcdc_lcdse4_field_t LCDSE4_f;
    };
    uint8_t RESERVED11[3];
    __IO uint8_t LCDRAM00;
    __IO uint8_t LCDRAM01;
    __IO uint8_t LCDRAM02;
    __IO uint8_t LCDRAM03;
    __IO uint8_t LCDRAM04;
    __IO uint8_t LCDRAM05;
    __IO uint8_t LCDRAM06;
    __IO uint8_t LCDRAM07;
    __IO uint8_t LCDRAM08;
    __IO uint8_t LCDRAM09;
    __IO uint8_t LCDRAM10;
    __IO uint8_t LCDRAM11;
    __IO uint8_t LCDRAM12;
    __IO uint8_t LCDRAM13;
    __IO uint8_t LCDRAM14;
    __IO uint8_t LCDRAM15;
    __IO uint8_t LCDRAM16;
    __IO uint8_t LCDRAM17;
    __IO uint8_t LCDRAM18;
    __IO uint8_t LCDRAM19;
    __IO uint8_t LCDRAM20;
    __IO uint8_t LCDRAM21;
    __IO uint8_t LCDRAM22;
    __IO uint8_t LCDRAM23;
    __IO uint8_t LCDRAM24;
    __IO uint8_t LCDRAM25;
    __IO uint8_t LCDRAM26;
    __IO uint8_t LCDRAM27;
    __IO uint8_t LCDRAM28;
    __IO uint8_t LCDRAM29;
    __IO uint8_t LCDRAM30;
    __IO uint8_t LCDRAM31;
    __IO uint8_t LCDRAM32;
    __IO uint8_t LCDRAM33;
    __IO uint8_t LCDRAM34;
    __IO uint8_t LCDRAM35;
    __IO uint8_t LCDRAM36;
    __IO uint8_t LCDRAM37;
    __IO uint8_t LCDRAM38;
    __IO uint8_t LCDRAM39;
}M0P_LCDC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_i2c_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t BC;
        stc_msc_i2c_bc_field_t BC_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t BS;
        stc_msc_i2c_bs_field_t BS_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_i2c_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_i2c_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint8_t SA;
        stc_msc_i2c_sa_field_t SA_f;
    };
    union
    {
        __IO uint8_t SAMSK;
        stc_msc_i2c_samsk_field_t SAMSK_f;
    };
    uint8_t RESERVED9[11];
    union
    {
        __IO uint8_t EBCR;
        stc_msc_i2c_ebcr_field_t EBCR_f;
    };
}M0P_MSC_I2C_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_spi_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_spi_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_spi_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_spi_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_spi_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[14];
    union
    {
        __IO uint8_t CSTMG0;
        stc_msc_spi_cstmg0_field_t CSTMG0_f;
    };
    union
    {
        __IO uint8_t CSTMG1;
        stc_msc_spi_cstmg1_field_t CSTMG1_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t CSTMG32;
        stc_msc_spi_cstmg32_field_t CSTMG32_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t EACR;
        stc_msc_spi_eacr_field_t EACR_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t TMR;
        stc_msc_spi_tmr_field_t TMR_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t TMC;
        stc_msc_spi_tmc_field_t TMC_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t CSCR;
        stc_msc_spi_cscr_field_t CSCR_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint8_t CSFR0;
        stc_msc_spi_csfr0_field_t CSFR0_f;
    };
    union
    {
        __IO uint8_t CSFR1;
        stc_msc_spi_csfr1_field_t CSFR1_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint8_t CSFR2;
        stc_msc_spi_csfr2_field_t CSFR2_f;
    };
    uint8_t RESERVED17[3];
    __IO uint8_t TDTCNT0;
    __IO uint8_t TDTCNT1;
    uint8_t RESERVED19[2];
    __IO uint8_t TDTCNT2;
    __IO uint8_t TDTCNT3;
}M0P_MSC_SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_uart_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_uart_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_uart_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_uart_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_uart_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[66];
    union
    {
        __IO uint16_t COMP;
        stc_msc_uart_comp_field_t COMP_f;
    };
}M0P_MSC_UART_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t HICR_TRMKEY;
        stc_osc_hicr_trmkey_field_t HICR_TRMKEY_f;
    };
    union
    {
        __IO uint32_t HICR_FTRM;
        stc_osc_hicr_ftrm_field_t HICR_FTRM_f;
    };
    union
    {
        __IO uint32_t HICR_TTRM;
        stc_osc_hicr_ttrm_field_t HICR_TTRM_f;
    };
    union
    {
        __IO uint8_t HICR_FMC;
        stc_osc_hicr_fmc_field_t HICR_FMC_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t HICR_CSR;
        stc_osc_hicr_csr_field_t HICR_CSR_f;
    };
    uint8_t RESERVED5[15];
    union
    {
        __IO uint32_t HSXT_PWRCTL;
        stc_osc_hsxt_pwrctl_field_t HSXT_PWRCTL_f;
    };
    uint8_t RESERVED6[12];
    union
    {
        __IO uint32_t LSXT_PWRCTL;
        stc_osc_lsxt_pwrctl_field_t LSXT_PWRCTL_f;
    };
}M0P_OSC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CTL;
        stc_parity_ctl_field_t CTL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint32_t ADDR;
        stc_parity_addr_field_t ADDR_f;
    };
}M0P_PARITY_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CLKEN0;
        stc_pcg_clken0_field_t CLKEN0_f;
    };
    union
    {
        __IO uint32_t RSTCTL0;
        stc_pcg_rstctl0_field_t RSTCTL0_f;
    };
    uint8_t RESERVED2[8];
    union
    {
        __IO uint32_t CLKEN1;
        stc_pcg_clken1_field_t CLKEN1_f;
    };
    union
    {
        __IO uint32_t RSTCTL1;
        stc_pcg_rstctl1_field_t RSTCTL1_f;
    };
    uint8_t RESERVED4[8];
    union
    {
        __IO uint32_t CLKEN2;
        stc_pcg_clken2_field_t CLKEN2_f;
    };
    union
    {
        __IO uint32_t RSTCTL2;
        stc_pcg_rstctl2_field_t RSTCTL2_f;
    };
}M0P_PCG_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t RTCCTL1;
        stc_rtc_rtcctl1_field_t RTCCTL1_f;
    };
    union
    {
        __IO uint32_t RTCCTL2;
        stc_rtc_rtcctl2_field_t RTCCTL2_f;
    };
    union
    {
        __IO uint32_t CCS;
        stc_rtc_ccs_field_t CCS_f;
    };
    union
    {
        __IO uint8_t SEN;
        stc_rtc_sen_field_t SEN_f;
    };
    union
    {
        __IO uint8_t MIN;
        stc_rtc_min_field_t MIN_f;
    };
    union
    {
        __IO uint8_t HOUR;
        stc_rtc_hour_field_t HOUR_f;
    };
    union
    {
        __IO uint8_t DATE;
        stc_rtc_date_field_t DATE_f;
    };
    union
    {
        __IO uint8_t WEEK;
        stc_rtc_week_field_t WEEK_f;
    };
    union
    {
        __IO uint8_t MON;
        stc_rtc_mon_field_t MON_f;
    };
    union
    {
        __IO uint8_t YEAR;
        stc_rtc_year_field_t YEAR_f;
    };
    uint8_t RESERVED10[1];
    union
    {
        __IO uint8_t ASEN;
        stc_rtc_asen_field_t ASEN_f;
    };
    union
    {
        __IO uint8_t AMIN;
        stc_rtc_amin_field_t AMIN_f;
    };
    union
    {
        __IO uint8_t AHOUR;
        stc_rtc_ahour_field_t AHOUR_f;
    };
    union
    {
        __IO uint8_t ADATE;
        stc_rtc_adate_field_t ADATE_f;
    };
    uint8_t RESERVED14[1];
    union
    {
        __IO uint8_t AMON;
        stc_rtc_amon_field_t AMON_f;
    };
    union
    {
        __IO uint8_t AYEAR;
        stc_rtc_ayear_field_t AYEAR_f;
    };
    uint8_t RESERVED16[1];
    union
    {
        __IO uint32_t TVAL;
        stc_rtc_tval_field_t TVAL_f;
    };
    union
    {
        __IO uint8_t SCLKI;
        stc_rtc_sclki_field_t SCLKI_f;
    };
    union
    {
        __IO uint8_t SCLKS;
        stc_rtc_sclks_field_t SCLKS_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t CALVAL;
        stc_rtc_calval_field_t CALVAL_f;
    };
    union
    {
        __IO uint8_t CALEN;
        stc_rtc_calen_field_t CALEN_f;
    };
    uint8_t RESERVED21[1];
    union
    {
        __IO uint8_t CLKDIVX;
        stc_rtc_clkdivx_field_t CLKDIVX_f;
    };
    union
    {
        __IO uint8_t CLKDIVC;
        stc_rtc_clkdivc_field_t CLKDIVC_f;
    };
    uint8_t RESERVED23[2];
    union
    {
        __IO uint16_t CALCYC;
        stc_rtc_calcyc_field_t CALCYC_f;
    };
    uint8_t RESERVED24[2];
    union
    {
        __IO uint8_t RTCODIV;
        stc_rtc_rtcodiv_field_t RTCODIV_f;
    };
}M0P_RTC_TypeDef;

typedef struct
{
    uint8_t RESERVED0[252];
    union
    {
        __IO uint16_t CTSSSR;
        stc_sbssr_ctsssr_field_t CTSSSR_f;
    };
}M0P_SBSSR_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CON;
        stc_sci_con_field_t CON_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t MODE;
        stc_sci_mode_field_t MODE_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t STATUS;
        stc_sci_status_field_t STATUS_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FIFO_STATUS;
        stc_sci_fifo_status_field_t FIFO_STATUS_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FIFO_DEPTH;
        stc_sci_fifo_depth_field_t FIFO_DEPTH_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t DATA;
        stc_sci_data_field_t DATA_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint16_t EDC_DATA;
        stc_sci_edc_data_field_t EDC_DATA_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t SBDR;
        stc_sci_sbdr_field_t SBDR_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint16_t ETU_CNT;
        stc_sci_etu_cnt_field_t ETU_CNT_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint8_t F1_NUM;
        stc_sci_f1_num_field_t F1_NUM_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t CLK_RST;
        stc_sci_clk_rst_field_t CLK_RST_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t INT_EN;
        stc_sci_int_en_field_t INT_EN_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t WAKEUP_INT;
        stc_sci_wakeup_int_field_t WAKEUP_INT_f;
    };
}M0P_SCI_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_swwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint32_t WDT_INTCLR;
    union
    {
        __IO uint8_t WDT_STA;
        stc_swwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[7];
    union
    {
        __IO uint8_t WDT_MDC;
        stc_swwdt_wdt_mdc_field_t WDT_MDC_f;
    };
    uint8_t RESERVED6[3047];
    __IO uint32_t WDT_LCK;
}M0P_SWWDT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t UIDR0;
        stc_uid_uidr0_field_t UIDR0_f;
    };
    union
    {
        __IO uint32_t UIDR1;
        stc_uid_uidr1_field_t UIDR1_f;
    };
    union
    {
        __IO uint32_t UIDR2;
        stc_uid_uidr2_field_t UIDR2_f;
    };
}M0P_UID_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTL1;
        stc_vc_ctl1_field_t CTL1_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t CTL2;
        stc_vc_ctl2_field_t CTL2_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t CTL3;
        stc_vc_ctl3_field_t CTL3_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t LVD_CTRL1;
        stc_wsunit_lvd_ctrl1_field_t LVD_CTRL1_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t LVD_CTRL2;
        stc_wsunit_lvd_ctrl2_field_t LVD_CTRL2_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint16_t LVD_STR;
        stc_wsunit_lvd_str_field_t LVD_STR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint8_t LVD_CLR;
        stc_wsunit_lvd_clr_field_t LVD_CLR_f;
    };
    uint8_t RESERVED4[7];
    union
    {
        __IO uint8_t LVD2_CTL;
        stc_wsunit_lvd2_ctl_field_t LVD2_CTL_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint16_t LVD2_STR;
        stc_wsunit_lvd2_str_field_t LVD2_STR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint8_t LVD2_CLR;
        stc_wsunit_lvd2_clr_field_t LVD2_CLR_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint32_t LDO_CTL;
        stc_wsunit_ldo_ctl_field_t LDO_CTL_f;
    };
    uint8_t RESERVED8[12];
    union
    {
        __IO uint8_t BGR_CTL;
        stc_wsunit_bgr_ctl_field_t BGR_CTL_f;
    };
    uint8_t RESERVED9[207];
    union
    {
        __IO uint8_t CLK_CTL1;
        stc_wsunit_clk_ctl1_field_t CLK_CTL1_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t CLK_CTL2;
        stc_wsunit_clk_ctl2_field_t CLK_CTL2_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t MOSC_CTL;
        stc_wsunit_mosc_ctl_field_t MOSC_CTL_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t DS_RAMP;
        stc_wsunit_ds_ramp_field_t DS_RAMP_f;
    };
    uint8_t RESERVED13[243];
    union
    {
        __IO uint8_t WAKE_RSR;
        stc_wsunit_wake_rsr_field_t WAKE_RSR_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t WAKE_ISR;
        stc_wsunit_wake_isr_field_t WAKE_ISR_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t WAKE_IER;
        stc_wsunit_wake_ier_field_t WAKE_IER_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t WAKE_LVR;
        stc_wsunit_wake_lvr_field_t WAKE_LVR_f;
    };
    uint8_t RESERVED17[1267];
    __IO uint8_t BUR01;
    __IO uint8_t BUR02;
    __IO uint8_t BUR03;
    __IO uint8_t BUR04;
    __IO uint8_t BUR05;
    __IO uint8_t BUR06;
    __IO uint8_t BUR07;
    __IO uint8_t BUR08;
    __IO uint8_t BUR09;
    __IO uint8_t BUR10;
    __IO uint8_t BUR11;
    __IO uint8_t BUR12;
    __IO uint8_t BUR13;
    __IO uint8_t BUR14;
    __IO uint8_t BUR15;
    __IO uint8_t BUR16;
}M0P_WSUNIT_TypeDef;



