tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define M0P_PERIPH_BASE                        (0x40000000UL)
#define M0P_ADC_BASE                           (M0P_PERIPH_BASE + 0x00027000UL)
#define M0P_AES_BASE                           (M0P_PERIPH_BASE + 0x0006B000UL)
#define M0P_BUZZER_BASE                        (M0P_PERIPH_BASE + 0x0003C200UL)
#define M0P_CLOCK_BASE                         (M0P_PERIPH_BASE + 0x00010000UL)
#define M0P_CTIOSEL03_BASE                     (M0P_PERIPH_BASE + 0x00025100UL)
#define M0P_CTIOSEL47_BASE                     (M0P_PERIPH_BASE + 0x00025300UL)
#define M0P_CT0_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025000UL)
#define M0P_CT1_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025040UL)
#define M0P_CT2_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025080UL)
#define M0P_CT3_PPG_BASE                       (M0P_PERIPH_BASE + 0x000250C0UL)
#define M0P_CT4_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025200UL)
#define M0P_CT5_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025240UL)
#define M0P_CT6_PPG_BASE                       (M0P_PERIPH_BASE + 0x00025280UL)
#define M0P_CT7_PPG_BASE                       (M0P_PERIPH_BASE + 0x000252C0UL)
#define M0P_CT0_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025000UL)
#define M0P_CT1_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025040UL)
#define M0P_CT2_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025080UL)
#define M0P_CT3_PWC_BASE                       (M0P_PERIPH_BASE + 0x000250C0UL)
#define M0P_CT4_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025200UL)
#define M0P_CT5_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025240UL)
#define M0P_CT6_PWC_BASE                       (M0P_PERIPH_BASE + 0x00025280UL)
#define M0P_CT7_PWC_BASE                       (M0P_PERIPH_BASE + 0x000252C0UL)
#define M0P_CT0_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025000UL)
#define M0P_CT1_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025040UL)
#define M0P_CT2_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025080UL)
#define M0P_CT3_PWM_BASE                       (M0P_PERIPH_BASE + 0x000250C0UL)
#define M0P_CT4_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025200UL)
#define M0P_CT5_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025240UL)
#define M0P_CT6_PWM_BASE                       (M0P_PERIPH_BASE + 0x00025280UL)
#define M0P_CT7_PWM_BASE                       (M0P_PERIPH_BASE + 0x000252C0UL)
#define M0P_CT0_RT_BASE                        (M0P_PERIPH_BASE + 0x00025000UL)
#define M0P_CT1_RT_BASE                        (M0P_PERIPH_BASE + 0x00025040UL)
#define M0P_CT2_RT_BASE                        (M0P_PERIPH_BASE + 0x00025080UL)
#define M0P_CT3_RT_BASE                        (M0P_PERIPH_BASE + 0x000250C0UL)
#define M0P_CT4_RT_BASE                        (M0P_PERIPH_BASE + 0x00025200UL)
#define M0P_CT5_RT_BASE                        (M0P_PERIPH_BASE + 0x00025240UL)
#define M0P_CT6_RT_BASE                        (M0P_PERIPH_BASE + 0x00025280UL)
#define M0P_CT7_RT_BASE                        (M0P_PERIPH_BASE + 0x000252C0UL)
#define M0P_DTIM1_BASE                         (M0P_PERIPH_BASE + 0x00015000UL)
#define M0P_DTIM2_BASE                         (M0P_PERIPH_BASE + 0x00015020UL)
#define M0P_EXTINT_BASE                        (M0P_PERIPH_BASE + 0x00030000UL)
#define M0P_FLASH_BASE                         (M0P_PERIPH_BASE + 0x00000000UL)
#define M0P_GPIO_BASE                          (M0P_PERIPH_BASE + 0x00033000UL)
#define M0P_HWWDT_BASE                         (M0P_PERIPH_BASE + 0x00011000UL)
#define M0P_IRQC_BASE                          (M0P_PERIPH_BASE + 0x00031000UL)
#define M0P_LCDC_BASE                          (M0P_PERIPH_BASE + 0x00032000UL)
#define M0P_MSC0_I2C_BASE                      (M0P_PERIPH_BASE + 0x00038000UL)
#define M0P_MSC1_I2C_BASE                      (M0P_PERIPH_BASE + 0x00038100UL)
#define M0P_MSC2_I2C_BASE                      (M0P_PERIPH_BASE + 0x00038200UL)
#define M0P_MSC4_I2C_BASE                      (M0P_PERIPH_BASE + 0x00037000UL)
#define M0P_MSC5_I2C_BASE                      (M0P_PERIPH_BASE + 0x00037100UL)
#define M0P_MSC6_I2C_BASE                      (M0P_PERIPH_BASE + 0x00037200UL)
#define M0P_MSC0_SPI_BASE                      (M0P_PERIPH_BASE + 0x00038000UL)
#define M0P_MSC1_SPI_BASE                      (M0P_PERIPH_BASE + 0x00038100UL)
#define M0P_MSC2_SPI_BASE                      (M0P_PERIPH_BASE + 0x00038200UL)
#define M0P_MSC4_SPI_BASE                      (M0P_PERIPH_BASE + 0x00037000UL)
#define M0P_MSC5_SPI_BASE                      (M0P_PERIPH_BASE + 0x00037100UL)
#define M0P_MSC6_SPI_BASE                      (M0P_PERIPH_BASE + 0x00037200UL)
#define M0P_MSC0_UART_BASE                     (M0P_PERIPH_BASE + 0x00038000UL)
#define M0P_MSC1_UART_BASE                     (M0P_PERIPH_BASE + 0x00038100UL)
#define M0P_MSC2_UART_BASE                     (M0P_PERIPH_BASE + 0x00038200UL)
#define M0P_MSC4_UART_BASE                     (M0P_PERIPH_BASE + 0x00037000UL)
#define M0P_MSC5_UART_BASE                     (M0P_PERIPH_BASE + 0x00037100UL)
#define M0P_MSC6_UART_BASE                     (M0P_PERIPH_BASE + 0x00037200UL)
#define M0P_OSC_BASE                           (M0P_PERIPH_BASE + 0x0002E000UL)
#define M0P_PARITY_BASE                        (M0P_PERIPH_BASE + 0x0003C000UL)
#define M0P_PCG_BASE                           (M0P_PERIPH_BASE + 0x0003C100UL)
#define M0P_RTC_BASE                           (M0P_PERIPH_BASE + 0x0003B000UL)
#define M0P_SBSSR_BASE                         (M0P_PERIPH_BASE + 0x00025F00UL)
#define M0P_SCI_BASE                           (M0P_PERIPH_BASE + 0x0003C800UL)
#define M0P_SWWDT_BASE                         (M0P_PERIPH_BASE + 0x00012000UL)
#define M0P_UID_BASE                           (M0P_PERIPH_BASE + 0x00000100UL)
#define M0P_VC_BASE                            (M0P_PERIPH_BASE + 0x0003C300UL)
#define M0P_WSUNIT_BASE                        (M0P_PERIPH_BASE + 0x00035000UL)


#define M0P_ADC                                ((M0P_ADC_TypeDef *)0x40027000UL)
#define M0P_AES                                ((M0P_AES_TypeDef *)0x4006B000UL)
#define M0P_BUZZER                             ((M0P_BUZZER_TypeDef *)0x4003C200UL)
#define M0P_CLOCK                              ((M0P_CLOCK_TypeDef *)0x40010000UL)
#define M0P_CTIOSEL03                          ((M0P_CTIOSEL03_TypeDef *)0x40025100UL)
#define M0P_CTIOSEL47                          ((M0P_CTIOSEL47_TypeDef *)0x40025300UL)
#define M0P_CT0_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025000UL)
#define M0P_CT1_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025040UL)
#define M0P_CT2_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025080UL)
#define M0P_CT3_PPG                            ((M0P_CT_PPG_TypeDef *)0x400250C0UL)
#define M0P_CT4_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025200UL)
#define M0P_CT5_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025240UL)
#define M0P_CT6_PPG                            ((M0P_CT_PPG_TypeDef *)0x40025280UL)
#define M0P_CT7_PPG                            ((M0P_CT_PPG_TypeDef *)0x400252C0UL)
#define M0P_CT0_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025000UL)
#define M0P_CT1_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025040UL)
#define M0P_CT2_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025080UL)
#define M0P_CT3_PWC                            ((M0P_CT_PWC_TypeDef *)0x400250C0UL)
#define M0P_CT4_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025200UL)
#define M0P_CT5_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025240UL)
#define M0P_CT6_PWC                            ((M0P_CT_PWC_TypeDef *)0x40025280UL)
#define M0P_CT7_PWC                            ((M0P_CT_PWC_TypeDef *)0x400252C0UL)
#define M0P_CT0_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025000UL)
#define M0P_CT1_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025040UL)
#define M0P_CT2_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025080UL)
#define M0P_CT3_PWM                            ((M0P_CT_PWM_TypeDef *)0x400250C0UL)
#define M0P_CT4_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025200UL)
#define M0P_CT5_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025240UL)
#define M0P_CT6_PWM                            ((M0P_CT_PWM_TypeDef *)0x40025280UL)
#define M0P_CT7_PWM                            ((M0P_CT_PWM_TypeDef *)0x400252C0UL)
#define M0P_CT0_RT                             ((M0P_CT_RT_TypeDef *)0x40025000UL)
#define M0P_CT1_RT                             ((M0P_CT_RT_TypeDef *)0x40025040UL)
#define M0P_CT2_RT                             ((M0P_CT_RT_TypeDef *)0x40025080UL)
#define M0P_CT3_RT                             ((M0P_CT_RT_TypeDef *)0x400250C0UL)
#define M0P_CT4_RT                             ((M0P_CT_RT_TypeDef *)0x40025200UL)
#define M0P_CT5_RT                             ((M0P_CT_RT_TypeDef *)0x40025240UL)
#define M0P_CT6_RT                             ((M0P_CT_RT_TypeDef *)0x40025280UL)
#define M0P_CT7_RT                             ((M0P_CT_RT_TypeDef *)0x400252C0UL)
#define M0P_DTIM1                              ((M0P_DTIM_TypeDef *)0x40015000UL)
#define M0P_DTIM2                              ((M0P_DTIM_TypeDef *)0x40015020UL)
#define M0P_EXTINT                             ((M0P_EXTINT_TypeDef *)0x40030000UL)
#define M0P_FASTIO                             ((M0P_FASTIO_TypeDef *)0xF8000000UL)
#define M0P_FLASH                              ((M0P_FLASH_TypeDef *)0x40000000UL)
#define M0P_GPIO                               ((M0P_GPIO_TypeDef *)0x40033000UL)
#define M0P_HWWDT                              ((M0P_HWWDT_TypeDef *)0x40011000UL)
#define M0P_IRQC                               ((M0P_IRQC_TypeDef *)0x40031000UL)
#define M0P_LCDC                               ((M0P_LCDC_TypeDef *)0x40032000UL)
#define M0P_MSC0_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40038000UL)
#define M0P_MSC1_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40038100UL)
#define M0P_MSC2_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40038200UL)
#define M0P_MSC4_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40037000UL)
#define M0P_MSC5_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40037100UL)
#define M0P_MSC6_I2C                           ((M0P_MSC_I2C_TypeDef *)0x40037200UL)
#define M0P_MSC0_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40038000UL)
#define M0P_MSC1_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40038100UL)
#define M0P_MSC2_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40038200UL)
#define M0P_MSC4_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40037000UL)
#define M0P_MSC5_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40037100UL)
#define M0P_MSC6_SPI                           ((M0P_MSC_SPI_TypeDef *)0x40037200UL)
#define M0P_MSC0_UART                          ((M0P_MSC_UART_TypeDef *)0x40038000UL)
#define M0P_MSC1_UART                          ((M0P_MSC_UART_TypeDef *)0x40038100UL)
#define M0P_MSC2_UART                          ((M0P_MSC_UART_TypeDef *)0x40038200UL)
#define M0P_MSC4_UART                          ((M0P_MSC_UART_TypeDef *)0x40037000UL)
#define M0P_MSC5_UART                          ((M0P_MSC_UART_TypeDef *)0x40037100UL)
#define M0P_MSC6_UART                          ((M0P_MSC_UART_TypeDef *)0x40037200UL)
#define M0P_OSC                                ((M0P_OSC_TypeDef *)0x4002E000UL)
#define M0P_PARITY                             ((M0P_PARITY_TypeDef *)0x4003C000UL)
#define M0P_PCG                                ((M0P_PCG_TypeDef *)0x4003C100UL)
#define M0P_RTC                                ((M0P_RTC_TypeDef *)0x4003B000UL)
#define M0P_SBSSR                              ((M0P_SBSSR_TypeDef *)0x40025F00UL)
#define M0P_SCI                                ((M0P_SCI_TypeDef *)0x4003C800UL)
#define M0P_SWWDT                              ((M0P_SWWDT_TypeDef *)0x40012000UL)
#define M0P_UID                                ((M0P_UID_TypeDef *)0x40000100UL)
#define M0P_VC                                 ((M0P_VC_TypeDef *)0x4003C300UL)
#define M0P_WSUNIT                             ((M0P_WSUNIT_TypeDef *)0x40035000UL)


