tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_ADC_CTL1_ADC_EN                            *((volatile unsigned int*)(0x424E0000UL))
#define bM0P_ADC_CTL1_ADC_CLK_SEL0                      *((volatile unsigned int*)(0x424E0004UL))
#define bM0P_ADC_CTL1_ADC_CLK_SEL1                      *((volatile unsigned int*)(0x424E0008UL))
#define bM0P_ADC_CTL1_ADC_VREF                          *((volatile unsigned int*)(0x424E0018UL))
#define bM0P_ADC_CTL1_ADC_CHL_SEL0                      *((volatile unsigned int*)(0x424E0020UL))
#define bM0P_ADC_CTL1_ADC_CHL_SEL1                      *((volatile unsigned int*)(0x424E0024UL))
#define bM0P_ADC_CTL1_ADC_CHL_SEL2                      *((volatile unsigned int*)(0x424E0028UL))
#define bM0P_ADC_CTL1_ADC_CHL_SEL3                      *((volatile unsigned int*)(0x424E002CUL))
#define bM0P_ADC_CTL1_ADCIE                             *((volatile unsigned int*)(0x424E0040UL))
#define bM0P_ADC_CTL1_ADCIF                             *((volatile unsigned int*)(0x424E0044UL))
#define bM0P_ADC_CTL2_ADC_START                         *((volatile unsigned int*)(0x424E0080UL))
#define bM0P_ADC_CTL2_ADC_ALIGN                         *((volatile unsigned int*)(0x424E0088UL))
#define bM0P_ADC_CTL2_ADC_MODE                          *((volatile unsigned int*)(0x424E008CUL))
#define bM0P_ADC_CTL2_VINBUF_EN                         *((volatile unsigned int*)(0x424E0094UL))
#define bM0P_ADC_CTL2_ADC_SAMPLE_SEL0                   *((volatile unsigned int*)(0x424E0098UL))
#define bM0P_ADC_CTL2_ADC_SAMPLE_SEL1                   *((volatile unsigned int*)(0x424E009CUL))
#define bM0P_ADC_RESULT_RESULT0                         *((volatile unsigned int*)(0x424E0180UL))
#define bM0P_ADC_RESULT_RESULT1                         *((volatile unsigned int*)(0x424E0184UL))
#define bM0P_ADC_RESULT_RESULT2                         *((volatile unsigned int*)(0x424E0188UL))
#define bM0P_ADC_RESULT_RESULT3                         *((volatile unsigned int*)(0x424E018CUL))
#define bM0P_ADC_RESULT_RESULT4                         *((volatile unsigned int*)(0x424E0190UL))
#define bM0P_ADC_RESULT_RESULT5                         *((volatile unsigned int*)(0x424E0194UL))
#define bM0P_ADC_RESULT_RESULT6                         *((volatile unsigned int*)(0x424E0198UL))
#define bM0P_ADC_RESULT_RESULT7                         *((volatile unsigned int*)(0x424E019CUL))
#define bM0P_ADC_RESULT_RESULT8                         *((volatile unsigned int*)(0x424E01A0UL))
#define bM0P_ADC_RESULT_RESULT9                         *((volatile unsigned int*)(0x424E01A4UL))
#define bM0P_ADC_RESULT_RESULT10                        *((volatile unsigned int*)(0x424E01A8UL))
#define bM0P_ADC_RESULT_RESULT11                        *((volatile unsigned int*)(0x424E01ACUL))
#define bM0P_ADC_RESULT_RESULT12                        *((volatile unsigned int*)(0x424E01B0UL))
#define bM0P_ADC_RESULT_RESULT13                        *((volatile unsigned int*)(0x424E01B4UL))
#define bM0P_ADC_RESULT_RESULT14                        *((volatile unsigned int*)(0x424E01B8UL))
#define bM0P_ADC_RESULT_RESULT15                        *((volatile unsigned int*)(0x424E01BCUL))
#define bM0P_ADC_ADCMPIF_CMPIF                          *((volatile unsigned int*)(0x424E0200UL))
#define bM0P_ADC_ADCMPF_CMPF                            *((volatile unsigned int*)(0x424E0280UL))
#define bM0P_ADC_ADCMPCTL_CMPEN                         *((volatile unsigned int*)(0x424E0308UL))
#define bM0P_ADC_ADCMPCTL_CMPIE                         *((volatile unsigned int*)(0x424E030CUL))
#define bM0P_ADC_ADCMPCTL_CMPTRIG                       *((volatile unsigned int*)(0x424E0310UL))
#define bM0P_ADC_ADCMPCTL_CMPCNT0                       *((volatile unsigned int*)(0x424E0314UL))
#define bM0P_ADC_ADCMPCTL_CMPCNT1                       *((volatile unsigned int*)(0x424E0318UL))
#define bM0P_ADC_ADCMPCTL_CMPCNT2                       *((volatile unsigned int*)(0x424E031CUL))
#define bM0P_ADC_ADCMPCTL_CMPCNT_ST0                    *((volatile unsigned int*)(0x424E0334UL))
#define bM0P_ADC_ADCMPCTL_CMPCNT_ST1                    *((volatile unsigned int*)(0x424E0338UL))
#define bM0P_ADC_ADCMPCTL_CMPCNT_ST2                    *((volatile unsigned int*)(0x424E033CUL))
#define bM0P_ADC_ADCMPL_CDL0                            *((volatile unsigned int*)(0x424E0398UL))
#define bM0P_ADC_ADCMPL_CDL1                            *((volatile unsigned int*)(0x424E039CUL))
#define bM0P_ADC_ADCMPL_CDL2                            *((volatile unsigned int*)(0x424E03A0UL))
#define bM0P_ADC_ADCMPL_CDL3                            *((volatile unsigned int*)(0x424E03A4UL))
#define bM0P_ADC_ADCMPL_CDL4                            *((volatile unsigned int*)(0x424E03A8UL))
#define bM0P_ADC_ADCMPL_CDL5                            *((volatile unsigned int*)(0x424E03ACUL))
#define bM0P_ADC_ADCMPL_CDL6                            *((volatile unsigned int*)(0x424E03B0UL))
#define bM0P_ADC_ADCMPL_CDL7                            *((volatile unsigned int*)(0x424E03B4UL))
#define bM0P_ADC_ADCMPL_CDL8                            *((volatile unsigned int*)(0x424E03B8UL))
#define bM0P_ADC_ADCMPL_CDL9                            *((volatile unsigned int*)(0x424E03BCUL))
#define bM0P_ADC_ADCMPH_CDH0                            *((volatile unsigned int*)(0x424E03D8UL))
#define bM0P_ADC_ADCMPH_CDH1                            *((volatile unsigned int*)(0x424E03DCUL))
#define bM0P_ADC_ADCMPH_CDH2                            *((volatile unsigned int*)(0x424E03E0UL))
#define bM0P_ADC_ADCMPH_CDH3                            *((volatile unsigned int*)(0x424E03E4UL))
#define bM0P_ADC_ADCMPH_CDH4                            *((volatile unsigned int*)(0x424E03E8UL))
#define bM0P_ADC_ADCMPH_CDH5                            *((volatile unsigned int*)(0x424E03ECUL))
#define bM0P_ADC_ADCMPH_CDH6                            *((volatile unsigned int*)(0x424E03F0UL))
#define bM0P_ADC_ADCMPH_CDH7                            *((volatile unsigned int*)(0x424E03F4UL))
#define bM0P_ADC_ADCMPH_CDH8                            *((volatile unsigned int*)(0x424E03F8UL))
#define bM0P_ADC_ADCMPH_CDH9                            *((volatile unsigned int*)(0x424E03FCUL))
#define bM0P_AES_CON_START                              *((volatile unsigned int*)(0x42D60000UL))
#define bM0P_AES_CON_FUNC_SEL0                          *((volatile unsigned int*)(0x42D60004UL))
#define bM0P_AES_CON_FUNC_SEL1                          *((volatile unsigned int*)(0x42D60008UL))
#define bM0P_AES_CON_KEY_SEL0                           *((volatile unsigned int*)(0x42D6000CUL))
#define bM0P_AES_CON_KEY_SEL1                           *((volatile unsigned int*)(0x42D60010UL))
#define bM0P_AES_CON_STEP_EN                            *((volatile unsigned int*)(0x42D60014UL))
#define bM0P_AES_CON_DFA_EN                             *((volatile unsigned int*)(0x42D6001CUL))
#define bM0P_AES_CON_DFA_STA                            *((volatile unsigned int*)(0x42D60020UL))
#define bM0P_AES_CON_RAND_TEN                           *((volatile unsigned int*)(0x42D60024UL))
#define bM0P_AES_CON_DUMMY_EN                           *((volatile unsigned int*)(0x42D60028UL))
#define bM0P_AES_CON_DUMMY_SEL0                         *((volatile unsigned int*)(0x42D6002CUL))
#define bM0P_AES_CON_DUMMY_SEL1                         *((volatile unsigned int*)(0x42D60030UL))
#define bM0P_AES_DATA0_DATA00                           *((volatile unsigned int*)(0x42D60200UL))
#define bM0P_AES_DATA0_DATA01                           *((volatile unsigned int*)(0x42D60204UL))
#define bM0P_AES_DATA0_DATA02                           *((volatile unsigned int*)(0x42D60208UL))
#define bM0P_AES_DATA0_DATA03                           *((volatile unsigned int*)(0x42D6020CUL))
#define bM0P_AES_DATA0_DATA04                           *((volatile unsigned int*)(0x42D60210UL))
#define bM0P_AES_DATA0_DATA05                           *((volatile unsigned int*)(0x42D60214UL))
#define bM0P_AES_DATA0_DATA06                           *((volatile unsigned int*)(0x42D60218UL))
#define bM0P_AES_DATA0_DATA07                           *((volatile unsigned int*)(0x42D6021CUL))
#define bM0P_AES_DATA0_DATA08                           *((volatile unsigned int*)(0x42D60220UL))
#define bM0P_AES_DATA0_DATA09                           *((volatile unsigned int*)(0x42D60224UL))
#define bM0P_AES_DATA0_DATA010                          *((volatile unsigned int*)(0x42D60228UL))
#define bM0P_AES_DATA0_DATA011                          *((volatile unsigned int*)(0x42D6022CUL))
#define bM0P_AES_DATA0_DATA012                          *((volatile unsigned int*)(0x42D60230UL))
#define bM0P_AES_DATA0_DATA013                          *((volatile unsigned int*)(0x42D60234UL))
#define bM0P_AES_DATA0_DATA014                          *((volatile unsigned int*)(0x42D60238UL))
#define bM0P_AES_DATA0_DATA015                          *((volatile unsigned int*)(0x42D6023CUL))
#define bM0P_AES_DATA0_DATA016                          *((volatile unsigned int*)(0x42D60240UL))
#define bM0P_AES_DATA0_DATA017                          *((volatile unsigned int*)(0x42D60244UL))
#define bM0P_AES_DATA0_DATA018                          *((volatile unsigned int*)(0x42D60248UL))
#define bM0P_AES_DATA0_DATA019                          *((volatile unsigned int*)(0x42D6024CUL))
#define bM0P_AES_DATA0_DATA020                          *((volatile unsigned int*)(0x42D60250UL))
#define bM0P_AES_DATA0_DATA021                          *((volatile unsigned int*)(0x42D60254UL))
#define bM0P_AES_DATA0_DATA022                          *((volatile unsigned int*)(0x42D60258UL))
#define bM0P_AES_DATA0_DATA023                          *((volatile unsigned int*)(0x42D6025CUL))
#define bM0P_AES_DATA0_DATA024                          *((volatile unsigned int*)(0x42D60260UL))
#define bM0P_AES_DATA0_DATA025                          *((volatile unsigned int*)(0x42D60264UL))
#define bM0P_AES_DATA0_DATA026                          *((volatile unsigned int*)(0x42D60268UL))
#define bM0P_AES_DATA0_DATA027                          *((volatile unsigned int*)(0x42D6026CUL))
#define bM0P_AES_DATA0_DATA028                          *((volatile unsigned int*)(0x42D60270UL))
#define bM0P_AES_DATA0_DATA029                          *((volatile unsigned int*)(0x42D60274UL))
#define bM0P_AES_DATA0_DATA030                          *((volatile unsigned int*)(0x42D60278UL))
#define bM0P_AES_DATA0_DATA031                          *((volatile unsigned int*)(0x42D6027CUL))
#define bM0P_AES_DATA1_DATA10                           *((volatile unsigned int*)(0x42D60280UL))
#define bM0P_AES_DATA1_DATA11                           *((volatile unsigned int*)(0x42D60284UL))
#define bM0P_AES_DATA1_DATA12                           *((volatile unsigned int*)(0x42D60288UL))
#define bM0P_AES_DATA1_DATA13                           *((volatile unsigned int*)(0x42D6028CUL))
#define bM0P_AES_DATA1_DATA14                           *((volatile unsigned int*)(0x42D60290UL))
#define bM0P_AES_DATA1_DATA15                           *((volatile unsigned int*)(0x42D60294UL))
#define bM0P_AES_DATA1_DATA16                           *((volatile unsigned int*)(0x42D60298UL))
#define bM0P_AES_DATA1_DATA17                           *((volatile unsigned int*)(0x42D6029CUL))
#define bM0P_AES_DATA1_DATA18                           *((volatile unsigned int*)(0x42D602A0UL))
#define bM0P_AES_DATA1_DATA19                           *((volatile unsigned int*)(0x42D602A4UL))
#define bM0P_AES_DATA1_DATA110                          *((volatile unsigned int*)(0x42D602A8UL))
#define bM0P_AES_DATA1_DATA111                          *((volatile unsigned int*)(0x42D602ACUL))
#define bM0P_AES_DATA1_DATA112                          *((volatile unsigned int*)(0x42D602B0UL))
#define bM0P_AES_DATA1_DATA113                          *((volatile unsigned int*)(0x42D602B4UL))
#define bM0P_AES_DATA1_DATA114                          *((volatile unsigned int*)(0x42D602B8UL))
#define bM0P_AES_DATA1_DATA115                          *((volatile unsigned int*)(0x42D602BCUL))
#define bM0P_AES_DATA1_DATA116                          *((volatile unsigned int*)(0x42D602C0UL))
#define bM0P_AES_DATA1_DATA117                          *((volatile unsigned int*)(0x42D602C4UL))
#define bM0P_AES_DATA1_DATA118                          *((volatile unsigned int*)(0x42D602C8UL))
#define bM0P_AES_DATA1_DATA119                          *((volatile unsigned int*)(0x42D602CCUL))
#define bM0P_AES_DATA1_DATA120                          *((volatile unsigned int*)(0x42D602D0UL))
#define bM0P_AES_DATA1_DATA121                          *((volatile unsigned int*)(0x42D602D4UL))
#define bM0P_AES_DATA1_DATA122                          *((volatile unsigned int*)(0x42D602D8UL))
#define bM0P_AES_DATA1_DATA123                          *((volatile unsigned int*)(0x42D602DCUL))
#define bM0P_AES_DATA1_DATA124                          *((volatile unsigned int*)(0x42D602E0UL))
#define bM0P_AES_DATA1_DATA125                          *((volatile unsigned int*)(0x42D602E4UL))
#define bM0P_AES_DATA1_DATA126                          *((volatile unsigned int*)(0x42D602E8UL))
#define bM0P_AES_DATA1_DATA127                          *((volatile unsigned int*)(0x42D602ECUL))
#define bM0P_AES_DATA1_DATA128                          *((volatile unsigned int*)(0x42D602F0UL))
#define bM0P_AES_DATA1_DATA129                          *((volatile unsigned int*)(0x42D602F4UL))
#define bM0P_AES_DATA1_DATA130                          *((volatile unsigned int*)(0x42D602F8UL))
#define bM0P_AES_DATA1_DATA131                          *((volatile unsigned int*)(0x42D602FCUL))
#define bM0P_AES_DATA2_DATA20                           *((volatile unsigned int*)(0x42D60300UL))
#define bM0P_AES_DATA2_DATA21                           *((volatile unsigned int*)(0x42D60304UL))
#define bM0P_AES_DATA2_DATA22                           *((volatile unsigned int*)(0x42D60308UL))
#define bM0P_AES_DATA2_DATA23                           *((volatile unsigned int*)(0x42D6030CUL))
#define bM0P_AES_DATA2_DATA24                           *((volatile unsigned int*)(0x42D60310UL))
#define bM0P_AES_DATA2_DATA25                           *((volatile unsigned int*)(0x42D60314UL))
#define bM0P_AES_DATA2_DATA26                           *((volatile unsigned int*)(0x42D60318UL))
#define bM0P_AES_DATA2_DATA27                           *((volatile unsigned int*)(0x42D6031CUL))
#define bM0P_AES_DATA2_DATA28                           *((volatile unsigned int*)(0x42D60320UL))
#define bM0P_AES_DATA2_DATA29                           *((volatile unsigned int*)(0x42D60324UL))
#define bM0P_AES_DATA2_DATA210                          *((volatile unsigned int*)(0x42D60328UL))
#define bM0P_AES_DATA2_DATA211                          *((volatile unsigned int*)(0x42D6032CUL))
#define bM0P_AES_DATA2_DATA212                          *((volatile unsigned int*)(0x42D60330UL))
#define bM0P_AES_DATA2_DATA213                          *((volatile unsigned int*)(0x42D60334UL))
#define bM0P_AES_DATA2_DATA214                          *((volatile unsigned int*)(0x42D60338UL))
#define bM0P_AES_DATA2_DATA215                          *((volatile unsigned int*)(0x42D6033CUL))
#define bM0P_AES_DATA2_DATA216                          *((volatile unsigned int*)(0x42D60340UL))
#define bM0P_AES_DATA2_DATA217                          *((volatile unsigned int*)(0x42D60344UL))
#define bM0P_AES_DATA2_DATA218                          *((volatile unsigned int*)(0x42D60348UL))
#define bM0P_AES_DATA2_DATA219                          *((volatile unsigned int*)(0x42D6034CUL))
#define bM0P_AES_DATA2_DATA220                          *((volatile unsigned int*)(0x42D60350UL))
#define bM0P_AES_DATA2_DATA221                          *((volatile unsigned int*)(0x42D60354UL))
#define bM0P_AES_DATA2_DATA222                          *((volatile unsigned int*)(0x42D60358UL))
#define bM0P_AES_DATA2_DATA223                          *((volatile unsigned int*)(0x42D6035CUL))
#define bM0P_AES_DATA2_DATA224                          *((volatile unsigned int*)(0x42D60360UL))
#define bM0P_AES_DATA2_DATA225                          *((volatile unsigned int*)(0x42D60364UL))
#define bM0P_AES_DATA2_DATA226                          *((volatile unsigned int*)(0x42D60368UL))
#define bM0P_AES_DATA2_DATA227                          *((volatile unsigned int*)(0x42D6036CUL))
#define bM0P_AES_DATA2_DATA228                          *((volatile unsigned int*)(0x42D60370UL))
#define bM0P_AES_DATA2_DATA229                          *((volatile unsigned int*)(0x42D60374UL))
#define bM0P_AES_DATA2_DATA230                          *((volatile unsigned int*)(0x42D60378UL))
#define bM0P_AES_DATA2_DATA231                          *((volatile unsigned int*)(0x42D6037CUL))
#define bM0P_AES_DATA3_DATA30                           *((volatile unsigned int*)(0x42D60380UL))
#define bM0P_AES_DATA3_DATA31                           *((volatile unsigned int*)(0x42D60384UL))
#define bM0P_AES_DATA3_DATA32                           *((volatile unsigned int*)(0x42D60388UL))
#define bM0P_AES_DATA3_DATA33                           *((volatile unsigned int*)(0x42D6038CUL))
#define bM0P_AES_DATA3_DATA34                           *((volatile unsigned int*)(0x42D60390UL))
#define bM0P_AES_DATA3_DATA35                           *((volatile unsigned int*)(0x42D60394UL))
#define bM0P_AES_DATA3_DATA36                           *((volatile unsigned int*)(0x42D60398UL))
#define bM0P_AES_DATA3_DATA37                           *((volatile unsigned int*)(0x42D6039CUL))
#define bM0P_AES_DATA3_DATA38                           *((volatile unsigned int*)(0x42D603A0UL))
#define bM0P_AES_DATA3_DATA39                           *((volatile unsigned int*)(0x42D603A4UL))
#define bM0P_AES_DATA3_DATA310                          *((volatile unsigned int*)(0x42D603A8UL))
#define bM0P_AES_DATA3_DATA311                          *((volatile unsigned int*)(0x42D603ACUL))
#define bM0P_AES_DATA3_DATA312                          *((volatile unsigned int*)(0x42D603B0UL))
#define bM0P_AES_DATA3_DATA313                          *((volatile unsigned int*)(0x42D603B4UL))
#define bM0P_AES_DATA3_DATA314                          *((volatile unsigned int*)(0x42D603B8UL))
#define bM0P_AES_DATA3_DATA315                          *((volatile unsigned int*)(0x42D603BCUL))
#define bM0P_AES_DATA3_DATA316                          *((volatile unsigned int*)(0x42D603C0UL))
#define bM0P_AES_DATA3_DATA317                          *((volatile unsigned int*)(0x42D603C4UL))
#define bM0P_AES_DATA3_DATA318                          *((volatile unsigned int*)(0x42D603C8UL))
#define bM0P_AES_DATA3_DATA319                          *((volatile unsigned int*)(0x42D603CCUL))
#define bM0P_AES_DATA3_DATA320                          *((volatile unsigned int*)(0x42D603D0UL))
#define bM0P_AES_DATA3_DATA321                          *((volatile unsigned int*)(0x42D603D4UL))
#define bM0P_AES_DATA3_DATA322                          *((volatile unsigned int*)(0x42D603D8UL))
#define bM0P_AES_DATA3_DATA323                          *((volatile unsigned int*)(0x42D603DCUL))
#define bM0P_AES_DATA3_DATA324                          *((volatile unsigned int*)(0x42D603E0UL))
#define bM0P_AES_DATA3_DATA325                          *((volatile unsigned int*)(0x42D603E4UL))
#define bM0P_AES_DATA3_DATA326                          *((volatile unsigned int*)(0x42D603E8UL))
#define bM0P_AES_DATA3_DATA327                          *((volatile unsigned int*)(0x42D603ECUL))
#define bM0P_AES_DATA3_DATA328                          *((volatile unsigned int*)(0x42D603F0UL))
#define bM0P_AES_DATA3_DATA329                          *((volatile unsigned int*)(0x42D603F4UL))
#define bM0P_AES_DATA3_DATA330                          *((volatile unsigned int*)(0x42D603F8UL))
#define bM0P_AES_DATA3_DATA331                          *((volatile unsigned int*)(0x42D603FCUL))
#define bM0P_AES_KEY0_KEY00                             *((volatile unsigned int*)(0x42D60400UL))
#define bM0P_AES_KEY0_KEY01                             *((volatile unsigned int*)(0x42D60404UL))
#define bM0P_AES_KEY0_KEY02                             *((volatile unsigned int*)(0x42D60408UL))
#define bM0P_AES_KEY0_KEY03                             *((volatile unsigned int*)(0x42D6040CUL))
#define bM0P_AES_KEY0_KEY04                             *((volatile unsigned int*)(0x42D60410UL))
#define bM0P_AES_KEY0_KEY05                             *((volatile unsigned int*)(0x42D60414UL))
#define bM0P_AES_KEY0_KEY06                             *((volatile unsigned int*)(0x42D60418UL))
#define bM0P_AES_KEY0_KEY07                             *((volatile unsigned int*)(0x42D6041CUL))
#define bM0P_AES_KEY0_KEY08                             *((volatile unsigned int*)(0x42D60420UL))
#define bM0P_AES_KEY0_KEY09                             *((volatile unsigned int*)(0x42D60424UL))
#define bM0P_AES_KEY0_KEY010                            *((volatile unsigned int*)(0x42D60428UL))
#define bM0P_AES_KEY0_KEY011                            *((volatile unsigned int*)(0x42D6042CUL))
#define bM0P_AES_KEY0_KEY012                            *((volatile unsigned int*)(0x42D60430UL))
#define bM0P_AES_KEY0_KEY013                            *((volatile unsigned int*)(0x42D60434UL))
#define bM0P_AES_KEY0_KEY014                            *((volatile unsigned int*)(0x42D60438UL))
#define bM0P_AES_KEY0_KEY015                            *((volatile unsigned int*)(0x42D6043CUL))
#define bM0P_AES_KEY0_KEY016                            *((volatile unsigned int*)(0x42D60440UL))
#define bM0P_AES_KEY0_KEY017                            *((volatile unsigned int*)(0x42D60444UL))
#define bM0P_AES_KEY0_KEY018                            *((volatile unsigned int*)(0x42D60448UL))
#define bM0P_AES_KEY0_KEY019                            *((volatile unsigned int*)(0x42D6044CUL))
#define bM0P_AES_KEY0_KEY020                            *((volatile unsigned int*)(0x42D60450UL))
#define bM0P_AES_KEY0_KEY021                            *((volatile unsigned int*)(0x42D60454UL))
#define bM0P_AES_KEY0_KEY022                            *((volatile unsigned int*)(0x42D60458UL))
#define bM0P_AES_KEY0_KEY023                            *((volatile unsigned int*)(0x42D6045CUL))
#define bM0P_AES_KEY0_KEY024                            *((volatile unsigned int*)(0x42D60460UL))
#define bM0P_AES_KEY0_KEY025                            *((volatile unsigned int*)(0x42D60464UL))
#define bM0P_AES_KEY0_KEY026                            *((volatile unsigned int*)(0x42D60468UL))
#define bM0P_AES_KEY0_KEY027                            *((volatile unsigned int*)(0x42D6046CUL))
#define bM0P_AES_KEY0_KEY028                            *((volatile unsigned int*)(0x42D60470UL))
#define bM0P_AES_KEY0_KEY029                            *((volatile unsigned int*)(0x42D60474UL))
#define bM0P_AES_KEY0_KEY030                            *((volatile unsigned int*)(0x42D60478UL))
#define bM0P_AES_KEY0_KEY031                            *((volatile unsigned int*)(0x42D6047CUL))
#define bM0P_AES_KEY1_KEY10                             *((volatile unsigned int*)(0x42D60480UL))
#define bM0P_AES_KEY1_KEY11                             *((volatile unsigned int*)(0x42D60484UL))
#define bM0P_AES_KEY1_KEY12                             *((volatile unsigned int*)(0x42D60488UL))
#define bM0P_AES_KEY1_KEY13                             *((volatile unsigned int*)(0x42D6048CUL))
#define bM0P_AES_KEY1_KEY14                             *((volatile unsigned int*)(0x42D60490UL))
#define bM0P_AES_KEY1_KEY15                             *((volatile unsigned int*)(0x42D60494UL))
#define bM0P_AES_KEY1_KEY16                             *((volatile unsigned int*)(0x42D60498UL))
#define bM0P_AES_KEY1_KEY17                             *((volatile unsigned int*)(0x42D6049CUL))
#define bM0P_AES_KEY1_KEY18                             *((volatile unsigned int*)(0x42D604A0UL))
