tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_AES_KEY1_KEY19                             *((volatile unsigned int*)(0x42D604A4UL))
#define bM0P_AES_KEY1_KEY110                            *((volatile unsigned int*)(0x42D604A8UL))
#define bM0P_AES_KEY1_KEY111                            *((volatile unsigned int*)(0x42D604ACUL))
#define bM0P_AES_KEY1_KEY112                            *((volatile unsigned int*)(0x42D604B0UL))
#define bM0P_AES_KEY1_KEY113                            *((volatile unsigned int*)(0x42D604B4UL))
#define bM0P_AES_KEY1_KEY114                            *((volatile unsigned int*)(0x42D604B8UL))
#define bM0P_AES_KEY1_KEY115                            *((volatile unsigned int*)(0x42D604BCUL))
#define bM0P_AES_KEY1_KEY116                            *((volatile unsigned int*)(0x42D604C0UL))
#define bM0P_AES_KEY1_KEY117                            *((volatile unsigned int*)(0x42D604C4UL))
#define bM0P_AES_KEY1_KEY118                            *((volatile unsigned int*)(0x42D604C8UL))
#define bM0P_AES_KEY1_KEY119                            *((volatile unsigned int*)(0x42D604CCUL))
#define bM0P_AES_KEY1_KEY120                            *((volatile unsigned int*)(0x42D604D0UL))
#define bM0P_AES_KEY1_KEY121                            *((volatile unsigned int*)(0x42D604D4UL))
#define bM0P_AES_KEY1_KEY122                            *((volatile unsigned int*)(0x42D604D8UL))
#define bM0P_AES_KEY1_KEY123                            *((volatile unsigned int*)(0x42D604DCUL))
#define bM0P_AES_KEY1_KEY124                            *((volatile unsigned int*)(0x42D604E0UL))
#define bM0P_AES_KEY1_KEY125                            *((volatile unsigned int*)(0x42D604E4UL))
#define bM0P_AES_KEY1_KEY126                            *((volatile unsigned int*)(0x42D604E8UL))
#define bM0P_AES_KEY1_KEY127                            *((volatile unsigned int*)(0x42D604ECUL))
#define bM0P_AES_KEY1_KEY128                            *((volatile unsigned int*)(0x42D604F0UL))
#define bM0P_AES_KEY1_KEY129                            *((volatile unsigned int*)(0x42D604F4UL))
#define bM0P_AES_KEY1_KEY130                            *((volatile unsigned int*)(0x42D604F8UL))
#define bM0P_AES_KEY1_KEY131                            *((volatile unsigned int*)(0x42D604FCUL))
#define bM0P_AES_KEY2_KEY20                             *((volatile unsigned int*)(0x42D60500UL))
#define bM0P_AES_KEY2_KEY21                             *((volatile unsigned int*)(0x42D60504UL))
#define bM0P_AES_KEY2_KEY22                             *((volatile unsigned int*)(0x42D60508UL))
#define bM0P_AES_KEY2_KEY23                             *((volatile unsigned int*)(0x42D6050CUL))
#define bM0P_AES_KEY2_KEY24                             *((volatile unsigned int*)(0x42D60510UL))
#define bM0P_AES_KEY2_KEY25                             *((volatile unsigned int*)(0x42D60514UL))
#define bM0P_AES_KEY2_KEY26                             *((volatile unsigned int*)(0x42D60518UL))
#define bM0P_AES_KEY2_KEY27                             *((volatile unsigned int*)(0x42D6051CUL))
#define bM0P_AES_KEY2_KEY28                             *((volatile unsigned int*)(0x42D60520UL))
#define bM0P_AES_KEY2_KEY29                             *((volatile unsigned int*)(0x42D60524UL))
#define bM0P_AES_KEY2_KEY210                            *((volatile unsigned int*)(0x42D60528UL))
#define bM0P_AES_KEY2_KEY211                            *((volatile unsigned int*)(0x42D6052CUL))
#define bM0P_AES_KEY2_KEY212                            *((volatile unsigned int*)(0x42D60530UL))
#define bM0P_AES_KEY2_KEY213                            *((volatile unsigned int*)(0x42D60534UL))
#define bM0P_AES_KEY2_KEY214                            *((volatile unsigned int*)(0x42D60538UL))
#define bM0P_AES_KEY2_KEY215                            *((volatile unsigned int*)(0x42D6053CUL))
#define bM0P_AES_KEY2_KEY216                            *((volatile unsigned int*)(0x42D60540UL))
#define bM0P_AES_KEY2_KEY217                            *((volatile unsigned int*)(0x42D60544UL))
#define bM0P_AES_KEY2_KEY218                            *((volatile unsigned int*)(0x42D60548UL))
#define bM0P_AES_KEY2_KEY219                            *((volatile unsigned int*)(0x42D6054CUL))
#define bM0P_AES_KEY2_KEY220                            *((volatile unsigned int*)(0x42D60550UL))
#define bM0P_AES_KEY2_KEY221                            *((volatile unsigned int*)(0x42D60554UL))
#define bM0P_AES_KEY2_KEY222                            *((volatile unsigned int*)(0x42D60558UL))
#define bM0P_AES_KEY2_KEY223                            *((volatile unsigned int*)(0x42D6055CUL))
#define bM0P_AES_KEY2_KEY224                            *((volatile unsigned int*)(0x42D60560UL))
#define bM0P_AES_KEY2_KEY225                            *((volatile unsigned int*)(0x42D60564UL))
#define bM0P_AES_KEY2_KEY226                            *((volatile unsigned int*)(0x42D60568UL))
#define bM0P_AES_KEY2_KEY227                            *((volatile unsigned int*)(0x42D6056CUL))
#define bM0P_AES_KEY2_KEY228                            *((volatile unsigned int*)(0x42D60570UL))
#define bM0P_AES_KEY2_KEY229                            *((volatile unsigned int*)(0x42D60574UL))
#define bM0P_AES_KEY2_KEY230                            *((volatile unsigned int*)(0x42D60578UL))
#define bM0P_AES_KEY2_KEY231                            *((volatile unsigned int*)(0x42D6057CUL))
#define bM0P_AES_KEY3_KEY30                             *((volatile unsigned int*)(0x42D60580UL))
#define bM0P_AES_KEY3_KEY31                             *((volatile unsigned int*)(0x42D60584UL))
#define bM0P_AES_KEY3_KEY32                             *((volatile unsigned int*)(0x42D60588UL))
#define bM0P_AES_KEY3_KEY33                             *((volatile unsigned int*)(0x42D6058CUL))
#define bM0P_AES_KEY3_KEY34                             *((volatile unsigned int*)(0x42D60590UL))
#define bM0P_AES_KEY3_KEY35                             *((volatile unsigned int*)(0x42D60594UL))
#define bM0P_AES_KEY3_KEY36                             *((volatile unsigned int*)(0x42D60598UL))
#define bM0P_AES_KEY3_KEY37                             *((volatile unsigned int*)(0x42D6059CUL))
#define bM0P_AES_KEY3_KEY38                             *((volatile unsigned int*)(0x42D605A0UL))
#define bM0P_AES_KEY3_KEY39                             *((volatile unsigned int*)(0x42D605A4UL))
#define bM0P_AES_KEY3_KEY310                            *((volatile unsigned int*)(0x42D605A8UL))
#define bM0P_AES_KEY3_KEY311                            *((volatile unsigned int*)(0x42D605ACUL))
#define bM0P_AES_KEY3_KEY312                            *((volatile unsigned int*)(0x42D605B0UL))
#define bM0P_AES_KEY3_KEY313                            *((volatile unsigned int*)(0x42D605B4UL))
#define bM0P_AES_KEY3_KEY314                            *((volatile unsigned int*)(0x42D605B8UL))
#define bM0P_AES_KEY3_KEY315                            *((volatile unsigned int*)(0x42D605BCUL))
#define bM0P_AES_KEY3_KEY316                            *((volatile unsigned int*)(0x42D605C0UL))
#define bM0P_AES_KEY3_KEY317                            *((volatile unsigned int*)(0x42D605C4UL))
#define bM0P_AES_KEY3_KEY318                            *((volatile unsigned int*)(0x42D605C8UL))
#define bM0P_AES_KEY3_KEY319                            *((volatile unsigned int*)(0x42D605CCUL))
#define bM0P_AES_KEY3_KEY320                            *((volatile unsigned int*)(0x42D605D0UL))
#define bM0P_AES_KEY3_KEY321                            *((volatile unsigned int*)(0x42D605D4UL))
#define bM0P_AES_KEY3_KEY322                            *((volatile unsigned int*)(0x42D605D8UL))
#define bM0P_AES_KEY3_KEY323                            *((volatile unsigned int*)(0x42D605DCUL))
#define bM0P_AES_KEY3_KEY324                            *((volatile unsigned int*)(0x42D605E0UL))
#define bM0P_AES_KEY3_KEY325                            *((volatile unsigned int*)(0x42D605E4UL))
#define bM0P_AES_KEY3_KEY326                            *((volatile unsigned int*)(0x42D605E8UL))
#define bM0P_AES_KEY3_KEY327                            *((volatile unsigned int*)(0x42D605ECUL))
#define bM0P_AES_KEY3_KEY328                            *((volatile unsigned int*)(0x42D605F0UL))
#define bM0P_AES_KEY3_KEY329                            *((volatile unsigned int*)(0x42D605F4UL))
#define bM0P_AES_KEY3_KEY330                            *((volatile unsigned int*)(0x42D605F8UL))
#define bM0P_AES_KEY3_KEY331                            *((volatile unsigned int*)(0x42D605FCUL))
#define bM0P_AES_KEY4_KEY40                             *((volatile unsigned int*)(0x42D60600UL))
#define bM0P_AES_KEY4_KEY41                             *((volatile unsigned int*)(0x42D60604UL))
#define bM0P_AES_KEY4_KEY42                             *((volatile unsigned int*)(0x42D60608UL))
#define bM0P_AES_KEY4_KEY43                             *((volatile unsigned int*)(0x42D6060CUL))
#define bM0P_AES_KEY4_KEY44                             *((volatile unsigned int*)(0x42D60610UL))
#define bM0P_AES_KEY4_KEY45                             *((volatile unsigned int*)(0x42D60614UL))
#define bM0P_AES_KEY4_KEY46                             *((volatile unsigned int*)(0x42D60618UL))
#define bM0P_AES_KEY4_KEY47                             *((volatile unsigned int*)(0x42D6061CUL))
#define bM0P_AES_KEY4_KEY48                             *((volatile unsigned int*)(0x42D60620UL))
#define bM0P_AES_KEY4_KEY49                             *((volatile unsigned int*)(0x42D60624UL))
#define bM0P_AES_KEY4_KEY410                            *((volatile unsigned int*)(0x42D60628UL))
#define bM0P_AES_KEY4_KEY411                            *((volatile unsigned int*)(0x42D6062CUL))
#define bM0P_AES_KEY4_KEY412                            *((volatile unsigned int*)(0x42D60630UL))
#define bM0P_AES_KEY4_KEY413                            *((volatile unsigned int*)(0x42D60634UL))
#define bM0P_AES_KEY4_KEY414                            *((volatile unsigned int*)(0x42D60638UL))
#define bM0P_AES_KEY4_KEY415                            *((volatile unsigned int*)(0x42D6063CUL))
#define bM0P_AES_KEY4_KEY416                            *((volatile unsigned int*)(0x42D60640UL))
#define bM0P_AES_KEY4_KEY417                            *((volatile unsigned int*)(0x42D60644UL))
#define bM0P_AES_KEY4_KEY418                            *((volatile unsigned int*)(0x42D60648UL))
#define bM0P_AES_KEY4_KEY419                            *((volatile unsigned int*)(0x42D6064CUL))
#define bM0P_AES_KEY4_KEY420                            *((volatile unsigned int*)(0x42D60650UL))
#define bM0P_AES_KEY4_KEY421                            *((volatile unsigned int*)(0x42D60654UL))
#define bM0P_AES_KEY4_KEY422                            *((volatile unsigned int*)(0x42D60658UL))
#define bM0P_AES_KEY4_KEY423                            *((volatile unsigned int*)(0x42D6065CUL))
#define bM0P_AES_KEY4_KEY424                            *((volatile unsigned int*)(0x42D60660UL))
#define bM0P_AES_KEY4_KEY425                            *((volatile unsigned int*)(0x42D60664UL))
#define bM0P_AES_KEY4_KEY426                            *((volatile unsigned int*)(0x42D60668UL))
#define bM0P_AES_KEY4_KEY427                            *((volatile unsigned int*)(0x42D6066CUL))
#define bM0P_AES_KEY4_KEY428                            *((volatile unsigned int*)(0x42D60670UL))
#define bM0P_AES_KEY4_KEY429                            *((volatile unsigned int*)(0x42D60674UL))
#define bM0P_AES_KEY4_KEY430                            *((volatile unsigned int*)(0x42D60678UL))
#define bM0P_AES_KEY4_KEY431                            *((volatile unsigned int*)(0x42D6067CUL))
#define bM0P_AES_KEY5_KEY50                             *((volatile unsigned int*)(0x42D60680UL))
#define bM0P_AES_KEY5_KEY51                             *((volatile unsigned int*)(0x42D60684UL))
#define bM0P_AES_KEY5_KEY52                             *((volatile unsigned int*)(0x42D60688UL))
#define bM0P_AES_KEY5_KEY53                             *((volatile unsigned int*)(0x42D6068CUL))
#define bM0P_AES_KEY5_KEY54                             *((volatile unsigned int*)(0x42D60690UL))
#define bM0P_AES_KEY5_KEY55                             *((volatile unsigned int*)(0x42D60694UL))
#define bM0P_AES_KEY5_KEY56                             *((volatile unsigned int*)(0x42D60698UL))
#define bM0P_AES_KEY5_KEY57                             *((volatile unsigned int*)(0x42D6069CUL))
#define bM0P_AES_KEY5_KEY58                             *((volatile unsigned int*)(0x42D606A0UL))
#define bM0P_AES_KEY5_KEY59                             *((volatile unsigned int*)(0x42D606A4UL))
#define bM0P_AES_KEY5_KEY510                            *((volatile unsigned int*)(0x42D606A8UL))
#define bM0P_AES_KEY5_KEY511                            *((volatile unsigned int*)(0x42D606ACUL))
#define bM0P_AES_KEY5_KEY512                            *((volatile unsigned int*)(0x42D606B0UL))
#define bM0P_AES_KEY5_KEY513                            *((volatile unsigned int*)(0x42D606B4UL))
#define bM0P_AES_KEY5_KEY514                            *((volatile unsigned int*)(0x42D606B8UL))
#define bM0P_AES_KEY5_KEY515                            *((volatile unsigned int*)(0x42D606BCUL))
#define bM0P_AES_KEY5_KEY516                            *((volatile unsigned int*)(0x42D606C0UL))
#define bM0P_AES_KEY5_KEY517                            *((volatile unsigned int*)(0x42D606C4UL))
#define bM0P_AES_KEY5_KEY518                            *((volatile unsigned int*)(0x42D606C8UL))
#define bM0P_AES_KEY5_KEY519                            *((volatile unsigned int*)(0x42D606CCUL))
#define bM0P_AES_KEY5_KEY520                            *((volatile unsigned int*)(0x42D606D0UL))
#define bM0P_AES_KEY5_KEY521                            *((volatile unsigned int*)(0x42D606D4UL))
#define bM0P_AES_KEY5_KEY522                            *((volatile unsigned int*)(0x42D606D8UL))
#define bM0P_AES_KEY5_KEY523                            *((volatile unsigned int*)(0x42D606DCUL))
#define bM0P_AES_KEY5_KEY524                            *((volatile unsigned int*)(0x42D606E0UL))
#define bM0P_AES_KEY5_KEY525                            *((volatile unsigned int*)(0x42D606E4UL))
#define bM0P_AES_KEY5_KEY526                            *((volatile unsigned int*)(0x42D606E8UL))
#define bM0P_AES_KEY5_KEY527                            *((volatile unsigned int*)(0x42D606ECUL))
#define bM0P_AES_KEY5_KEY528                            *((volatile unsigned int*)(0x42D606F0UL))
#define bM0P_AES_KEY5_KEY529                            *((volatile unsigned int*)(0x42D606F4UL))
#define bM0P_AES_KEY5_KEY530                            *((volatile unsigned int*)(0x42D606F8UL))
#define bM0P_AES_KEY5_KEY531                            *((volatile unsigned int*)(0x42D606FCUL))
#define bM0P_AES_KEY6_KEY60                             *((volatile unsigned int*)(0x42D60700UL))
#define bM0P_AES_KEY6_KEY61                             *((volatile unsigned int*)(0x42D60704UL))
#define bM0P_AES_KEY6_KEY62                             *((volatile unsigned int*)(0x42D60708UL))
#define bM0P_AES_KEY6_KEY63                             *((volatile unsigned int*)(0x42D6070CUL))
#define bM0P_AES_KEY6_KEY64                             *((volatile unsigned int*)(0x42D60710UL))
#define bM0P_AES_KEY6_KEY65                             *((volatile unsigned int*)(0x42D60714UL))
#define bM0P_AES_KEY6_KEY66                             *((volatile unsigned int*)(0x42D60718UL))
#define bM0P_AES_KEY6_KEY67                             *((volatile unsigned int*)(0x42D6071CUL))
#define bM0P_AES_KEY6_KEY68                             *((volatile unsigned int*)(0x42D60720UL))
#define bM0P_AES_KEY6_KEY69                             *((volatile unsigned int*)(0x42D60724UL))
#define bM0P_AES_KEY6_KEY610                            *((volatile unsigned int*)(0x42D60728UL))
#define bM0P_AES_KEY6_KEY611                            *((volatile unsigned int*)(0x42D6072CUL))
#define bM0P_AES_KEY6_KEY612                            *((volatile unsigned int*)(0x42D60730UL))
#define bM0P_AES_KEY6_KEY613                            *((volatile unsigned int*)(0x42D60734UL))
#define bM0P_AES_KEY6_KEY614                            *((volatile unsigned int*)(0x42D60738UL))
#define bM0P_AES_KEY6_KEY615                            *((volatile unsigned int*)(0x42D6073CUL))
#define bM0P_AES_KEY6_KEY616                            *((volatile unsigned int*)(0x42D60740UL))
#define bM0P_AES_KEY6_KEY617                            *((volatile unsigned int*)(0x42D60744UL))
#define bM0P_AES_KEY6_KEY618                            *((volatile unsigned int*)(0x42D60748UL))
#define bM0P_AES_KEY6_KEY619                            *((volatile unsigned int*)(0x42D6074CUL))
#define bM0P_AES_KEY6_KEY620                            *((volatile unsigned int*)(0x42D60750UL))
#define bM0P_AES_KEY6_KEY621                            *((volatile unsigned int*)(0x42D60754UL))
#define bM0P_AES_KEY6_KEY622                            *((volatile unsigned int*)(0x42D60758UL))
#define bM0P_AES_KEY6_KEY623                            *((volatile unsigned int*)(0x42D6075CUL))
#define bM0P_AES_KEY6_KEY624                            *((volatile unsigned int*)(0x42D60760UL))
#define bM0P_AES_KEY6_KEY625                            *((volatile unsigned int*)(0x42D60764UL))
#define bM0P_AES_KEY6_KEY626                            *((volatile unsigned int*)(0x42D60768UL))
#define bM0P_AES_KEY6_KEY627                            *((volatile unsigned int*)(0x42D6076CUL))
#define bM0P_AES_KEY6_KEY628                            *((volatile unsigned int*)(0x42D60770UL))
#define bM0P_AES_KEY6_KEY629                            *((volatile unsigned int*)(0x42D60774UL))
#define bM0P_AES_KEY6_KEY630                            *((volatile unsigned int*)(0x42D60778UL))
#define bM0P_AES_KEY6_KEY631                            *((volatile unsigned int*)(0x42D6077CUL))
#define bM0P_AES_KEY7_KEY70                             *((volatile unsigned int*)(0x42D60780UL))
#define bM0P_AES_KEY7_KEY71                             *((volatile unsigned int*)(0x42D60784UL))
#define bM0P_AES_KEY7_KEY72                             *((volatile unsigned int*)(0x42D60788UL))
#define bM0P_AES_KEY7_KEY73                             *((volatile unsigned int*)(0x42D6078CUL))
#define bM0P_AES_KEY7_KEY74                             *((volatile unsigned int*)(0x42D60790UL))
#define bM0P_AES_KEY7_KEY75                             *((volatile unsigned int*)(0x42D60794UL))
#define bM0P_AES_KEY7_KEY76                             *((volatile unsigned int*)(0x42D60798UL))
#define bM0P_AES_KEY7_KEY77                             *((volatile unsigned int*)(0x42D6079CUL))
#define bM0P_AES_KEY7_KEY78                             *((volatile unsigned int*)(0x42D607A0UL))
#define bM0P_AES_KEY7_KEY79                             *((volatile unsigned int*)(0x42D607A4UL))
#define bM0P_AES_KEY7_KEY710                            *((volatile unsigned int*)(0x42D607A8UL))
#define bM0P_AES_KEY7_KEY711                            *((volatile unsigned int*)(0x42D607ACUL))
#define bM0P_AES_KEY7_KEY712                            *((volatile unsigned int*)(0x42D607B0UL))
#define bM0P_AES_KEY7_KEY713                            *((volatile unsigned int*)(0x42D607B4UL))
#define bM0P_AES_KEY7_KEY714                            *((volatile unsigned int*)(0x42D607B8UL))
#define bM0P_AES_KEY7_KEY715                            *((volatile unsigned int*)(0x42D607BCUL))
#define bM0P_AES_KEY7_KEY716                            *((volatile unsigned int*)(0x42D607C0UL))
#define bM0P_AES_KEY7_KEY717                            *((volatile unsigned int*)(0x42D607C4UL))
#define bM0P_AES_KEY7_KEY718                            *((volatile unsigned int*)(0x42D607C8UL))
#define bM0P_AES_KEY7_KEY719                            *((volatile unsigned int*)(0x42D607CCUL))
#define bM0P_AES_KEY7_KEY720                            *((volatile unsigned int*)(0x42D607D0UL))
#define bM0P_AES_KEY7_KEY721                            *((volatile unsigned int*)(0x42D607D4UL))
#define bM0P_AES_KEY7_KEY722                            *((volatile unsigned int*)(0x42D607D8UL))
#define bM0P_AES_KEY7_KEY723                            *((volatile unsigned int*)(0x42D607DCUL))
#define bM0P_AES_KEY7_KEY724                            *((volatile unsigned int*)(0x42D607E0UL))
#define bM0P_AES_KEY7_KEY725                            *((volatile unsigned int*)(0x42D607E4UL))
#define bM0P_AES_KEY7_KEY726                            *((volatile unsigned int*)(0x42D607E8UL))
#define bM0P_AES_KEY7_KEY727                            *((volatile unsigned int*)(0x42D607ECUL))
#define bM0P_AES_KEY7_KEY728                            *((volatile unsigned int*)(0x42D607F0UL))
#define bM0P_AES_KEY7_KEY729                            *((volatile unsigned int*)(0x42D607F4UL))
#define bM0P_AES_KEY7_KEY730                            *((volatile unsigned int*)(0x42D607F8UL))
#define bM0P_AES_KEY7_KEY731                            *((volatile unsigned int*)(0x42D607FCUL))
#define bM0P_AES_RNG0_RNG00                             *((volatile unsigned int*)(0x42D60800UL))
#define bM0P_AES_RNG0_RNG01                             *((volatile unsigned int*)(0x42D60804UL))
#define bM0P_AES_RNG0_RNG02                             *((volatile unsigned int*)(0x42D60808UL))
#define bM0P_AES_RNG0_RNG03                             *((volatile unsigned int*)(0x42D6080CUL))
#define bM0P_AES_RNG0_RNG04                             *((volatile unsigned int*)(0x42D60810UL))
#define bM0P_AES_RNG0_RNG05                             *((volatile unsigned int*)(0x42D60814UL))
#define bM0P_AES_RNG0_RNG06                             *((volatile unsigned int*)(0x42D60818UL))
#define bM0P_AES_RNG0_RNG07                             *((volatile unsigned int*)(0x42D6081CUL))
#define bM0P_AES_RNG0_RNG08                             *((volatile unsigned int*)(0x42D60820UL))
#define bM0P_AES_RNG0_RNG09                             *((volatile unsigned int*)(0x42D60824UL))
#define bM0P_AES_RNG0_RNG010                            *((volatile unsigned int*)(0x42D60828UL))
#define bM0P_AES_RNG0_RNG011                            *((volatile unsigned int*)(0x42D6082CUL))
#define bM0P_AES_RNG0_RNG012                            *((volatile unsigned int*)(0x42D60830UL))
#define bM0P_AES_RNG0_RNG013                            *((volatile unsigned int*)(0x42D60834UL))
#define bM0P_AES_RNG0_RNG014                            *((volatile unsigned int*)(0x42D60838UL))
#define bM0P_AES_RNG0_RNG015                            *((volatile unsigned int*)(0x42D6083CUL))
#define bM0P_AES_RNG0_RNG016                            *((volatile unsigned int*)(0x42D60840UL))
#define bM0P_AES_RNG0_RNG017                            *((volatile unsigned int*)(0x42D60844UL))
#define bM0P_AES_RNG0_RNG018                            *((volatile unsigned int*)(0x42D60848UL))
#define bM0P_AES_RNG0_RNG019                            *((volatile unsigned int*)(0x42D6084CUL))
#define bM0P_AES_RNG0_RNG020                            *((volatile unsigned int*)(0x42D60850UL))
#define bM0P_AES_RNG0_RNG021                            *((volatile unsigned int*)(0x42D60854UL))
#define bM0P_AES_RNG0_RNG022                            *((volatile unsigned int*)(0x42D60858UL))
#define bM0P_AES_RNG0_RNG023                            *((volatile unsigned int*)(0x42D6085CUL))
#define bM0P_AES_RNG0_RNG024                            *((volatile unsigned int*)(0x42D60860UL))
#define bM0P_AES_RNG0_RNG025                            *((volatile unsigned int*)(0x42D60864UL))
#define bM0P_AES_RNG0_RNG026                            *((volatile unsigned int*)(0x42D60868UL))
#define bM0P_AES_RNG0_RNG027                            *((volatile unsigned int*)(0x42D6086CUL))
#define bM0P_AES_RNG0_RNG028                            *((volatile unsigned int*)(0x42D60870UL))
