tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_AES_RNG0_RNG029                            *((volatile unsigned int*)(0x42D60874UL))
#define bM0P_AES_RNG0_RNG030                            *((volatile unsigned int*)(0x42D60878UL))
#define bM0P_AES_RNG0_RNG031                            *((volatile unsigned int*)(0x42D6087CUL))
#define bM0P_AES_RNG1_RNG10                             *((volatile unsigned int*)(0x42D60880UL))
#define bM0P_AES_RNG1_RNG11                             *((volatile unsigned int*)(0x42D60884UL))
#define bM0P_AES_RNG1_RNG12                             *((volatile unsigned int*)(0x42D60888UL))
#define bM0P_AES_RNG1_RNG13                             *((volatile unsigned int*)(0x42D6088CUL))
#define bM0P_AES_RNG1_RNG14                             *((volatile unsigned int*)(0x42D60890UL))
#define bM0P_AES_RNG1_RNG15                             *((volatile unsigned int*)(0x42D60894UL))
#define bM0P_AES_RNG1_RNG16                             *((volatile unsigned int*)(0x42D60898UL))
#define bM0P_AES_RNG1_RNG17                             *((volatile unsigned int*)(0x42D6089CUL))
#define bM0P_AES_RNG1_RNG18                             *((volatile unsigned int*)(0x42D608A0UL))
#define bM0P_AES_RNG1_RNG19                             *((volatile unsigned int*)(0x42D608A4UL))
#define bM0P_AES_RNG1_RNG110                            *((volatile unsigned int*)(0x42D608A8UL))
#define bM0P_AES_RNG1_RNG111                            *((volatile unsigned int*)(0x42D608ACUL))
#define bM0P_AES_RNG1_RNG112                            *((volatile unsigned int*)(0x42D608B0UL))
#define bM0P_AES_RNG1_RNG113                            *((volatile unsigned int*)(0x42D608B4UL))
#define bM0P_AES_RNG1_RNG114                            *((volatile unsigned int*)(0x42D608B8UL))
#define bM0P_AES_RNG1_RNG115                            *((volatile unsigned int*)(0x42D608BCUL))
#define bM0P_AES_RNG1_RNG116                            *((volatile unsigned int*)(0x42D608C0UL))
#define bM0P_AES_RNG1_RNG117                            *((volatile unsigned int*)(0x42D608C4UL))
#define bM0P_AES_RNG1_RNG118                            *((volatile unsigned int*)(0x42D608C8UL))
#define bM0P_AES_RNG1_RNG119                            *((volatile unsigned int*)(0x42D608CCUL))
#define bM0P_AES_RNG1_RNG120                            *((volatile unsigned int*)(0x42D608D0UL))
#define bM0P_AES_RNG1_RNG121                            *((volatile unsigned int*)(0x42D608D4UL))
#define bM0P_AES_RNG1_RNG122                            *((volatile unsigned int*)(0x42D608D8UL))
#define bM0P_AES_RNG1_RNG123                            *((volatile unsigned int*)(0x42D608DCUL))
#define bM0P_AES_RNG1_RNG124                            *((volatile unsigned int*)(0x42D608E0UL))
#define bM0P_AES_RNG1_RNG125                            *((volatile unsigned int*)(0x42D608E4UL))
#define bM0P_AES_RNG1_RNG126                            *((volatile unsigned int*)(0x42D608E8UL))
#define bM0P_AES_RNG1_RNG127                            *((volatile unsigned int*)(0x42D608ECUL))
#define bM0P_AES_RNG1_RNG128                            *((volatile unsigned int*)(0x42D608F0UL))
#define bM0P_AES_RNG1_RNG129                            *((volatile unsigned int*)(0x42D608F4UL))
#define bM0P_AES_RNG1_RNG130                            *((volatile unsigned int*)(0x42D608F8UL))
#define bM0P_AES_RNG1_RNG131                            *((volatile unsigned int*)(0x42D608FCUL))
#define bM0P_AES_INT_CON_INT_EN                         *((volatile unsigned int*)(0x42D60A00UL))
#define bM0P_AES_INT_CON_ALM_INT                        *((volatile unsigned int*)(0x42D60A04UL))
#define bM0P_AES_DIV_EN_DIV_EN                          *((volatile unsigned int*)(0x42D60C00UL))
#define bM0P_BUZZER_BUZ_CTL_CLK_SEL                     *((volatile unsigned int*)(0x42784000UL))
#define bM0P_BUZZER_BUZ_CTL_BUZ_ST                      *((volatile unsigned int*)(0x42784004UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT0                    *((volatile unsigned int*)(0x42784080UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT1                    *((volatile unsigned int*)(0x42784084UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT2                    *((volatile unsigned int*)(0x42784088UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT3                    *((volatile unsigned int*)(0x4278408CUL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT4                    *((volatile unsigned int*)(0x42784090UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT5                    *((volatile unsigned int*)(0x42784094UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT6                    *((volatile unsigned int*)(0x42784098UL))
#define bM0P_BUZZER_BUZ_CNT_BUZ_CNT7                    *((volatile unsigned int*)(0x4278409CUL))
#define bM0P_CLOCK_CTRL_HC_EN                           *((volatile unsigned int*)(0x42200000UL))
#define bM0P_CLOCK_CTRL_MAIN_EN                         *((volatile unsigned int*)(0x42200004UL))
#define bM0P_CLOCK_CTRL_SUB_EN                          *((volatile unsigned int*)(0x4220000CUL))
#define bM0P_CLOCK_CTRL_INPUT0                          *((volatile unsigned int*)(0x42200014UL))
#define bM0P_CLOCK_CTRL_INPUT1                          *((volatile unsigned int*)(0x42200018UL))
#define bM0P_CLOCK_CTRL_INPUT2                          *((volatile unsigned int*)(0x4220001CUL))
#define bM0P_CLOCK_CLK_STB_HC_RDY                       *((volatile unsigned int*)(0x42200080UL))
#define bM0P_CLOCK_CLK_STB_MAIN_RDY                     *((volatile unsigned int*)(0x42200084UL))
#define bM0P_CLOCK_CLK_STB_SUB_RDY                      *((volatile unsigned int*)(0x4220008CUL))
#define bM0P_CLOCK_CLK_STB_SRC0                         *((volatile unsigned int*)(0x42200094UL))
#define bM0P_CLOCK_CLK_STB_SRC1                         *((volatile unsigned int*)(0x42200098UL))
#define bM0P_CLOCK_CLK_STB_SRC2                         *((volatile unsigned int*)(0x4220009CUL))
#define bM0P_CLOCK_LPM_CTL_STBM0                        *((volatile unsigned int*)(0x42200100UL))
#define bM0P_CLOCK_LPM_CTL_STBM1                        *((volatile unsigned int*)(0x42200104UL))
#define bM0P_CLOCK_LPM_CTL_DSTBEN                       *((volatile unsigned int*)(0x42200108UL))
#define bM0P_CLOCK_LPM_CTL_SPLV                         *((volatile unsigned int*)(0x42200110UL))
#define bM0P_CLOCK_LPM_CTL_KEY0                         *((volatile unsigned int*)(0x42200140UL))
#define bM0P_CLOCK_LPM_CTL_KEY1                         *((volatile unsigned int*)(0x42200144UL))
#define bM0P_CLOCK_LPM_CTL_KEY2                         *((volatile unsigned int*)(0x42200148UL))
#define bM0P_CLOCK_LPM_CTL_KEY3                         *((volatile unsigned int*)(0x4220014CUL))
#define bM0P_CLOCK_LPM_CTL_KEY4                         *((volatile unsigned int*)(0x42200150UL))
#define bM0P_CLOCK_LPM_CTL_KEY5                         *((volatile unsigned int*)(0x42200154UL))
#define bM0P_CLOCK_LPM_CTL_KEY6                         *((volatile unsigned int*)(0x42200158UL))
#define bM0P_CLOCK_LPM_CTL_KEY7                         *((volatile unsigned int*)(0x4220015CUL))
#define bM0P_CLOCK_LPM_CTL_KEY8                         *((volatile unsigned int*)(0x42200160UL))
#define bM0P_CLOCK_LPM_CTL_KEY9                         *((volatile unsigned int*)(0x42200164UL))
#define bM0P_CLOCK_LPM_CTL_KEY10                        *((volatile unsigned int*)(0x42200168UL))
#define bM0P_CLOCK_LPM_CTL_KEY11                        *((volatile unsigned int*)(0x4220016CUL))
#define bM0P_CLOCK_LPM_CTL_KEY12                        *((volatile unsigned int*)(0x42200170UL))
#define bM0P_CLOCK_LPM_CTL_KEY13                        *((volatile unsigned int*)(0x42200174UL))
#define bM0P_CLOCK_LPM_CTL_KEY14                        *((volatile unsigned int*)(0x42200178UL))
#define bM0P_CLOCK_LPM_CTL_KEY15                        *((volatile unsigned int*)(0x4220017CUL))
#define bM0P_CLOCK_STAT_PWR                             *((volatile unsigned int*)(0x42200180UL))
#define bM0P_CLOCK_STAT_RSTB                            *((volatile unsigned int*)(0x42200184UL))
#define bM0P_CLOCK_STAT_LVDR                            *((volatile unsigned int*)(0x4220018CUL))
#define bM0P_CLOCK_STAT_SWWDG                           *((volatile unsigned int*)(0x42200190UL))
#define bM0P_CLOCK_STAT_HWWDG                           *((volatile unsigned int*)(0x42200194UL))
#define bM0P_CLOCK_STAT_CSV                             *((volatile unsigned int*)(0x42200198UL))
#define bM0P_CLOCK_STAT_AF                              *((volatile unsigned int*)(0x4220019CUL))
#define bM0P_CLOCK_STAT_SW                              *((volatile unsigned int*)(0x422001A0UL))
#define bM0P_CLOCK_BC_DIV_DIV0                          *((volatile unsigned int*)(0x42200200UL))
#define bM0P_CLOCK_BC_DIV_DIV1                          *((volatile unsigned int*)(0x42200204UL))
#define bM0P_CLOCK_BC_DIV_DIV2                          *((volatile unsigned int*)(0x42200208UL))
#define bM0P_CLOCK_APB0_CTRL_DIV0                       *((volatile unsigned int*)(0x42200280UL))
#define bM0P_CLOCK_APB0_CTRL_DIV1                       *((volatile unsigned int*)(0x42200284UL))
#define bM0P_CLOCK_APB1_CTRL_DIV0                       *((volatile unsigned int*)(0x42200300UL))
#define bM0P_CLOCK_APB1_CTRL_DIV1                       *((volatile unsigned int*)(0x42200304UL))
#define bM0P_CLOCK_APB1_CTRL_RST                        *((volatile unsigned int*)(0x42200310UL))
#define bM0P_CLOCK_APB1_CTRL_EN                         *((volatile unsigned int*)(0x4220031CUL))
#define bM0P_CLOCK_CLK_CTL_SWDS0                        *((volatile unsigned int*)(0x42200400UL))
#define bM0P_CLOCK_CLK_CTL_SWDS1                        *((volatile unsigned int*)(0x42200404UL))
#define bM0P_CLOCK_CLK_CTL_SWCKE                        *((volatile unsigned int*)(0x42200410UL))
#define bM0P_CLOCK_CLK_CTL_HWCKE                        *((volatile unsigned int*)(0x42200414UL))
#define bM0P_CLOCK_CLK_CTL_DTCKE                        *((volatile unsigned int*)(0x42200418UL))
#define bM0P_CLOCK_CSWT_MAINWT0                         *((volatile unsigned int*)(0x42200600UL))
#define bM0P_CLOCK_CSWT_MAINWT1                         *((volatile unsigned int*)(0x42200604UL))
#define bM0P_CLOCK_CSWT_MAINWT2                         *((volatile unsigned int*)(0x42200608UL))
#define bM0P_CLOCK_CSWT_MAINWT3                         *((volatile unsigned int*)(0x4220060CUL))
#define bM0P_CLOCK_CSWT_SUBWT0                          *((volatile unsigned int*)(0x42200610UL))
#define bM0P_CLOCK_CSWT_SUBWT1                          *((volatile unsigned int*)(0x42200614UL))
#define bM0P_CLOCK_CSWT_SUBWT2                          *((volatile unsigned int*)(0x42200618UL))
#define bM0P_CLOCK_CSWT_SUBWT3                          *((volatile unsigned int*)(0x4220061CUL))
#define bM0P_CLOCK_FCM_CTL_MFCME                        *((volatile unsigned int*)(0x42200800UL))
#define bM0P_CLOCK_FCM_CTL_SFCME                        *((volatile unsigned int*)(0x42200804UL))
#define bM0P_CLOCK_FCM_CTL_MFCMRE                       *((volatile unsigned int*)(0x42200808UL))
#define bM0P_CLOCK_FCM_CTL_SFCMRE                       *((volatile unsigned int*)(0x4220080CUL))
#define bM0P_CLOCK_FCM_CTL_AFDE                         *((volatile unsigned int*)(0x42200820UL))
#define bM0P_CLOCK_FCM_CTL_AFDRE                        *((volatile unsigned int*)(0x42200824UL))
#define bM0P_CLOCK_FCM_CTL_AFDCC0                       *((volatile unsigned int*)(0x42200830UL))
#define bM0P_CLOCK_FCM_CTL_AFDCC1                       *((volatile unsigned int*)(0x42200834UL))
#define bM0P_CLOCK_FCM_CTL_AFDCC2                       *((volatile unsigned int*)(0x42200838UL))
#define bM0P_CLOCK_FCM_STR_MCFDF                        *((volatile unsigned int*)(0x42200880UL))
#define bM0P_CLOCK_FCM_STR_SCFDF                        *((volatile unsigned int*)(0x42200884UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH0                     *((volatile unsigned int*)(0x42200900UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH1                     *((volatile unsigned int*)(0x42200904UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH2                     *((volatile unsigned int*)(0x42200908UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH3                     *((volatile unsigned int*)(0x4220090CUL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH4                     *((volatile unsigned int*)(0x42200910UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH5                     *((volatile unsigned int*)(0x42200914UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH6                     *((volatile unsigned int*)(0x42200918UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH7                     *((volatile unsigned int*)(0x4220091CUL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH8                     *((volatile unsigned int*)(0x42200920UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH9                     *((volatile unsigned int*)(0x42200924UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH10                    *((volatile unsigned int*)(0x42200928UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH11                    *((volatile unsigned int*)(0x4220092CUL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH12                    *((volatile unsigned int*)(0x42200930UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH13                    *((volatile unsigned int*)(0x42200934UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH14                    *((volatile unsigned int*)(0x42200938UL))
#define bM0P_CLOCK_AFDWH_CTL_AFDWH15                    *((volatile unsigned int*)(0x4220093CUL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL0                     *((volatile unsigned int*)(0x42200980UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL1                     *((volatile unsigned int*)(0x42200984UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL2                     *((volatile unsigned int*)(0x42200988UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL3                     *((volatile unsigned int*)(0x4220098CUL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL4                     *((volatile unsigned int*)(0x42200990UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL5                     *((volatile unsigned int*)(0x42200994UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL6                     *((volatile unsigned int*)(0x42200998UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL7                     *((volatile unsigned int*)(0x4220099CUL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL8                     *((volatile unsigned int*)(0x422009A0UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL9                     *((volatile unsigned int*)(0x422009A4UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL10                    *((volatile unsigned int*)(0x422009A8UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL11                    *((volatile unsigned int*)(0x422009ACUL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL12                    *((volatile unsigned int*)(0x422009B0UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL13                    *((volatile unsigned int*)(0x422009B4UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL14                    *((volatile unsigned int*)(0x422009B8UL))
#define bM0P_CLOCK_AFDWL_CTL_AFDWL15                    *((volatile unsigned int*)(0x422009BCUL))
#define bM0P_CLOCK_AFDC_CTL_AFDC0                       *((volatile unsigned int*)(0x42200A00UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC1                       *((volatile unsigned int*)(0x42200A04UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC2                       *((volatile unsigned int*)(0x42200A08UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC3                       *((volatile unsigned int*)(0x42200A0CUL))
#define bM0P_CLOCK_AFDC_CTL_AFDC4                       *((volatile unsigned int*)(0x42200A10UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC5                       *((volatile unsigned int*)(0x42200A14UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC6                       *((volatile unsigned int*)(0x42200A18UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC7                       *((volatile unsigned int*)(0x42200A1CUL))
#define bM0P_CLOCK_AFDC_CTL_AFDC8                       *((volatile unsigned int*)(0x42200A20UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC9                       *((volatile unsigned int*)(0x42200A24UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC10                      *((volatile unsigned int*)(0x42200A28UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC11                      *((volatile unsigned int*)(0x42200A2CUL))
#define bM0P_CLOCK_AFDC_CTL_AFDC12                      *((volatile unsigned int*)(0x42200A30UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC13                      *((volatile unsigned int*)(0x42200A34UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC14                      *((volatile unsigned int*)(0x42200A38UL))
#define bM0P_CLOCK_AFDC_CTL_AFDC15                      *((volatile unsigned int*)(0x42200A3CUL))
#define bM0P_CLOCK_DBWDT_CTRL_SWWDG_BRK                 *((volatile unsigned int*)(0x42200A94UL))
#define bM0P_CLOCK_DBWDT_CTRL_HWWDG_BRK                 *((volatile unsigned int*)(0x42200A9CUL))
#define bM0P_CLOCK_INT_CTRL_MAINEN                      *((volatile unsigned int*)(0x42200C00UL))
#define bM0P_CLOCK_INT_CTRL_SUBEN                       *((volatile unsigned int*)(0x42200C04UL))
#define bM0P_CLOCK_INT_CTRL_MCSVIE                      *((volatile unsigned int*)(0x42200C0CUL))
#define bM0P_CLOCK_INT_CTRL_SCSVIE                      *((volatile unsigned int*)(0x42200C10UL))
#define bM0P_CLOCK_INT_CTRL_FCSEN                       *((volatile unsigned int*)(0x42200C14UL))
#define bM0P_CLOCK_INT_PEND_MAIN                        *((volatile unsigned int*)(0x42200C80UL))
#define bM0P_CLOCK_INT_PEND_SUB                         *((volatile unsigned int*)(0x42200C84UL))
#define bM0P_CLOCK_INT_PEND_MCSVI                       *((volatile unsigned int*)(0x42200C8CUL))
#define bM0P_CLOCK_INT_PEND_SCSVI                       *((volatile unsigned int*)(0x42200C90UL))
#define bM0P_CLOCK_INT_PEND_FCS                         *((volatile unsigned int*)(0x42200C94UL))
#define bM0P_CLOCK_INT_CLR_MAIN                         *((volatile unsigned int*)(0x42200D00UL))
#define bM0P_CLOCK_INT_CLR_SUB                          *((volatile unsigned int*)(0x42200D04UL))
#define bM0P_CLOCK_INT_CLR_MCSVC                        *((volatile unsigned int*)(0x42200D0CUL))
#define bM0P_CLOCK_INT_CLR_SCSVC                        *((volatile unsigned int*)(0x42200D10UL))
#define bM0P_CLOCK_INT_CLR_FCS                          *((volatile unsigned int*)(0x42200D14UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL010                 *((volatile unsigned int*)(0x424A2020UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL011                 *((volatile unsigned int*)(0x424A2024UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL012                 *((volatile unsigned int*)(0x424A2028UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL013                 *((volatile unsigned int*)(0x424A202CUL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL230                 *((volatile unsigned int*)(0x424A2030UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL231                 *((volatile unsigned int*)(0x424A2034UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL232                 *((volatile unsigned int*)(0x424A2038UL))
#define bM0P_CTIOSEL03_CTSEL0123_SEL233                 *((volatile unsigned int*)(0x424A203CUL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL450                 *((volatile unsigned int*)(0x424A6020UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL451                 *((volatile unsigned int*)(0x424A6024UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL452                 *((volatile unsigned int*)(0x424A6028UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL453                 *((volatile unsigned int*)(0x424A602CUL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL670                 *((volatile unsigned int*)(0x424A6030UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL671                 *((volatile unsigned int*)(0x424A6034UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL672                 *((volatile unsigned int*)(0x424A6038UL))
#define bM0P_CTIOSEL47_CTSEL4567_SEL673                 *((volatile unsigned int*)(0x424A603CUL))
#define bM0P_CT0_PPG_TCR_START                          *((volatile unsigned int*)(0x424A0180UL))
#define bM0P_CT0_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0184UL))
#define bM0P_CT0_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A0188UL))
#define bM0P_CT0_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A018CUL))
#define bM0P_CT0_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0190UL))
#define bM0P_CT0_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0194UL))
#define bM0P_CT0_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0198UL))
#define bM0P_CT0_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A01A0UL))
#define bM0P_CT0_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A01A4UL))
#define bM0P_CT0_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A01A8UL))
#define bM0P_CT0_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A01ACUL))
#define bM0P_CT0_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A01B0UL))
#define bM0P_CT0_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A01B4UL))
#define bM0P_CT0_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A01B8UL))
#define bM0P_CT0_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A0200UL))
#define bM0P_CT0_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A0208UL))
#define bM0P_CT0_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A0210UL))
#define bM0P_CT0_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A0218UL))
#define bM0P_CT0_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0220UL))
#define bM0P_CT1_PPG_TCR_START                          *((volatile unsigned int*)(0x424A0980UL))
#define bM0P_CT1_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0984UL))
#define bM0P_CT1_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A0988UL))
#define bM0P_CT1_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A098CUL))
#define bM0P_CT1_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0990UL))
#define bM0P_CT1_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0994UL))
#define bM0P_CT1_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0998UL))
#define bM0P_CT1_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A09A0UL))
#define bM0P_CT1_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A09A4UL))
#define bM0P_CT1_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A09A8UL))
#define bM0P_CT1_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A09ACUL))
#define bM0P_CT1_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A09B0UL))
#define bM0P_CT1_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A09B4UL))
#define bM0P_CT1_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A09B8UL))
#define bM0P_CT1_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A0A00UL))
#define bM0P_CT1_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A0A08UL))
#define bM0P_CT1_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A0A10UL))
#define bM0P_CT1_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A0A18UL))
#define bM0P_CT1_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0A20UL))
#define bM0P_CT2_PPG_TCR_START                          *((volatile unsigned int*)(0x424A1180UL))
#define bM0P_CT2_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1184UL))
#define bM0P_CT2_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A1188UL))
#define bM0P_CT2_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A118CUL))
