tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_CT2_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1190UL))
#define bM0P_CT2_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1194UL))
#define bM0P_CT2_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1198UL))
#define bM0P_CT2_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A11A0UL))
#define bM0P_CT2_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A11A4UL))
#define bM0P_CT2_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A11A8UL))
#define bM0P_CT2_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A11ACUL))
#define bM0P_CT2_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A11B0UL))
#define bM0P_CT2_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A11B4UL))
#define bM0P_CT2_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A11B8UL))
#define bM0P_CT2_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A1200UL))
#define bM0P_CT2_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A1208UL))
#define bM0P_CT2_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A1210UL))
#define bM0P_CT2_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A1218UL))
#define bM0P_CT2_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1220UL))
#define bM0P_CT3_PPG_TCR_START                          *((volatile unsigned int*)(0x424A1980UL))
#define bM0P_CT3_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1984UL))
#define bM0P_CT3_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A1988UL))
#define bM0P_CT3_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A198CUL))
#define bM0P_CT3_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1990UL))
#define bM0P_CT3_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1994UL))
#define bM0P_CT3_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1998UL))
#define bM0P_CT3_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A19A0UL))
#define bM0P_CT3_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A19A8UL))
#define bM0P_CT3_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A19ACUL))
#define bM0P_CT3_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT4_PPG_TCR_START                          *((volatile unsigned int*)(0x424A4180UL))
#define bM0P_CT4_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A4184UL))
#define bM0P_CT4_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A4188UL))
#define bM0P_CT4_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A418CUL))
#define bM0P_CT4_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A4190UL))
#define bM0P_CT4_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A4194UL))
#define bM0P_CT4_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A4198UL))
#define bM0P_CT4_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A41A0UL))
#define bM0P_CT4_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A41A4UL))
#define bM0P_CT4_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A41A8UL))
#define bM0P_CT4_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A41ACUL))
#define bM0P_CT4_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A41B0UL))
#define bM0P_CT4_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A41B4UL))
#define bM0P_CT4_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A41B8UL))
#define bM0P_CT4_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A4200UL))
#define bM0P_CT4_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A4208UL))
#define bM0P_CT4_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A4210UL))
#define bM0P_CT4_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A4218UL))
#define bM0P_CT4_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A4220UL))
#define bM0P_CT5_PPG_TCR_START                          *((volatile unsigned int*)(0x424A4980UL))
#define bM0P_CT5_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A4984UL))
#define bM0P_CT5_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A4988UL))
#define bM0P_CT5_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A498CUL))
#define bM0P_CT5_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A4990UL))
#define bM0P_CT5_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A4994UL))
#define bM0P_CT5_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A4998UL))
#define bM0P_CT5_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A49A0UL))
#define bM0P_CT5_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A49A4UL))
#define bM0P_CT5_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A49A8UL))
#define bM0P_CT5_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A49ACUL))
#define bM0P_CT5_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A49B0UL))
#define bM0P_CT5_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A49B4UL))
#define bM0P_CT5_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A49B8UL))
#define bM0P_CT5_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A4A00UL))
#define bM0P_CT5_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A4A08UL))
#define bM0P_CT5_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A4A10UL))
#define bM0P_CT5_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A4A18UL))
#define bM0P_CT5_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A4A20UL))
#define bM0P_CT6_PPG_TCR_START                          *((volatile unsigned int*)(0x424A5180UL))
#define bM0P_CT6_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A5184UL))
#define bM0P_CT6_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A5188UL))
#define bM0P_CT6_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A518CUL))
#define bM0P_CT6_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A5190UL))
#define bM0P_CT6_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A5194UL))
#define bM0P_CT6_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A5198UL))
#define bM0P_CT6_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A51A0UL))
#define bM0P_CT6_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A51A4UL))
#define bM0P_CT6_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A51A8UL))
#define bM0P_CT6_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A51ACUL))
#define bM0P_CT6_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A51B0UL))
#define bM0P_CT6_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A51B4UL))
#define bM0P_CT6_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A51B8UL))
#define bM0P_CT6_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A5200UL))
#define bM0P_CT6_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A5208UL))
#define bM0P_CT6_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A5210UL))
#define bM0P_CT6_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A5218UL))
#define bM0P_CT6_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A5220UL))
#define bM0P_CT7_PPG_TCR_START                          *((volatile unsigned int*)(0x424A5980UL))
#define bM0P_CT7_PPG_TCR_ENCNT                          *((volatile unsigned int*)(0x424A5984UL))
#define bM0P_CT7_PPG_TCR_MODS                           *((volatile unsigned int*)(0x424A5988UL))
#define bM0P_CT7_PPG_TCR_PLRT                           *((volatile unsigned int*)(0x424A598CUL))
#define bM0P_CT7_PPG_TCR_FUNC0                          *((volatile unsigned int*)(0x424A5990UL))
#define bM0P_CT7_PPG_TCR_FUNC1                          *((volatile unsigned int*)(0x424A5994UL))
#define bM0P_CT7_PPG_TCR_FUNC2                          *((volatile unsigned int*)(0x424A5998UL))
#define bM0P_CT7_PPG_TCR_EDGS0                          *((volatile unsigned int*)(0x424A59A0UL))
#define bM0P_CT7_PPG_TCR_EDGS1                          *((volatile unsigned int*)(0x424A59A4UL))
#define bM0P_CT7_PPG_TCR_MASK                           *((volatile unsigned int*)(0x424A59A8UL))
#define bM0P_CT7_PPG_TCR_RSTEN                          *((volatile unsigned int*)(0x424A59ACUL))
#define bM0P_CT7_PPG_TCR_CLKS0                          *((volatile unsigned int*)(0x424A59B0UL))
#define bM0P_CT7_PPG_TCR_CLKS1                          *((volatile unsigned int*)(0x424A59B4UL))
#define bM0P_CT7_PPG_TCR_CLKS2                          *((volatile unsigned int*)(0x424A59B8UL))
#define bM0P_CT7_PPG_STA_UDFIR                          *((volatile unsigned int*)(0x424A5A00UL))
#define bM0P_CT7_PPG_STA_TRGIR                          *((volatile unsigned int*)(0x424A5A08UL))
#define bM0P_CT7_PPG_STA_UDFIE                          *((volatile unsigned int*)(0x424A5A10UL))
#define bM0P_CT7_PPG_STA_TRGIE                          *((volatile unsigned int*)(0x424A5A18UL))
#define bM0P_CT7_PPG_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A5A20UL))
#define bM0P_CT0_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0184UL))
#define bM0P_CT0_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A0188UL))
#define bM0P_CT0_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0190UL))
#define bM0P_CT0_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0194UL))
#define bM0P_CT0_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0198UL))
#define bM0P_CT0_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A019CUL))
#define bM0P_CT0_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A01A0UL))
#define bM0P_CT0_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A01A4UL))
#define bM0P_CT0_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A01A8UL))
#define bM0P_CT0_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A01B0UL))
#define bM0P_CT0_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A01B4UL))
#define bM0P_CT0_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A01B8UL))
#define bM0P_CT0_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A0200UL))
#define bM0P_CT0_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A0208UL))
#define bM0P_CT0_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A0210UL))
#define bM0P_CT0_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A0218UL))
#define bM0P_CT0_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A021CUL))
#define bM0P_CT0_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0220UL))
#define bM0P_CT1_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A0984UL))
#define bM0P_CT1_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A0988UL))
#define bM0P_CT1_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A0990UL))
#define bM0P_CT1_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A0994UL))
#define bM0P_CT1_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A0998UL))
#define bM0P_CT1_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A099CUL))
#define bM0P_CT1_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A09A0UL))
#define bM0P_CT1_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A09A4UL))
#define bM0P_CT1_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A09A8UL))
#define bM0P_CT1_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A09B0UL))
#define bM0P_CT1_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A09B4UL))
#define bM0P_CT1_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A09B8UL))
#define bM0P_CT1_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A0A00UL))
#define bM0P_CT1_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A0A08UL))
#define bM0P_CT1_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A0A10UL))
#define bM0P_CT1_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A0A18UL))
#define bM0P_CT1_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A0A1CUL))
#define bM0P_CT1_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A0A20UL))
#define bM0P_CT2_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1184UL))
#define bM0P_CT2_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A1188UL))
#define bM0P_CT2_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1190UL))
#define bM0P_CT2_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1194UL))
#define bM0P_CT2_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1198UL))
#define bM0P_CT2_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A119CUL))
#define bM0P_CT2_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A11A0UL))
#define bM0P_CT2_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A11A4UL))
#define bM0P_CT2_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A11A8UL))
#define bM0P_CT2_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A11B0UL))
#define bM0P_CT2_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A11B4UL))
#define bM0P_CT2_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A11B8UL))
#define bM0P_CT2_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A1200UL))
#define bM0P_CT2_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A1208UL))
#define bM0P_CT2_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A1210UL))
#define bM0P_CT2_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A1218UL))
#define bM0P_CT2_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A121CUL))
#define bM0P_CT2_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1220UL))
#define bM0P_CT3_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A1984UL))
#define bM0P_CT3_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A1988UL))
#define bM0P_CT3_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A1990UL))
#define bM0P_CT3_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A1994UL))
#define bM0P_CT3_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A1998UL))
#define bM0P_CT3_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A199CUL))
#define bM0P_CT3_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A19A0UL))
#define bM0P_CT3_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A19A8UL))
#define bM0P_CT3_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A1A1CUL))
#define bM0P_CT3_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT4_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A4184UL))
#define bM0P_CT4_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A4188UL))
#define bM0P_CT4_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A4190UL))
#define bM0P_CT4_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A4194UL))
#define bM0P_CT4_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A4198UL))
#define bM0P_CT4_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A419CUL))
#define bM0P_CT4_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A41A0UL))
#define bM0P_CT4_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A41A4UL))
#define bM0P_CT4_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A41A8UL))
#define bM0P_CT4_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A41B0UL))
#define bM0P_CT4_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A41B4UL))
#define bM0P_CT4_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A41B8UL))
#define bM0P_CT4_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A4200UL))
#define bM0P_CT4_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A4208UL))
#define bM0P_CT4_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A4210UL))
#define bM0P_CT4_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A4218UL))
#define bM0P_CT4_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A421CUL))
#define bM0P_CT4_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A4220UL))
#define bM0P_CT5_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A4984UL))
#define bM0P_CT5_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A4988UL))
#define bM0P_CT5_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A4990UL))
#define bM0P_CT5_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A4994UL))
#define bM0P_CT5_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A4998UL))
#define bM0P_CT5_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A499CUL))
#define bM0P_CT5_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A49A0UL))
#define bM0P_CT5_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A49A4UL))
#define bM0P_CT5_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A49A8UL))
#define bM0P_CT5_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A49B0UL))
#define bM0P_CT5_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A49B4UL))
#define bM0P_CT5_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A49B8UL))
#define bM0P_CT5_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A4A00UL))
#define bM0P_CT5_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A4A08UL))
#define bM0P_CT5_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A4A10UL))
#define bM0P_CT5_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A4A18UL))
#define bM0P_CT5_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A4A1CUL))
#define bM0P_CT5_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A4A20UL))
#define bM0P_CT6_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A5184UL))
#define bM0P_CT6_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A5188UL))
#define bM0P_CT6_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A5190UL))
#define bM0P_CT6_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A5194UL))
#define bM0P_CT6_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A5198UL))
#define bM0P_CT6_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A519CUL))
#define bM0P_CT6_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A51A0UL))
#define bM0P_CT6_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A51A4UL))
#define bM0P_CT6_PWC_TCR_EDGS2                          *((volatile unsigned int*)(0x424A51A8UL))
#define bM0P_CT6_PWC_TCR_CLKS0                          *((volatile unsigned int*)(0x424A51B0UL))
#define bM0P_CT6_PWC_TCR_CLKS1                          *((volatile unsigned int*)(0x424A51B4UL))
#define bM0P_CT6_PWC_TCR_CLKS2                          *((volatile unsigned int*)(0x424A51B8UL))
#define bM0P_CT6_PWC_STA_OVIR                           *((volatile unsigned int*)(0x424A5200UL))
#define bM0P_CT6_PWC_STA_MCIR                           *((volatile unsigned int*)(0x424A5208UL))
#define bM0P_CT6_PWC_STA_OVIE                           *((volatile unsigned int*)(0x424A5210UL))
#define bM0P_CT6_PWC_STA_MCIE                           *((volatile unsigned int*)(0x424A5218UL))
#define bM0P_CT6_PWC_STA_ERR                            *((volatile unsigned int*)(0x424A521CUL))
#define bM0P_CT6_PWC_TCR2_CLKS3                         *((volatile unsigned int*)(0x424A5220UL))
#define bM0P_CT7_PWC_TCR_ENCNT                          *((volatile unsigned int*)(0x424A5984UL))
#define bM0P_CT7_PWC_TCR_MODS                           *((volatile unsigned int*)(0x424A5988UL))
#define bM0P_CT7_PWC_TCR_FUNC0                          *((volatile unsigned int*)(0x424A5990UL))
#define bM0P_CT7_PWC_TCR_FUNC1                          *((volatile unsigned int*)(0x424A5994UL))
#define bM0P_CT7_PWC_TCR_FUNC2                          *((volatile unsigned int*)(0x424A5998UL))
#define bM0P_CT7_PWC_TCR_T32                            *((volatile unsigned int*)(0x424A599CUL))
#define bM0P_CT7_PWC_TCR_EDGS0                          *((volatile unsigned int*)(0x424A59A0UL))
#define bM0P_CT7_PWC_TCR_EDGS1                          *((volatile unsigned int*)(0x424A59A4UL))
