tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_CT3_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A19A4UL))
#define bM0P_CT3_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A19B0UL))
#define bM0P_CT3_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A19B4UL))
#define bM0P_CT3_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A19B8UL))
#define bM0P_CT3_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A1A00UL))
#define bM0P_CT3_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A1A08UL))
#define bM0P_CT3_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A1A10UL))
#define bM0P_CT3_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A1A18UL))
#define bM0P_CT3_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A1A20UL))
#define bM0P_CT3_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A1A3CUL))
#define bM0P_CT4_RT_TCR_START                           *((volatile unsigned int*)(0x424A4180UL))
#define bM0P_CT4_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A4184UL))
#define bM0P_CT4_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A4188UL))
#define bM0P_CT4_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A418CUL))
#define bM0P_CT4_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A4190UL))
#define bM0P_CT4_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A4194UL))
#define bM0P_CT4_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A4198UL))
#define bM0P_CT4_RT_TCR_T32                             *((volatile unsigned int*)(0x424A419CUL))
#define bM0P_CT4_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A41A0UL))
#define bM0P_CT4_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A41A4UL))
#define bM0P_CT4_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A41B0UL))
#define bM0P_CT4_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A41B4UL))
#define bM0P_CT4_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A41B8UL))
#define bM0P_CT4_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A4200UL))
#define bM0P_CT4_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A4208UL))
#define bM0P_CT4_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A4210UL))
#define bM0P_CT4_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A4218UL))
#define bM0P_CT4_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A4220UL))
#define bM0P_CT4_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A423CUL))
#define bM0P_CT5_RT_TCR_START                           *((volatile unsigned int*)(0x424A4980UL))
#define bM0P_CT5_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A4984UL))
#define bM0P_CT5_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A4988UL))
#define bM0P_CT5_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A498CUL))
#define bM0P_CT5_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A4990UL))
#define bM0P_CT5_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A4994UL))
#define bM0P_CT5_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A4998UL))
#define bM0P_CT5_RT_TCR_T32                             *((volatile unsigned int*)(0x424A499CUL))
#define bM0P_CT5_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A49A0UL))
#define bM0P_CT5_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A49A4UL))
#define bM0P_CT5_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A49B0UL))
#define bM0P_CT5_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A49B4UL))
#define bM0P_CT5_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A49B8UL))
#define bM0P_CT5_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A4A00UL))
#define bM0P_CT5_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A4A08UL))
#define bM0P_CT5_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A4A10UL))
#define bM0P_CT5_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A4A18UL))
#define bM0P_CT5_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A4A20UL))
#define bM0P_CT5_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A4A3CUL))
#define bM0P_CT6_RT_TCR_START                           *((volatile unsigned int*)(0x424A5180UL))
#define bM0P_CT6_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A5184UL))
#define bM0P_CT6_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A5188UL))
#define bM0P_CT6_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A518CUL))
#define bM0P_CT6_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A5190UL))
#define bM0P_CT6_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A5194UL))
#define bM0P_CT6_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A5198UL))
#define bM0P_CT6_RT_TCR_T32                             *((volatile unsigned int*)(0x424A519CUL))
#define bM0P_CT6_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A51A0UL))
#define bM0P_CT6_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A51A4UL))
#define bM0P_CT6_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A51B0UL))
#define bM0P_CT6_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A51B4UL))
#define bM0P_CT6_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A51B8UL))
#define bM0P_CT6_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A5200UL))
#define bM0P_CT6_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A5208UL))
#define bM0P_CT6_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A5210UL))
#define bM0P_CT6_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A5218UL))
#define bM0P_CT6_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A5220UL))
#define bM0P_CT6_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A523CUL))
#define bM0P_CT7_RT_TCR_START                           *((volatile unsigned int*)(0x424A5980UL))
#define bM0P_CT7_RT_TCR_ENCNT                           *((volatile unsigned int*)(0x424A5984UL))
#define bM0P_CT7_RT_TCR_MODS                            *((volatile unsigned int*)(0x424A5988UL))
#define bM0P_CT7_RT_TCR_PLRT                            *((volatile unsigned int*)(0x424A598CUL))
#define bM0P_CT7_RT_TCR_FUNC0                           *((volatile unsigned int*)(0x424A5990UL))
#define bM0P_CT7_RT_TCR_FUNC1                           *((volatile unsigned int*)(0x424A5994UL))
#define bM0P_CT7_RT_TCR_FUNC2                           *((volatile unsigned int*)(0x424A5998UL))
#define bM0P_CT7_RT_TCR_T32                             *((volatile unsigned int*)(0x424A599CUL))
#define bM0P_CT7_RT_TCR_EDGS0                           *((volatile unsigned int*)(0x424A59A0UL))
#define bM0P_CT7_RT_TCR_EDGS1                           *((volatile unsigned int*)(0x424A59A4UL))
#define bM0P_CT7_RT_TCR_CLKS0                           *((volatile unsigned int*)(0x424A59B0UL))
#define bM0P_CT7_RT_TCR_CLKS1                           *((volatile unsigned int*)(0x424A59B4UL))
#define bM0P_CT7_RT_TCR_CLKS2                           *((volatile unsigned int*)(0x424A59B8UL))
#define bM0P_CT7_RT_STA_UDFIR                           *((volatile unsigned int*)(0x424A5A00UL))
#define bM0P_CT7_RT_STA_TRGIR                           *((volatile unsigned int*)(0x424A5A08UL))
#define bM0P_CT7_RT_STA_UDFIE                           *((volatile unsigned int*)(0x424A5A10UL))
#define bM0P_CT7_RT_STA_TRGIE                           *((volatile unsigned int*)(0x424A5A18UL))
#define bM0P_CT7_RT_TCR2_CLKS3                          *((volatile unsigned int*)(0x424A5A20UL))
#define bM0P_CT7_RT_TCR2_GTIE                           *((volatile unsigned int*)(0x424A5A3CUL))
#define bM0P_DTIM1_TIMERCTRL_ONESHOT                    *((volatile unsigned int*)(0x422A0100UL))
#define bM0P_DTIM1_TIMERCTRL_TMRSIZE                    *((volatile unsigned int*)(0x422A0104UL))
#define bM0P_DTIM1_TIMERCTRL_TMRPRE0                    *((volatile unsigned int*)(0x422A0108UL))
#define bM0P_DTIM1_TIMERCTRL_TMRPRE1                    *((volatile unsigned int*)(0x422A010CUL))
#define bM0P_DTIM1_TIMERCTRL_INTEN                      *((volatile unsigned int*)(0x422A0114UL))
#define bM0P_DTIM1_TIMERCTRL_TMRMODE                    *((volatile unsigned int*)(0x422A0118UL))
#define bM0P_DTIM1_TIMERCTRL_TMREN                      *((volatile unsigned int*)(0x422A011CUL))
#define bM0P_DTIM1_TIMERRIS_TMRINTST                    *((volatile unsigned int*)(0x422A0200UL))
#define bM0P_DTIM1_TIMERMIS_TMRMINTST                   *((volatile unsigned int*)(0x422A0280UL))
#define bM0P_DTIM2_TIMERCTRL_ONESHOT                    *((volatile unsigned int*)(0x422A0500UL))
#define bM0P_DTIM2_TIMERCTRL_TMRSIZE                    *((volatile unsigned int*)(0x422A0504UL))
#define bM0P_DTIM2_TIMERCTRL_TMRPRE0                    *((volatile unsigned int*)(0x422A0508UL))
#define bM0P_DTIM2_TIMERCTRL_TMRPRE1                    *((volatile unsigned int*)(0x422A050CUL))
#define bM0P_DTIM2_TIMERCTRL_INTEN                      *((volatile unsigned int*)(0x422A0514UL))
#define bM0P_DTIM2_TIMERCTRL_TMRMODE                    *((volatile unsigned int*)(0x422A0518UL))
#define bM0P_DTIM2_TIMERCTRL_TMREN                      *((volatile unsigned int*)(0x422A051CUL))
#define bM0P_DTIM2_TIMERRIS_TMRINTST                    *((volatile unsigned int*)(0x422A0600UL))
#define bM0P_DTIM2_TIMERMIS_TMRMINTST                   *((volatile unsigned int*)(0x422A0680UL))
#define bM0P_EXTINT_INTEN_EN0                           *((volatile unsigned int*)(0x42600000UL))
#define bM0P_EXTINT_INTEN_EN1                           *((volatile unsigned int*)(0x42600004UL))
#define bM0P_EXTINT_INTEN_EN2                           *((volatile unsigned int*)(0x42600008UL))
#define bM0P_EXTINT_INTEN_EN3                           *((volatile unsigned int*)(0x4260000CUL))
#define bM0P_EXTINT_INTEN_EN4                           *((volatile unsigned int*)(0x42600010UL))
#define bM0P_EXTINT_INTEN_EN5                           *((volatile unsigned int*)(0x42600014UL))
#define bM0P_EXTINT_INTEN_EN6                           *((volatile unsigned int*)(0x42600018UL))
#define bM0P_EXTINT_INTEN_EN7                           *((volatile unsigned int*)(0x4260001CUL))
#define bM0P_EXTINT_INTEN_EN8                           *((volatile unsigned int*)(0x42600020UL))
#define bM0P_EXTINT_INTEN_EN9                           *((volatile unsigned int*)(0x42600024UL))
#define bM0P_EXTINT_INTEN_EN10                          *((volatile unsigned int*)(0x42600028UL))
#define bM0P_EXTINT_INTEN_EN11                          *((volatile unsigned int*)(0x4260002CUL))
#define bM0P_EXTINT_INTEN_EN12                          *((volatile unsigned int*)(0x42600030UL))
#define bM0P_EXTINT_INTEN_EN13                          *((volatile unsigned int*)(0x42600034UL))
#define bM0P_EXTINT_INTEN_EN14                          *((volatile unsigned int*)(0x42600038UL))
#define bM0P_EXTINT_INTEN_EN15                          *((volatile unsigned int*)(0x4260003CUL))
#define bM0P_EXTINT_INTSRC_SRC0                         *((volatile unsigned int*)(0x42600080UL))
#define bM0P_EXTINT_INTSRC_SRC1                         *((volatile unsigned int*)(0x42600084UL))
#define bM0P_EXTINT_INTSRC_SRC2                         *((volatile unsigned int*)(0x42600088UL))
#define bM0P_EXTINT_INTSRC_SRC3                         *((volatile unsigned int*)(0x4260008CUL))
#define bM0P_EXTINT_INTSRC_SRC4                         *((volatile unsigned int*)(0x42600090UL))
#define bM0P_EXTINT_INTSRC_SRC5                         *((volatile unsigned int*)(0x42600094UL))
#define bM0P_EXTINT_INTSRC_SRC6                         *((volatile unsigned int*)(0x42600098UL))
#define bM0P_EXTINT_INTSRC_SRC7                         *((volatile unsigned int*)(0x4260009CUL))
#define bM0P_EXTINT_INTSRC_SRC8                         *((volatile unsigned int*)(0x426000A0UL))
#define bM0P_EXTINT_INTSRC_SRC9                         *((volatile unsigned int*)(0x426000A4UL))
#define bM0P_EXTINT_INTSRC_SRC10                        *((volatile unsigned int*)(0x426000A8UL))
#define bM0P_EXTINT_INTSRC_SRC11                        *((volatile unsigned int*)(0x426000ACUL))
#define bM0P_EXTINT_INTSRC_SRC12                        *((volatile unsigned int*)(0x426000B0UL))
#define bM0P_EXTINT_INTSRC_SRC13                        *((volatile unsigned int*)(0x426000B4UL))
#define bM0P_EXTINT_INTSRC_SRC14                        *((volatile unsigned int*)(0x426000B8UL))
#define bM0P_EXTINT_INTSRC_SRC15                        *((volatile unsigned int*)(0x426000BCUL))
#define bM0P_EXTINT_INTCLR_CLR0                         *((volatile unsigned int*)(0x42600100UL))
#define bM0P_EXTINT_INTCLR_CLR1                         *((volatile unsigned int*)(0x42600104UL))
#define bM0P_EXTINT_INTCLR_CLR2                         *((volatile unsigned int*)(0x42600108UL))
#define bM0P_EXTINT_INTCLR_CLR3                         *((volatile unsigned int*)(0x4260010CUL))
#define bM0P_EXTINT_INTCLR_CLR4                         *((volatile unsigned int*)(0x42600110UL))
#define bM0P_EXTINT_INTCLR_CLR5                         *((volatile unsigned int*)(0x42600114UL))
#define bM0P_EXTINT_INTCLR_CLR6                         *((volatile unsigned int*)(0x42600118UL))
#define bM0P_EXTINT_INTCLR_CLR7                         *((volatile unsigned int*)(0x4260011CUL))
#define bM0P_EXTINT_INTCLR_CLR8                         *((volatile unsigned int*)(0x42600120UL))
#define bM0P_EXTINT_INTCLR_CLR9                         *((volatile unsigned int*)(0x42600124UL))
#define bM0P_EXTINT_INTCLR_CLR10                        *((volatile unsigned int*)(0x42600128UL))
#define bM0P_EXTINT_INTCLR_CLR11                        *((volatile unsigned int*)(0x4260012CUL))
#define bM0P_EXTINT_INTCLR_CLR12                        *((volatile unsigned int*)(0x42600130UL))
#define bM0P_EXTINT_INTCLR_CLR13                        *((volatile unsigned int*)(0x42600134UL))
#define bM0P_EXTINT_INTCLR_CLR14                        *((volatile unsigned int*)(0x42600138UL))
#define bM0P_EXTINT_INTCLR_CLR15                        *((volatile unsigned int*)(0x4260013CUL))
#define bM0P_EXTINT_INTLVL_LVLL0                        *((volatile unsigned int*)(0x42600180UL))
#define bM0P_EXTINT_INTLVL_LVLH0                        *((volatile unsigned int*)(0x42600184UL))
#define bM0P_EXTINT_INTLVL_LVLL1                        *((volatile unsigned int*)(0x42600188UL))
#define bM0P_EXTINT_INTLVL_LVLH1                        *((volatile unsigned int*)(0x4260018CUL))
#define bM0P_EXTINT_INTLVL_LVLL2                        *((volatile unsigned int*)(0x42600190UL))
#define bM0P_EXTINT_INTLVL_LVLH2                        *((volatile unsigned int*)(0x42600194UL))
#define bM0P_EXTINT_INTLVL_LVLL3                        *((volatile unsigned int*)(0x42600198UL))
#define bM0P_EXTINT_INTLVL_LVLH3                        *((volatile unsigned int*)(0x4260019CUL))
#define bM0P_EXTINT_INTLVL_LVLL4                        *((volatile unsigned int*)(0x426001A0UL))
#define bM0P_EXTINT_INTLVL_LVLH4                        *((volatile unsigned int*)(0x426001A4UL))
#define bM0P_EXTINT_INTLVL_LVLL5                        *((volatile unsigned int*)(0x426001A8UL))
#define bM0P_EXTINT_INTLVL_LVLH5                        *((volatile unsigned int*)(0x426001ACUL))
#define bM0P_EXTINT_INTLVL_LVLL6                        *((volatile unsigned int*)(0x426001B0UL))
#define bM0P_EXTINT_INTLVL_LVLH6                        *((volatile unsigned int*)(0x426001B4UL))
#define bM0P_EXTINT_INTLVL_LVLL7                        *((volatile unsigned int*)(0x426001B8UL))
#define bM0P_EXTINT_INTLVL_LVLH7                        *((volatile unsigned int*)(0x426001BCUL))
#define bM0P_EXTINT_INTLVL_LVLL8                        *((volatile unsigned int*)(0x426001C0UL))
#define bM0P_EXTINT_INTLVL_LVLH8                        *((volatile unsigned int*)(0x426001C4UL))
#define bM0P_EXTINT_INTLVL_LVLL9                        *((volatile unsigned int*)(0x426001C8UL))
#define bM0P_EXTINT_INTLVL_LVLH9                        *((volatile unsigned int*)(0x426001CCUL))
#define bM0P_EXTINT_INTLVL_LVLL10                       *((volatile unsigned int*)(0x426001D0UL))
#define bM0P_EXTINT_INTLVL_LVLH10                       *((volatile unsigned int*)(0x426001D4UL))
#define bM0P_EXTINT_INTLVL_LVLL11                       *((volatile unsigned int*)(0x426001D8UL))
#define bM0P_EXTINT_INTLVL_LVLH11                       *((volatile unsigned int*)(0x426001DCUL))
#define bM0P_EXTINT_INTLVL_LVLL12                       *((volatile unsigned int*)(0x426001E0UL))
#define bM0P_EXTINT_INTLVL_LVLH12                       *((volatile unsigned int*)(0x426001E4UL))
#define bM0P_EXTINT_INTLVL_LVLL13                       *((volatile unsigned int*)(0x426001E8UL))
#define bM0P_EXTINT_INTLVL_LVLH13                       *((volatile unsigned int*)(0x426001ECUL))
#define bM0P_EXTINT_INTLVL_LVLL14                       *((volatile unsigned int*)(0x426001F0UL))
#define bM0P_EXTINT_INTLVL_LVLH14                       *((volatile unsigned int*)(0x426001F4UL))
#define bM0P_EXTINT_INTLVL_LVLL15                       *((volatile unsigned int*)(0x426001F8UL))
#define bM0P_EXTINT_INTLVL_LVLH15                       *((volatile unsigned int*)(0x426001FCUL))
#define bM0P_EXTINT_NMISRC_SRC                          *((volatile unsigned int*)(0x42600280UL))
#define bM0P_EXTINT_NMICLR_CLR                          *((volatile unsigned int*)(0x42600300UL))
#define bM0P_FLASH_FOCR_PRGM                            *((volatile unsigned int*)(0x42000000UL))
#define bM0P_FLASH_FOCR_PERS                            *((volatile unsigned int*)(0x42000004UL))
#define bM0P_FLASH_FOCR_CERS                            *((volatile unsigned int*)(0x42000008UL))
#define bM0P_FLASH_FOCR_DPSTB                           *((volatile unsigned int*)(0x4200000CUL))
#define bM0P_FLASH_FOCR_FRWPW0                          *((volatile unsigned int*)(0x42000040UL))
#define bM0P_FLASH_FOCR_FRWPW1                          *((volatile unsigned int*)(0x42000044UL))
#define bM0P_FLASH_FOCR_FRWPW2                          *((volatile unsigned int*)(0x42000048UL))
#define bM0P_FLASH_FOCR_FRWPW3                          *((volatile unsigned int*)(0x4200004CUL))
#define bM0P_FLASH_FOCR_FRWPW4                          *((volatile unsigned int*)(0x42000050UL))
#define bM0P_FLASH_FOCR_FRWPW5                          *((volatile unsigned int*)(0x42000054UL))
#define bM0P_FLASH_FOCR_FRWPW6                          *((volatile unsigned int*)(0x42000058UL))
#define bM0P_FLASH_FOCR_FRWPW7                          *((volatile unsigned int*)(0x4200005CUL))
#define bM0P_FLASH_FOCR_FRWPW8                          *((volatile unsigned int*)(0x42000060UL))
#define bM0P_FLASH_FOCR_FRWPW9                          *((volatile unsigned int*)(0x42000064UL))
#define bM0P_FLASH_FOCR_FRWPW10                         *((volatile unsigned int*)(0x42000068UL))
#define bM0P_FLASH_FOCR_FRWPW11                         *((volatile unsigned int*)(0x4200006CUL))
#define bM0P_FLASH_FOCR_FRWPW12                         *((volatile unsigned int*)(0x42000070UL))
#define bM0P_FLASH_FOCR_FRWPW13                         *((volatile unsigned int*)(0x42000074UL))
#define bM0P_FLASH_FOCR_FRWPW14                         *((volatile unsigned int*)(0x42000078UL))
#define bM0P_FLASH_FOCR_FRWPW15                         *((volatile unsigned int*)(0x4200007CUL))
#define bM0P_FLASH_FLCR0_LOCK2K0                        *((volatile unsigned int*)(0x42000080UL))
#define bM0P_FLASH_FLCR0_LOCK2K1                        *((volatile unsigned int*)(0x42000084UL))
#define bM0P_FLASH_FLCR0_LOCK2K2                        *((volatile unsigned int*)(0x42000088UL))
#define bM0P_FLASH_FLCR0_LOCK2K3                        *((volatile unsigned int*)(0x4200008CUL))
#define bM0P_FLASH_FLCR0_LOCK2K4                        *((volatile unsigned int*)(0x42000090UL))
#define bM0P_FLASH_FLCR0_LOCK2K5                        *((volatile unsigned int*)(0x42000094UL))
#define bM0P_FLASH_FLCR0_LOCK2K6                        *((volatile unsigned int*)(0x42000098UL))
#define bM0P_FLASH_FLCR0_LOCK2K7                        *((volatile unsigned int*)(0x4200009CUL))
#define bM0P_FLASH_FLCR0_LOCK2K8                        *((volatile unsigned int*)(0x420000A0UL))
#define bM0P_FLASH_FLCR0_LOCK2K9                        *((volatile unsigned int*)(0x420000A4UL))
#define bM0P_FLASH_FLCR0_LOCK2K10                       *((volatile unsigned int*)(0x420000A8UL))
#define bM0P_FLASH_FLCR0_LOCK2K11                       *((volatile unsigned int*)(0x420000ACUL))
#define bM0P_FLASH_FLCR0_LOCK2K12                       *((volatile unsigned int*)(0x420000B0UL))
#define bM0P_FLASH_FLCR0_LOCK2K13                       *((volatile unsigned int*)(0x420000B4UL))
#define bM0P_FLASH_FLCR0_LOCK2K14                       *((volatile unsigned int*)(0x420000B8UL))
#define bM0P_FLASH_FLCR0_LOCK2K15                       *((volatile unsigned int*)(0x420000BCUL))
#define bM0P_FLASH_FLCR0_LOCK2K16                       *((volatile unsigned int*)(0x420000C0UL))
#define bM0P_FLASH_FLCR0_LOCK2K17                       *((volatile unsigned int*)(0x420000C4UL))
#define bM0P_FLASH_FLCR0_LOCK2K18                       *((volatile unsigned int*)(0x420000C8UL))
#define bM0P_FLASH_FLCR0_LOCK2K19                       *((volatile unsigned int*)(0x420000CCUL))
#define bM0P_FLASH_FLCR0_LOCK2K20                       *((volatile unsigned int*)(0x420000D0UL))
#define bM0P_FLASH_FLCR0_LOCK2K21                       *((volatile unsigned int*)(0x420000D4UL))
#define bM0P_FLASH_FLCR0_LOCK2K22                       *((volatile unsigned int*)(0x420000D8UL))
#define bM0P_FLASH_FLCR0_LOCK2K23                       *((volatile unsigned int*)(0x420000DCUL))
#define bM0P_FLASH_FLCR0_LOCK2K24                       *((volatile unsigned int*)(0x420000E0UL))
#define bM0P_FLASH_FLCR0_LOCK2K25                       *((volatile unsigned int*)(0x420000E4UL))
#define bM0P_FLASH_FLCR0_LOCK2K26                       *((volatile unsigned int*)(0x420000E8UL))
#define bM0P_FLASH_FLCR0_LOCK2K27                       *((volatile unsigned int*)(0x420000ECUL))
#define bM0P_FLASH_FLCR0_LOCK2K28                       *((volatile unsigned int*)(0x420000F0UL))
#define bM0P_FLASH_FLCR0_LOCK2K29                       *((volatile unsigned int*)(0x420000F4UL))
#define bM0P_FLASH_FLCR0_LOCK2K30                       *((volatile unsigned int*)(0x420000F8UL))
#define bM0P_FLASH_FLCR0_LOCK2K31                       *((volatile unsigned int*)(0x420000FCUL))
#define bM0P_FLASH_FLCR1_LOCK2K0                        *((volatile unsigned int*)(0x42000100UL))
#define bM0P_FLASH_FLCR1_LOCK2K1                        *((volatile unsigned int*)(0x42000104UL))
#define bM0P_FLASH_FLCR1_LOCK2K2                        *((volatile unsigned int*)(0x42000108UL))
#define bM0P_FLASH_FLCR1_LOCK2K3                        *((volatile unsigned int*)(0x4200010CUL))
#define bM0P_FLASH_FLCR1_LOCK2K4                        *((volatile unsigned int*)(0x42000110UL))
#define bM0P_FLASH_FLCR1_LOCK2K5                        *((volatile unsigned int*)(0x42000114UL))
