tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_FLASH_FLCR1_LOCK2K6                        *((volatile unsigned int*)(0x42000118UL))
#define bM0P_FLASH_FLCR1_LOCK2K7                        *((volatile unsigned int*)(0x4200011CUL))
#define bM0P_FLASH_FLCR1_LOCK2K8                        *((volatile unsigned int*)(0x42000120UL))
#define bM0P_FLASH_FLCR1_LOCK2K9                        *((volatile unsigned int*)(0x42000124UL))
#define bM0P_FLASH_FLCR1_LOCK2K10                       *((volatile unsigned int*)(0x42000128UL))
#define bM0P_FLASH_FLCR1_LOCK2K11                       *((volatile unsigned int*)(0x4200012CUL))
#define bM0P_FLASH_FLCR1_LOCK2K12                       *((volatile unsigned int*)(0x42000130UL))
#define bM0P_FLASH_FLCR1_LOCK2K13                       *((volatile unsigned int*)(0x42000134UL))
#define bM0P_FLASH_FLCR1_LOCK2K14                       *((volatile unsigned int*)(0x42000138UL))
#define bM0P_FLASH_FLCR1_LOCK2K15                       *((volatile unsigned int*)(0x4200013CUL))
#define bM0P_FLASH_FLCR1_LOCK2K16                       *((volatile unsigned int*)(0x42000140UL))
#define bM0P_FLASH_FLCR1_LOCK2K17                       *((volatile unsigned int*)(0x42000144UL))
#define bM0P_FLASH_FLCR1_LOCK2K18                       *((volatile unsigned int*)(0x42000148UL))
#define bM0P_FLASH_FLCR1_LOCK2K19                       *((volatile unsigned int*)(0x4200014CUL))
#define bM0P_FLASH_FLCR1_LOCK2K20                       *((volatile unsigned int*)(0x42000150UL))
#define bM0P_FLASH_FLCR1_LOCK2K21                       *((volatile unsigned int*)(0x42000154UL))
#define bM0P_FLASH_FLCR1_LOCK2K22                       *((volatile unsigned int*)(0x42000158UL))
#define bM0P_FLASH_FLCR1_LOCK2K23                       *((volatile unsigned int*)(0x4200015CUL))
#define bM0P_FLASH_FLCR1_LOCK2K24                       *((volatile unsigned int*)(0x42000160UL))
#define bM0P_FLASH_FLCR1_LOCK2K25                       *((volatile unsigned int*)(0x42000164UL))
#define bM0P_FLASH_FLCR1_LOCK2K26                       *((volatile unsigned int*)(0x42000168UL))
#define bM0P_FLASH_FLCR1_LOCK2K27                       *((volatile unsigned int*)(0x4200016CUL))
#define bM0P_FLASH_FLCR1_LOCK2K28                       *((volatile unsigned int*)(0x42000170UL))
#define bM0P_FLASH_FLCR1_LOCK2K29                       *((volatile unsigned int*)(0x42000174UL))
#define bM0P_FLASH_FLCR1_LOCK2K30                       *((volatile unsigned int*)(0x42000178UL))
#define bM0P_FLASH_FLCR1_LOCK2K31                       *((volatile unsigned int*)(0x4200017CUL))
#define bM0P_FLASH_FSTR_BUSY                            *((volatile unsigned int*)(0x42000180UL))
#define bM0P_FLASH_FSTR_KEYVIO                          *((volatile unsigned int*)(0x42000184UL))
#define bM0P_FLASH_FSTR_ACCVIO                          *((volatile unsigned int*)(0x42000188UL))
#define bM0P_FLASH_FSTR_ERR                             *((volatile unsigned int*)(0x4200018CUL))
#define bM0P_FLASH_FSTR_OPVIO                           *((volatile unsigned int*)(0x42000190UL))
#define bM0P_FLASH_FSTR_CFM                             *((volatile unsigned int*)(0x42000194UL))
#define bM0P_FLASH_FSTR_FRWPW0                          *((volatile unsigned int*)(0x420001C0UL))
#define bM0P_FLASH_FSTR_FRWPW1                          *((volatile unsigned int*)(0x420001C4UL))
#define bM0P_FLASH_FSTR_FRWPW2                          *((volatile unsigned int*)(0x420001C8UL))
#define bM0P_FLASH_FSTR_FRWPW3                          *((volatile unsigned int*)(0x420001CCUL))
#define bM0P_FLASH_FSTR_FRWPW4                          *((volatile unsigned int*)(0x420001D0UL))
#define bM0P_FLASH_FSTR_FRWPW5                          *((volatile unsigned int*)(0x420001D4UL))
#define bM0P_FLASH_FSTR_FRWPW6                          *((volatile unsigned int*)(0x420001D8UL))
#define bM0P_FLASH_FSTR_FRWPW7                          *((volatile unsigned int*)(0x420001DCUL))
#define bM0P_FLASH_FSTR_FRWPW8                          *((volatile unsigned int*)(0x420001E0UL))
#define bM0P_FLASH_FSTR_FRWPW9                          *((volatile unsigned int*)(0x420001E4UL))
#define bM0P_FLASH_FSTR_FRWPW10                         *((volatile unsigned int*)(0x420001E8UL))
#define bM0P_FLASH_FSTR_FRWPW11                         *((volatile unsigned int*)(0x420001ECUL))
#define bM0P_FLASH_FSTR_FRWPW12                         *((volatile unsigned int*)(0x420001F0UL))
#define bM0P_FLASH_FSTR_FRWPW13                         *((volatile unsigned int*)(0x420001F4UL))
#define bM0P_FLASH_FSTR_FRWPW14                         *((volatile unsigned int*)(0x420001F8UL))
#define bM0P_FLASH_FSTR_FRWPW15                         *((volatile unsigned int*)(0x420001FCUL))
#define bM0P_FLASH_FWCICR_FIE                           *((volatile unsigned int*)(0x42000200UL))
#define bM0P_FLASH_FWCICR_FWTC0                         *((volatile unsigned int*)(0x42000210UL))
#define bM0P_FLASH_FWCICR_FWTC1                         *((volatile unsigned int*)(0x42000214UL))
#define bM0P_FLASH_FUDR0_UD00                           *((volatile unsigned int*)(0x42000280UL))
#define bM0P_FLASH_FUDR0_UD01                           *((volatile unsigned int*)(0x42000284UL))
#define bM0P_FLASH_FUDR0_UD02                           *((volatile unsigned int*)(0x42000288UL))
#define bM0P_FLASH_FUDR0_UD03                           *((volatile unsigned int*)(0x4200028CUL))
#define bM0P_FLASH_FUDR0_UD04                           *((volatile unsigned int*)(0x42000290UL))
#define bM0P_FLASH_FUDR0_UD05                           *((volatile unsigned int*)(0x42000294UL))
#define bM0P_FLASH_FUDR0_UD06                           *((volatile unsigned int*)(0x42000298UL))
#define bM0P_FLASH_FUDR0_UD07                           *((volatile unsigned int*)(0x4200029CUL))
#define bM0P_FLASH_FUDR0_UD08                           *((volatile unsigned int*)(0x420002A0UL))
#define bM0P_FLASH_FUDR0_UD09                           *((volatile unsigned int*)(0x420002A4UL))
#define bM0P_FLASH_FUDR0_UD010                          *((volatile unsigned int*)(0x420002A8UL))
#define bM0P_FLASH_FUDR0_UD011                          *((volatile unsigned int*)(0x420002ACUL))
#define bM0P_FLASH_FUDR0_UD012                          *((volatile unsigned int*)(0x420002B0UL))
#define bM0P_FLASH_FUDR0_UD013                          *((volatile unsigned int*)(0x420002B4UL))
#define bM0P_FLASH_FUDR0_UD014                          *((volatile unsigned int*)(0x420002B8UL))
#define bM0P_FLASH_FUDR0_UD015                          *((volatile unsigned int*)(0x420002BCUL))
#define bM0P_FLASH_FUDR0_UD016                          *((volatile unsigned int*)(0x420002C0UL))
#define bM0P_FLASH_FUDR0_UD017                          *((volatile unsigned int*)(0x420002C4UL))
#define bM0P_FLASH_FUDR0_UD018                          *((volatile unsigned int*)(0x420002C8UL))
#define bM0P_FLASH_FUDR0_UD019                          *((volatile unsigned int*)(0x420002CCUL))
#define bM0P_FLASH_FUDR0_UD020                          *((volatile unsigned int*)(0x420002D0UL))
#define bM0P_FLASH_FUDR0_UD021                          *((volatile unsigned int*)(0x420002D4UL))
#define bM0P_FLASH_FUDR0_UD022                          *((volatile unsigned int*)(0x420002D8UL))
#define bM0P_FLASH_FUDR0_UD023                          *((volatile unsigned int*)(0x420002DCUL))
#define bM0P_FLASH_FUDR0_UD024                          *((volatile unsigned int*)(0x420002E0UL))
#define bM0P_FLASH_FUDR0_UD025                          *((volatile unsigned int*)(0x420002E4UL))
#define bM0P_FLASH_FUDR0_UD026                          *((volatile unsigned int*)(0x420002E8UL))
#define bM0P_FLASH_FUDR0_UD027                          *((volatile unsigned int*)(0x420002ECUL))
#define bM0P_FLASH_FUDR0_UD028                          *((volatile unsigned int*)(0x420002F0UL))
#define bM0P_FLASH_FUDR0_UD029                          *((volatile unsigned int*)(0x420002F4UL))
#define bM0P_FLASH_FUDR0_UD030                          *((volatile unsigned int*)(0x420002F8UL))
#define bM0P_FLASH_FUDR0_UD031                          *((volatile unsigned int*)(0x420002FCUL))
#define bM0P_FLASH_FUDR1_UD10                           *((volatile unsigned int*)(0x42000300UL))
#define bM0P_FLASH_FUDR1_UD11                           *((volatile unsigned int*)(0x42000304UL))
#define bM0P_FLASH_FUDR1_UD12                           *((volatile unsigned int*)(0x42000308UL))
#define bM0P_FLASH_FUDR1_UD13                           *((volatile unsigned int*)(0x4200030CUL))
#define bM0P_FLASH_FUDR1_UD14                           *((volatile unsigned int*)(0x42000310UL))
#define bM0P_FLASH_FUDR1_UD15                           *((volatile unsigned int*)(0x42000314UL))
#define bM0P_FLASH_FUDR1_UD16                           *((volatile unsigned int*)(0x42000318UL))
#define bM0P_FLASH_FUDR1_UD17                           *((volatile unsigned int*)(0x4200031CUL))
#define bM0P_FLASH_FUDR1_UD18                           *((volatile unsigned int*)(0x42000320UL))
#define bM0P_FLASH_FUDR1_UD19                           *((volatile unsigned int*)(0x42000324UL))
#define bM0P_FLASH_FUDR1_UD110                          *((volatile unsigned int*)(0x42000328UL))
#define bM0P_FLASH_FUDR1_UD111                          *((volatile unsigned int*)(0x4200032CUL))
#define bM0P_FLASH_FUDR1_UD112                          *((volatile unsigned int*)(0x42000330UL))
#define bM0P_FLASH_FUDR1_UD113                          *((volatile unsigned int*)(0x42000334UL))
#define bM0P_FLASH_FUDR1_UD114                          *((volatile unsigned int*)(0x42000338UL))
#define bM0P_FLASH_FUDR1_UD115                          *((volatile unsigned int*)(0x4200033CUL))
#define bM0P_FLASH_FUDR1_UD116                          *((volatile unsigned int*)(0x42000340UL))
#define bM0P_FLASH_FUDR1_UD117                          *((volatile unsigned int*)(0x42000344UL))
#define bM0P_FLASH_FUDR1_UD118                          *((volatile unsigned int*)(0x42000348UL))
#define bM0P_FLASH_FUDR1_UD119                          *((volatile unsigned int*)(0x4200034CUL))
#define bM0P_FLASH_FUDR1_UD120                          *((volatile unsigned int*)(0x42000350UL))
#define bM0P_FLASH_FUDR1_UD121                          *((volatile unsigned int*)(0x42000354UL))
#define bM0P_FLASH_FUDR1_UD122                          *((volatile unsigned int*)(0x42000358UL))
#define bM0P_FLASH_FUDR1_UD123                          *((volatile unsigned int*)(0x4200035CUL))
#define bM0P_FLASH_FUDR1_UD124                          *((volatile unsigned int*)(0x42000360UL))
#define bM0P_FLASH_FUDR1_UD125                          *((volatile unsigned int*)(0x42000364UL))
#define bM0P_FLASH_FUDR1_UD126                          *((volatile unsigned int*)(0x42000368UL))
#define bM0P_FLASH_FUDR1_UD127                          *((volatile unsigned int*)(0x4200036CUL))
#define bM0P_FLASH_FUDR1_UD128                          *((volatile unsigned int*)(0x42000370UL))
#define bM0P_FLASH_FUDR1_UD129                          *((volatile unsigned int*)(0x42000374UL))
#define bM0P_FLASH_FUDR1_UD130                          *((volatile unsigned int*)(0x42000378UL))
#define bM0P_FLASH_FUDR1_UD131                          *((volatile unsigned int*)(0x4200037CUL))
#define bM0P_FLASH_FUDR2_UD20                           *((volatile unsigned int*)(0x42000380UL))
#define bM0P_FLASH_FUDR2_UD21                           *((volatile unsigned int*)(0x42000384UL))
#define bM0P_FLASH_FUDR2_UD22                           *((volatile unsigned int*)(0x42000388UL))
#define bM0P_FLASH_FUDR2_UD23                           *((volatile unsigned int*)(0x4200038CUL))
#define bM0P_FLASH_FUDR2_UD24                           *((volatile unsigned int*)(0x42000390UL))
#define bM0P_FLASH_FUDR2_UD25                           *((volatile unsigned int*)(0x42000394UL))
#define bM0P_FLASH_FUDR2_UD26                           *((volatile unsigned int*)(0x42000398UL))
#define bM0P_FLASH_FUDR2_UD27                           *((volatile unsigned int*)(0x4200039CUL))
#define bM0P_FLASH_FUDR2_UD28                           *((volatile unsigned int*)(0x420003A0UL))
#define bM0P_FLASH_FUDR2_UD29                           *((volatile unsigned int*)(0x420003A4UL))
#define bM0P_FLASH_FUDR2_UD210                          *((volatile unsigned int*)(0x420003A8UL))
#define bM0P_FLASH_FUDR2_UD211                          *((volatile unsigned int*)(0x420003ACUL))
#define bM0P_FLASH_FUDR2_UD212                          *((volatile unsigned int*)(0x420003B0UL))
#define bM0P_FLASH_FUDR2_UD213                          *((volatile unsigned int*)(0x420003B4UL))
#define bM0P_FLASH_FUDR2_UD214                          *((volatile unsigned int*)(0x420003B8UL))
#define bM0P_FLASH_FUDR2_UD215                          *((volatile unsigned int*)(0x420003BCUL))
#define bM0P_FLASH_FUDR2_UD216                          *((volatile unsigned int*)(0x420003C0UL))
#define bM0P_FLASH_FUDR2_UD217                          *((volatile unsigned int*)(0x420003C4UL))
#define bM0P_FLASH_FUDR2_UD218                          *((volatile unsigned int*)(0x420003C8UL))
#define bM0P_FLASH_FUDR2_UD219                          *((volatile unsigned int*)(0x420003CCUL))
#define bM0P_FLASH_FUDR2_UD220                          *((volatile unsigned int*)(0x420003D0UL))
#define bM0P_FLASH_FUDR2_UD221                          *((volatile unsigned int*)(0x420003D4UL))
#define bM0P_FLASH_FUDR2_UD222                          *((volatile unsigned int*)(0x420003D8UL))
#define bM0P_FLASH_FUDR2_UD223                          *((volatile unsigned int*)(0x420003DCUL))
#define bM0P_FLASH_FUDR2_UD224                          *((volatile unsigned int*)(0x420003E0UL))
#define bM0P_FLASH_FUDR2_UD225                          *((volatile unsigned int*)(0x420003E4UL))
#define bM0P_FLASH_FUDR2_UD226                          *((volatile unsigned int*)(0x420003E8UL))
#define bM0P_FLASH_FUDR2_UD227                          *((volatile unsigned int*)(0x420003ECUL))
#define bM0P_FLASH_FUDR2_UD228                          *((volatile unsigned int*)(0x420003F0UL))
#define bM0P_FLASH_FUDR2_UD229                          *((volatile unsigned int*)(0x420003F4UL))
#define bM0P_FLASH_FUDR2_UD230                          *((volatile unsigned int*)(0x420003F8UL))
#define bM0P_FLASH_FUDR2_UD231                          *((volatile unsigned int*)(0x420003FCUL))
#define bM0P_FLASH_FUDR3_UD30                           *((volatile unsigned int*)(0x42000400UL))
#define bM0P_FLASH_FUDR3_UD31                           *((volatile unsigned int*)(0x42000404UL))
#define bM0P_FLASH_FUDR3_UD32                           *((volatile unsigned int*)(0x42000408UL))
#define bM0P_FLASH_FUDR3_UD33                           *((volatile unsigned int*)(0x4200040CUL))
#define bM0P_FLASH_FUDR3_UD34                           *((volatile unsigned int*)(0x42000410UL))
#define bM0P_FLASH_FUDR3_UD35                           *((volatile unsigned int*)(0x42000414UL))
#define bM0P_FLASH_FUDR3_UD36                           *((volatile unsigned int*)(0x42000418UL))
#define bM0P_FLASH_FUDR3_UD37                           *((volatile unsigned int*)(0x4200041CUL))
#define bM0P_FLASH_FUDR3_UD38                           *((volatile unsigned int*)(0x42000420UL))
#define bM0P_FLASH_FUDR3_UD39                           *((volatile unsigned int*)(0x42000424UL))
#define bM0P_FLASH_FUDR3_UD310                          *((volatile unsigned int*)(0x42000428UL))
#define bM0P_FLASH_FUDR3_UD311                          *((volatile unsigned int*)(0x4200042CUL))
#define bM0P_FLASH_FUDR3_UD312                          *((volatile unsigned int*)(0x42000430UL))
#define bM0P_FLASH_FUDR3_UD313                          *((volatile unsigned int*)(0x42000434UL))
#define bM0P_FLASH_FUDR3_UD314                          *((volatile unsigned int*)(0x42000438UL))
#define bM0P_FLASH_FUDR3_UD315                          *((volatile unsigned int*)(0x4200043CUL))
#define bM0P_FLASH_FUDR3_UD316                          *((volatile unsigned int*)(0x42000440UL))
#define bM0P_FLASH_FUDR3_UD317                          *((volatile unsigned int*)(0x42000444UL))
#define bM0P_FLASH_FUDR3_UD318                          *((volatile unsigned int*)(0x42000448UL))
#define bM0P_FLASH_FUDR3_UD319                          *((volatile unsigned int*)(0x4200044CUL))
#define bM0P_FLASH_FUDR3_UD320                          *((volatile unsigned int*)(0x42000450UL))
#define bM0P_FLASH_FUDR3_UD321                          *((volatile unsigned int*)(0x42000454UL))
#define bM0P_FLASH_FUDR3_UD322                          *((volatile unsigned int*)(0x42000458UL))
#define bM0P_FLASH_FUDR3_UD323                          *((volatile unsigned int*)(0x4200045CUL))
#define bM0P_FLASH_FUDR3_UD324                          *((volatile unsigned int*)(0x42000460UL))
#define bM0P_FLASH_FUDR3_UD325                          *((volatile unsigned int*)(0x42000464UL))
#define bM0P_FLASH_FUDR3_UD326                          *((volatile unsigned int*)(0x42000468UL))
#define bM0P_FLASH_FUDR3_UD327                          *((volatile unsigned int*)(0x4200046CUL))
#define bM0P_FLASH_FUDR3_UD328                          *((volatile unsigned int*)(0x42000470UL))
#define bM0P_FLASH_FUDR3_UD329                          *((volatile unsigned int*)(0x42000474UL))
#define bM0P_FLASH_FUDR3_UD330                          *((volatile unsigned int*)(0x42000478UL))
#define bM0P_FLASH_FUDR3_UD331                          *((volatile unsigned int*)(0x4200047CUL))
#define bM0P_FLASH_TNVS_TNVS0                           *((volatile unsigned int*)(0x42000480UL))
#define bM0P_FLASH_TNVS_TNVS1                           *((volatile unsigned int*)(0x42000484UL))
#define bM0P_FLASH_TNVS_TNVS2                           *((volatile unsigned int*)(0x42000488UL))
#define bM0P_FLASH_TNVS_TNVS3                           *((volatile unsigned int*)(0x4200048CUL))
#define bM0P_FLASH_TNVS_TNVS4                           *((volatile unsigned int*)(0x42000490UL))
#define bM0P_FLASH_TNVS_TNVS5                           *((volatile unsigned int*)(0x42000494UL))
#define bM0P_FLASH_TNVS_TNVS6                           *((volatile unsigned int*)(0x42000498UL))
#define bM0P_FLASH_TNVS_TNVS7                           *((volatile unsigned int*)(0x4200049CUL))
#define bM0P_FLASH_TPROG_TPROG0                         *((volatile unsigned int*)(0x42000500UL))
#define bM0P_FLASH_TPROG_TPROG1                         *((volatile unsigned int*)(0x42000504UL))
#define bM0P_FLASH_TPROG_TPROG2                         *((volatile unsigned int*)(0x42000508UL))
#define bM0P_FLASH_TPROG_TPROG3                         *((volatile unsigned int*)(0x4200050CUL))
#define bM0P_FLASH_TPROG_TPROG4                         *((volatile unsigned int*)(0x42000510UL))
#define bM0P_FLASH_TPROG_TPROG5                         *((volatile unsigned int*)(0x42000514UL))
#define bM0P_FLASH_TPROG_TPROG6                         *((volatile unsigned int*)(0x42000518UL))
#define bM0P_FLASH_TPROG_TPROG7                         *((volatile unsigned int*)(0x4200051CUL))
#define bM0P_FLASH_TPGS_TPGS0                           *((volatile unsigned int*)(0x42000580UL))
#define bM0P_FLASH_TPGS_TPGS1                           *((volatile unsigned int*)(0x42000584UL))
#define bM0P_FLASH_TPGS_TPGS2                           *((volatile unsigned int*)(0x42000588UL))
#define bM0P_FLASH_TPGS_TPGS3                           *((volatile unsigned int*)(0x4200058CUL))
#define bM0P_FLASH_TPGS_TPGS4                           *((volatile unsigned int*)(0x42000590UL))
#define bM0P_FLASH_TPGS_TPGS5                           *((volatile unsigned int*)(0x42000594UL))
#define bM0P_FLASH_TPGS_TPGS6                           *((volatile unsigned int*)(0x42000598UL))
#define bM0P_FLASH_TPGS_TPGS7                           *((volatile unsigned int*)(0x4200059CUL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM0                     *((volatile unsigned int*)(0x42000600UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM1                     *((volatile unsigned int*)(0x42000604UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM2                     *((volatile unsigned int*)(0x42000608UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM3                     *((volatile unsigned int*)(0x4200060CUL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM4                     *((volatile unsigned int*)(0x42000610UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM5                     *((volatile unsigned int*)(0x42000614UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM6                     *((volatile unsigned int*)(0x42000618UL))
#define bM0P_FLASH_TRCVPGM_TRCVPGM7                     *((volatile unsigned int*)(0x4200061CUL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS0                   *((volatile unsigned int*)(0x42000680UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS1                   *((volatile unsigned int*)(0x42000684UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS2                   *((volatile unsigned int*)(0x42000688UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS3                   *((volatile unsigned int*)(0x4200068CUL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS4                   *((volatile unsigned int*)(0x42000690UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS5                   *((volatile unsigned int*)(0x42000694UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS6                   *((volatile unsigned int*)(0x42000698UL))
#define bM0P_FLASH_TRCVPERS_TRCVPERS7                   *((volatile unsigned int*)(0x4200069CUL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS0                   *((volatile unsigned int*)(0x42000700UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS1                   *((volatile unsigned int*)(0x42000704UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS2                   *((volatile unsigned int*)(0x42000708UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS3                   *((volatile unsigned int*)(0x4200070CUL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS4                   *((volatile unsigned int*)(0x42000710UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS5                   *((volatile unsigned int*)(0x42000714UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS6                   *((volatile unsigned int*)(0x42000718UL))
#define bM0P_FLASH_TRCVCERS_TRCVCERS7                   *((volatile unsigned int*)(0x4200071CUL))
#define bM0P_FLASH_TPERS_TPERS0                         *((volatile unsigned int*)(0x42000780UL))
#define bM0P_FLASH_TPERS_TPERS1                         *((volatile unsigned int*)(0x42000784UL))
#define bM0P_FLASH_TPERS_TPERS2                         *((volatile unsigned int*)(0x42000788UL))
#define bM0P_FLASH_TPERS_TPERS3                         *((volatile unsigned int*)(0x4200078CUL))
#define bM0P_FLASH_TPERS_TPERS4                         *((volatile unsigned int*)(0x42000790UL))
#define bM0P_FLASH_TPERS_TPERS5                         *((volatile unsigned int*)(0x42000794UL))
#define bM0P_FLASH_TPERS_TPERS6                         *((volatile unsigned int*)(0x42000798UL))
#define bM0P_FLASH_TPERS_TPERS7                         *((volatile unsigned int*)(0x4200079CUL))
#define bM0P_FLASH_TCERS_TCERS0                         *((volatile unsigned int*)(0x42000800UL))
#define bM0P_FLASH_TCERS_TCERS1                         *((volatile unsigned int*)(0x42000804UL))
#define bM0P_FLASH_TCERS_TCERS2                         *((volatile unsigned int*)(0x42000808UL))
#define bM0P_FLASH_TCERS_TCERS3                         *((volatile unsigned int*)(0x4200080CUL))
#define bM0P_FLASH_TCERS_TCERS4                         *((volatile unsigned int*)(0x42000810UL))
#define bM0P_FLASH_TCERS_TCERS5                         *((volatile unsigned int*)(0x42000814UL))
#define bM0P_FLASH_TCERS_TCERS6                         *((volatile unsigned int*)(0x42000818UL))
#define bM0P_FLASH_TCERS_TCERS7                         *((volatile unsigned int*)(0x4200081CUL))
#define bM0P_GPIO_FN0_P00                               *((volatile unsigned int*)(0x42660000UL))
