tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_GPIO_FN0_P01                               *((volatile unsigned int*)(0x42660004UL))
#define bM0P_GPIO_FN0_P02                               *((volatile unsigned int*)(0x42660008UL))
#define bM0P_GPIO_FN0_P03                               *((volatile unsigned int*)(0x4266000CUL))
#define bM0P_GPIO_FN0_P04                               *((volatile unsigned int*)(0x42660010UL))
#define bM0P_GPIO_FN0_P05                               *((volatile unsigned int*)(0x42660014UL))
#define bM0P_GPIO_FN0_P06                               *((volatile unsigned int*)(0x42660018UL))
#define bM0P_GPIO_FN0_P07                               *((volatile unsigned int*)(0x4266001CUL))
#define bM0P_GPIO_FN1_P10                               *((volatile unsigned int*)(0x42660080UL))
#define bM0P_GPIO_FN1_P11                               *((volatile unsigned int*)(0x42660084UL))
#define bM0P_GPIO_FN1_P12                               *((volatile unsigned int*)(0x42660088UL))
#define bM0P_GPIO_FN1_P13                               *((volatile unsigned int*)(0x4266008CUL))
#define bM0P_GPIO_FN1_P14                               *((volatile unsigned int*)(0x42660090UL))
#define bM0P_GPIO_FN1_P15                               *((volatile unsigned int*)(0x42660094UL))
#define bM0P_GPIO_FN1_P16                               *((volatile unsigned int*)(0x42660098UL))
#define bM0P_GPIO_FN1_P17                               *((volatile unsigned int*)(0x4266009CUL))
#define bM0P_GPIO_FN2_P20                               *((volatile unsigned int*)(0x42660100UL))
#define bM0P_GPIO_FN2_P21                               *((volatile unsigned int*)(0x42660104UL))
#define bM0P_GPIO_FN2_P22                               *((volatile unsigned int*)(0x42660108UL))
#define bM0P_GPIO_FN2_P23                               *((volatile unsigned int*)(0x4266010CUL))
#define bM0P_GPIO_FN2_P24                               *((volatile unsigned int*)(0x42660110UL))
#define bM0P_GPIO_FN2_P25                               *((volatile unsigned int*)(0x42660114UL))
#define bM0P_GPIO_FN2_P26                               *((volatile unsigned int*)(0x42660118UL))
#define bM0P_GPIO_FN2_P27                               *((volatile unsigned int*)(0x4266011CUL))
#define bM0P_GPIO_FN3_P30                               *((volatile unsigned int*)(0x42660180UL))
#define bM0P_GPIO_FN3_P31                               *((volatile unsigned int*)(0x42660184UL))
#define bM0P_GPIO_FN3_P34                               *((volatile unsigned int*)(0x42660190UL))
#define bM0P_GPIO_FN3_P35                               *((volatile unsigned int*)(0x42660194UL))
#define bM0P_GPIO_FN3_P36                               *((volatile unsigned int*)(0x42660198UL))
#define bM0P_GPIO_FN3_P37                               *((volatile unsigned int*)(0x4266019CUL))
#define bM0P_GPIO_FN4_P40                               *((volatile unsigned int*)(0x42660200UL))
#define bM0P_GPIO_FN4_P41                               *((volatile unsigned int*)(0x42660204UL))
#define bM0P_GPIO_FN4_P45                               *((volatile unsigned int*)(0x42660214UL))
#define bM0P_GPIO_FN4_P46                               *((volatile unsigned int*)(0x42660218UL))
#define bM0P_GPIO_FN4_P47                               *((volatile unsigned int*)(0x4266021CUL))
#define bM0P_GPIO_FN5_P50                               *((volatile unsigned int*)(0x42660280UL))
#define bM0P_GPIO_FN5_P51                               *((volatile unsigned int*)(0x42660284UL))
#define bM0P_GPIO_FN5_P52                               *((volatile unsigned int*)(0x42660288UL))
#define bM0P_GPIO_FN5_P53                               *((volatile unsigned int*)(0x4266028CUL))
#define bM0P_GPIO_FN5_P54                               *((volatile unsigned int*)(0x42660290UL))
#define bM0P_GPIO_FN5_P55                               *((volatile unsigned int*)(0x42660294UL))
#define bM0P_GPIO_FN5_P56                               *((volatile unsigned int*)(0x42660298UL))
#define bM0P_GPIO_FN5_P57                               *((volatile unsigned int*)(0x4266029CUL))
#define bM0P_GPIO_FN6_P60                               *((volatile unsigned int*)(0x42660300UL))
#define bM0P_GPIO_FN6_P61                               *((volatile unsigned int*)(0x42660304UL))
#define bM0P_GPIO_FN6_P62                               *((volatile unsigned int*)(0x42660308UL))
#define bM0P_GPIO_FN6_P63                               *((volatile unsigned int*)(0x4266030CUL))
#define bM0P_GPIO_FN6_P64                               *((volatile unsigned int*)(0x42660310UL))
#define bM0P_GPIO_FN6_P65                               *((volatile unsigned int*)(0x42660314UL))
#define bM0P_GPIO_FN6_P66                               *((volatile unsigned int*)(0x42660318UL))
#define bM0P_GPIO_FN6_P67                               *((volatile unsigned int*)(0x4266031CUL))
#define bM0P_GPIO_FN7_P70                               *((volatile unsigned int*)(0x42660380UL))
#define bM0P_GPIO_FN7_P71                               *((volatile unsigned int*)(0x42660384UL))
#define bM0P_GPIO_FN7_P72                               *((volatile unsigned int*)(0x42660388UL))
#define bM0P_GPIO_FN7_P73                               *((volatile unsigned int*)(0x4266038CUL))
#define bM0P_GPIO_FN7_P74                               *((volatile unsigned int*)(0x42660390UL))
#define bM0P_GPIO_FN8_P80                               *((volatile unsigned int*)(0x42660400UL))
#define bM0P_GPIO_PU0_P00                               *((volatile unsigned int*)(0x42662000UL))
#define bM0P_GPIO_PU0_P01                               *((volatile unsigned int*)(0x42662004UL))
#define bM0P_GPIO_PU0_P02                               *((volatile unsigned int*)(0x42662008UL))
#define bM0P_GPIO_PU0_P03                               *((volatile unsigned int*)(0x4266200CUL))
#define bM0P_GPIO_PU0_P04                               *((volatile unsigned int*)(0x42662010UL))
#define bM0P_GPIO_PU0_P05                               *((volatile unsigned int*)(0x42662014UL))
#define bM0P_GPIO_PU0_P06                               *((volatile unsigned int*)(0x42662018UL))
#define bM0P_GPIO_PU0_P07                               *((volatile unsigned int*)(0x4266201CUL))
#define bM0P_GPIO_PU1_P10                               *((volatile unsigned int*)(0x42662080UL))
#define bM0P_GPIO_PU1_P11                               *((volatile unsigned int*)(0x42662084UL))
#define bM0P_GPIO_PU1_P12                               *((volatile unsigned int*)(0x42662088UL))
#define bM0P_GPIO_PU1_P13                               *((volatile unsigned int*)(0x4266208CUL))
#define bM0P_GPIO_PU1_P14                               *((volatile unsigned int*)(0x42662090UL))
#define bM0P_GPIO_PU1_P15                               *((volatile unsigned int*)(0x42662094UL))
#define bM0P_GPIO_PU1_P16                               *((volatile unsigned int*)(0x42662098UL))
#define bM0P_GPIO_PU1_P17                               *((volatile unsigned int*)(0x4266209CUL))
#define bM0P_GPIO_PU2_P20                               *((volatile unsigned int*)(0x42662100UL))
#define bM0P_GPIO_PU2_P21                               *((volatile unsigned int*)(0x42662104UL))
#define bM0P_GPIO_PU2_P22                               *((volatile unsigned int*)(0x42662108UL))
#define bM0P_GPIO_PU2_P23                               *((volatile unsigned int*)(0x4266210CUL))
#define bM0P_GPIO_PU2_P24                               *((volatile unsigned int*)(0x42662110UL))
#define bM0P_GPIO_PU2_P25                               *((volatile unsigned int*)(0x42662114UL))
#define bM0P_GPIO_PU2_P26                               *((volatile unsigned int*)(0x42662118UL))
#define bM0P_GPIO_PU2_P27                               *((volatile unsigned int*)(0x4266211CUL))
#define bM0P_GPIO_PU3_P30                               *((volatile unsigned int*)(0x42662180UL))
#define bM0P_GPIO_PU3_P31                               *((volatile unsigned int*)(0x42662184UL))
#define bM0P_GPIO_PU3_P34                               *((volatile unsigned int*)(0x42662190UL))
#define bM0P_GPIO_PU3_P35                               *((volatile unsigned int*)(0x42662194UL))
#define bM0P_GPIO_PU3_P36                               *((volatile unsigned int*)(0x42662198UL))
#define bM0P_GPIO_PU3_P37                               *((volatile unsigned int*)(0x4266219CUL))
#define bM0P_GPIO_PU4_P40                               *((volatile unsigned int*)(0x42662200UL))
#define bM0P_GPIO_PU4_P41                               *((volatile unsigned int*)(0x42662204UL))
#define bM0P_GPIO_PU4_P45                               *((volatile unsigned int*)(0x42662214UL))
#define bM0P_GPIO_PU4_P46                               *((volatile unsigned int*)(0x42662218UL))
#define bM0P_GPIO_PU4_P47                               *((volatile unsigned int*)(0x4266221CUL))
#define bM0P_GPIO_PU5_P50                               *((volatile unsigned int*)(0x42662280UL))
#define bM0P_GPIO_PU5_P51                               *((volatile unsigned int*)(0x42662284UL))
#define bM0P_GPIO_PU5_P52                               *((volatile unsigned int*)(0x42662288UL))
#define bM0P_GPIO_PU5_P53                               *((volatile unsigned int*)(0x4266228CUL))
#define bM0P_GPIO_PU5_P54                               *((volatile unsigned int*)(0x42662290UL))
#define bM0P_GPIO_PU5_P55                               *((volatile unsigned int*)(0x42662294UL))
#define bM0P_GPIO_PU5_P56                               *((volatile unsigned int*)(0x42662298UL))
#define bM0P_GPIO_PU5_P57                               *((volatile unsigned int*)(0x4266229CUL))
#define bM0P_GPIO_PU6_P60                               *((volatile unsigned int*)(0x42662300UL))
#define bM0P_GPIO_PU6_P61                               *((volatile unsigned int*)(0x42662304UL))
#define bM0P_GPIO_PU6_P62                               *((volatile unsigned int*)(0x42662308UL))
#define bM0P_GPIO_PU6_P63                               *((volatile unsigned int*)(0x4266230CUL))
#define bM0P_GPIO_PU6_P64                               *((volatile unsigned int*)(0x42662310UL))
#define bM0P_GPIO_PU6_P65                               *((volatile unsigned int*)(0x42662314UL))
#define bM0P_GPIO_PU6_P66                               *((volatile unsigned int*)(0x42662318UL))
#define bM0P_GPIO_PU6_P67                               *((volatile unsigned int*)(0x4266231CUL))
#define bM0P_GPIO_PU7_P70                               *((volatile unsigned int*)(0x42662380UL))
#define bM0P_GPIO_PU7_P71                               *((volatile unsigned int*)(0x42662384UL))
#define bM0P_GPIO_PU7_P72                               *((volatile unsigned int*)(0x42662388UL))
#define bM0P_GPIO_PU7_P73                               *((volatile unsigned int*)(0x4266238CUL))
#define bM0P_GPIO_PU7_P74                               *((volatile unsigned int*)(0x42662390UL))
#define bM0P_GPIO_PU8_P80                               *((volatile unsigned int*)(0x42662400UL))
#define bM0P_GPIO_DIR0_P00                              *((volatile unsigned int*)(0x42664000UL))
#define bM0P_GPIO_DIR0_P01                              *((volatile unsigned int*)(0x42664004UL))
#define bM0P_GPIO_DIR0_P02                              *((volatile unsigned int*)(0x42664008UL))
#define bM0P_GPIO_DIR0_P03                              *((volatile unsigned int*)(0x4266400CUL))
#define bM0P_GPIO_DIR0_P04                              *((volatile unsigned int*)(0x42664010UL))
#define bM0P_GPIO_DIR0_P05                              *((volatile unsigned int*)(0x42664014UL))
#define bM0P_GPIO_DIR0_P06                              *((volatile unsigned int*)(0x42664018UL))
#define bM0P_GPIO_DIR0_P07                              *((volatile unsigned int*)(0x4266401CUL))
#define bM0P_GPIO_DIR1_P10                              *((volatile unsigned int*)(0x42664080UL))
#define bM0P_GPIO_DIR1_P11                              *((volatile unsigned int*)(0x42664084UL))
#define bM0P_GPIO_DIR1_P12                              *((volatile unsigned int*)(0x42664088UL))
#define bM0P_GPIO_DIR1_P13                              *((volatile unsigned int*)(0x4266408CUL))
#define bM0P_GPIO_DIR1_P14                              *((volatile unsigned int*)(0x42664090UL))
#define bM0P_GPIO_DIR1_P15                              *((volatile unsigned int*)(0x42664094UL))
#define bM0P_GPIO_DIR1_P16                              *((volatile unsigned int*)(0x42664098UL))
#define bM0P_GPIO_DIR1_P17                              *((volatile unsigned int*)(0x4266409CUL))
#define bM0P_GPIO_DIR2_P20                              *((volatile unsigned int*)(0x42664100UL))
#define bM0P_GPIO_DIR2_P21                              *((volatile unsigned int*)(0x42664104UL))
#define bM0P_GPIO_DIR2_P22                              *((volatile unsigned int*)(0x42664108UL))
#define bM0P_GPIO_DIR2_P23                              *((volatile unsigned int*)(0x4266410CUL))
#define bM0P_GPIO_DIR2_P24                              *((volatile unsigned int*)(0x42664110UL))
#define bM0P_GPIO_DIR2_P25                              *((volatile unsigned int*)(0x42664114UL))
#define bM0P_GPIO_DIR2_P26                              *((volatile unsigned int*)(0x42664118UL))
#define bM0P_GPIO_DIR2_P27                              *((volatile unsigned int*)(0x4266411CUL))
#define bM0P_GPIO_DIR3_P30                              *((volatile unsigned int*)(0x42664180UL))
#define bM0P_GPIO_DIR3_P31                              *((volatile unsigned int*)(0x42664184UL))
#define bM0P_GPIO_DIR3_P34                              *((volatile unsigned int*)(0x42664190UL))
#define bM0P_GPIO_DIR3_P35                              *((volatile unsigned int*)(0x42664194UL))
#define bM0P_GPIO_DIR3_P36                              *((volatile unsigned int*)(0x42664198UL))
#define bM0P_GPIO_DIR3_P37                              *((volatile unsigned int*)(0x4266419CUL))
#define bM0P_GPIO_DIR4_P40                              *((volatile unsigned int*)(0x42664200UL))
#define bM0P_GPIO_DIR4_P41                              *((volatile unsigned int*)(0x42664204UL))
#define bM0P_GPIO_DIR4_P45                              *((volatile unsigned int*)(0x42664214UL))
#define bM0P_GPIO_DIR4_P46                              *((volatile unsigned int*)(0x42664218UL))
#define bM0P_GPIO_DIR4_P47                              *((volatile unsigned int*)(0x4266421CUL))
#define bM0P_GPIO_DIR5_P50                              *((volatile unsigned int*)(0x42664280UL))
#define bM0P_GPIO_DIR5_P51                              *((volatile unsigned int*)(0x42664284UL))
#define bM0P_GPIO_DIR5_P52                              *((volatile unsigned int*)(0x42664288UL))
#define bM0P_GPIO_DIR5_P53                              *((volatile unsigned int*)(0x4266428CUL))
#define bM0P_GPIO_DIR5_P54                              *((volatile unsigned int*)(0x42664290UL))
#define bM0P_GPIO_DIR5_P55                              *((volatile unsigned int*)(0x42664294UL))
#define bM0P_GPIO_DIR5_P56                              *((volatile unsigned int*)(0x42664298UL))
#define bM0P_GPIO_DIR5_P57                              *((volatile unsigned int*)(0x4266429CUL))
#define bM0P_GPIO_DIR6_P60                              *((volatile unsigned int*)(0x42664300UL))
#define bM0P_GPIO_DIR6_P61                              *((volatile unsigned int*)(0x42664304UL))
#define bM0P_GPIO_DIR6_P62                              *((volatile unsigned int*)(0x42664308UL))
#define bM0P_GPIO_DIR6_P63                              *((volatile unsigned int*)(0x4266430CUL))
#define bM0P_GPIO_DIR6_P64                              *((volatile unsigned int*)(0x42664310UL))
#define bM0P_GPIO_DIR6_P65                              *((volatile unsigned int*)(0x42664314UL))
#define bM0P_GPIO_DIR6_P66                              *((volatile unsigned int*)(0x42664318UL))
#define bM0P_GPIO_DIR6_P67                              *((volatile unsigned int*)(0x4266431CUL))
#define bM0P_GPIO_DIR7_P70                              *((volatile unsigned int*)(0x42664380UL))
#define bM0P_GPIO_DIR7_P71                              *((volatile unsigned int*)(0x42664384UL))
#define bM0P_GPIO_DIR7_P72                              *((volatile unsigned int*)(0x42664388UL))
#define bM0P_GPIO_DIR7_P73                              *((volatile unsigned int*)(0x4266438CUL))
#define bM0P_GPIO_DIR7_P74                              *((volatile unsigned int*)(0x42664390UL))
#define bM0P_GPIO_DIR8_P80                              *((volatile unsigned int*)(0x42664400UL))
#define bM0P_GPIO_GET0_P00                              *((volatile unsigned int*)(0x42666000UL))
#define bM0P_GPIO_GET0_P01                              *((volatile unsigned int*)(0x42666004UL))
#define bM0P_GPIO_GET0_P02                              *((volatile unsigned int*)(0x42666008UL))
#define bM0P_GPIO_GET0_P03                              *((volatile unsigned int*)(0x4266600CUL))
#define bM0P_GPIO_GET0_P04                              *((volatile unsigned int*)(0x42666010UL))
#define bM0P_GPIO_GET0_P05                              *((volatile unsigned int*)(0x42666014UL))
#define bM0P_GPIO_GET0_P06                              *((volatile unsigned int*)(0x42666018UL))
#define bM0P_GPIO_GET0_P07                              *((volatile unsigned int*)(0x4266601CUL))
#define bM0P_GPIO_GET1_P10                              *((volatile unsigned int*)(0x42666080UL))
#define bM0P_GPIO_GET1_P11                              *((volatile unsigned int*)(0x42666084UL))
#define bM0P_GPIO_GET1_P12                              *((volatile unsigned int*)(0x42666088UL))
#define bM0P_GPIO_GET1_P13                              *((volatile unsigned int*)(0x4266608CUL))
#define bM0P_GPIO_GET1_P14                              *((volatile unsigned int*)(0x42666090UL))
#define bM0P_GPIO_GET1_P15                              *((volatile unsigned int*)(0x42666094UL))
#define bM0P_GPIO_GET1_P16                              *((volatile unsigned int*)(0x42666098UL))
#define bM0P_GPIO_GET1_P17                              *((volatile unsigned int*)(0x4266609CUL))
#define bM0P_GPIO_GET2_P20                              *((volatile unsigned int*)(0x42666100UL))
#define bM0P_GPIO_GET2_P21                              *((volatile unsigned int*)(0x42666104UL))
#define bM0P_GPIO_GET2_P22                              *((volatile unsigned int*)(0x42666108UL))
#define bM0P_GPIO_GET2_P23                              *((volatile unsigned int*)(0x4266610CUL))
#define bM0P_GPIO_GET2_P24                              *((volatile unsigned int*)(0x42666110UL))
#define bM0P_GPIO_GET2_P25                              *((volatile unsigned int*)(0x42666114UL))
#define bM0P_GPIO_GET2_P26                              *((volatile unsigned int*)(0x42666118UL))
#define bM0P_GPIO_GET2_P27                              *((volatile unsigned int*)(0x4266611CUL))
#define bM0P_GPIO_GET3_P30                              *((volatile unsigned int*)(0x42666180UL))
#define bM0P_GPIO_GET3_P31                              *((volatile unsigned int*)(0x42666184UL))
#define bM0P_GPIO_GET3_P34                              *((volatile unsigned int*)(0x42666190UL))
#define bM0P_GPIO_GET3_P35                              *((volatile unsigned int*)(0x42666194UL))
#define bM0P_GPIO_GET3_P36                              *((volatile unsigned int*)(0x42666198UL))
#define bM0P_GPIO_GET3_P37                              *((volatile unsigned int*)(0x4266619CUL))
#define bM0P_GPIO_GET4_P40                              *((volatile unsigned int*)(0x42666200UL))
#define bM0P_GPIO_GET4_P41                              *((volatile unsigned int*)(0x42666204UL))
#define bM0P_GPIO_GET4_P45                              *((volatile unsigned int*)(0x42666214UL))
#define bM0P_GPIO_GET4_P46                              *((volatile unsigned int*)(0x42666218UL))
#define bM0P_GPIO_GET4_P47                              *((volatile unsigned int*)(0x4266621CUL))
#define bM0P_GPIO_GET5_P50                              *((volatile unsigned int*)(0x42666280UL))
#define bM0P_GPIO_GET5_P51                              *((volatile unsigned int*)(0x42666284UL))
#define bM0P_GPIO_GET5_P52                              *((volatile unsigned int*)(0x42666288UL))
#define bM0P_GPIO_GET5_P53                              *((volatile unsigned int*)(0x4266628CUL))
#define bM0P_GPIO_GET5_P54                              *((volatile unsigned int*)(0x42666290UL))
#define bM0P_GPIO_GET5_P55                              *((volatile unsigned int*)(0x42666294UL))
#define bM0P_GPIO_GET5_P56                              *((volatile unsigned int*)(0x42666298UL))
#define bM0P_GPIO_GET5_P57                              *((volatile unsigned int*)(0x4266629CUL))
#define bM0P_GPIO_GET6_P60                              *((volatile unsigned int*)(0x42666300UL))
#define bM0P_GPIO_GET6_P61                              *((volatile unsigned int*)(0x42666304UL))
#define bM0P_GPIO_GET6_P62                              *((volatile unsigned int*)(0x42666308UL))
#define bM0P_GPIO_GET6_P63                              *((volatile unsigned int*)(0x4266630CUL))
#define bM0P_GPIO_GET6_P64                              *((volatile unsigned int*)(0x42666310UL))
#define bM0P_GPIO_GET6_P65                              *((volatile unsigned int*)(0x42666314UL))
#define bM0P_GPIO_GET6_P66                              *((volatile unsigned int*)(0x42666318UL))
#define bM0P_GPIO_GET6_P67                              *((volatile unsigned int*)(0x4266631CUL))
#define bM0P_GPIO_GET7_P70                              *((volatile unsigned int*)(0x42666380UL))
#define bM0P_GPIO_GET7_P71                              *((volatile unsigned int*)(0x42666384UL))
#define bM0P_GPIO_GET7_P72                              *((volatile unsigned int*)(0x42666388UL))
#define bM0P_GPIO_GET7_P73                              *((volatile unsigned int*)(0x4266638CUL))
#define bM0P_GPIO_GET7_P74                              *((volatile unsigned int*)(0x42666390UL))
#define bM0P_GPIO_GET8_P80                              *((volatile unsigned int*)(0x42666400UL))
#define bM0P_GPIO_SET0_P00                              *((volatile unsigned int*)(0x42668000UL))
#define bM0P_GPIO_SET0_P01                              *((volatile unsigned int*)(0x42668004UL))
#define bM0P_GPIO_SET0_P02                              *((volatile unsigned int*)(0x42668008UL))
#define bM0P_GPIO_SET0_P03                              *((volatile unsigned int*)(0x4266800CUL))
#define bM0P_GPIO_SET0_P04                              *((volatile unsigned int*)(0x42668010UL))
#define bM0P_GPIO_SET0_P05                              *((volatile unsigned int*)(0x42668014UL))
#define bM0P_GPIO_SET0_P06                              *((volatile unsigned int*)(0x42668018UL))
#define bM0P_GPIO_SET0_P07                              *((volatile unsigned int*)(0x4266801CUL))
#define bM0P_GPIO_SET1_P10                              *((volatile unsigned int*)(0x42668080UL))
#define bM0P_GPIO_SET1_P11                              *((volatile unsigned int*)(0x42668084UL))
#define bM0P_GPIO_SET1_P12                              *((volatile unsigned int*)(0x42668088UL))
#define bM0P_GPIO_SET1_P13                              *((volatile unsigned int*)(0x4266808CUL))
#define bM0P_GPIO_SET1_P14                              *((volatile unsigned int*)(0x42668090UL))
#define bM0P_GPIO_SET1_P15                              *((volatile unsigned int*)(0x42668094UL))
#define bM0P_GPIO_SET1_P16                              *((volatile unsigned int*)(0x42668098UL))
#define bM0P_GPIO_SET1_P17                              *((volatile unsigned int*)(0x4266809CUL))
#define bM0P_GPIO_SET2_P20                              *((volatile unsigned int*)(0x42668100UL))
