tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_GPIO_SET2_P21                              *((volatile unsigned int*)(0x42668104UL))
#define bM0P_GPIO_SET2_P22                              *((volatile unsigned int*)(0x42668108UL))
#define bM0P_GPIO_SET2_P23                              *((volatile unsigned int*)(0x4266810CUL))
#define bM0P_GPIO_SET2_P24                              *((volatile unsigned int*)(0x42668110UL))
#define bM0P_GPIO_SET2_P25                              *((volatile unsigned int*)(0x42668114UL))
#define bM0P_GPIO_SET2_P26                              *((volatile unsigned int*)(0x42668118UL))
#define bM0P_GPIO_SET2_P27                              *((volatile unsigned int*)(0x4266811CUL))
#define bM0P_GPIO_SET3_P30                              *((volatile unsigned int*)(0x42668180UL))
#define bM0P_GPIO_SET3_P31                              *((volatile unsigned int*)(0x42668184UL))
#define bM0P_GPIO_SET3_P34                              *((volatile unsigned int*)(0x42668190UL))
#define bM0P_GPIO_SET3_P35                              *((volatile unsigned int*)(0x42668194UL))
#define bM0P_GPIO_SET3_P36                              *((volatile unsigned int*)(0x42668198UL))
#define bM0P_GPIO_SET3_P37                              *((volatile unsigned int*)(0x4266819CUL))
#define bM0P_GPIO_SET4_P40                              *((volatile unsigned int*)(0x42668200UL))
#define bM0P_GPIO_SET4_P41                              *((volatile unsigned int*)(0x42668204UL))
#define bM0P_GPIO_SET4_P45                              *((volatile unsigned int*)(0x42668214UL))
#define bM0P_GPIO_SET4_P46                              *((volatile unsigned int*)(0x42668218UL))
#define bM0P_GPIO_SET4_P47                              *((volatile unsigned int*)(0x4266821CUL))
#define bM0P_GPIO_SET5_P50                              *((volatile unsigned int*)(0x42668280UL))
#define bM0P_GPIO_SET5_P51                              *((volatile unsigned int*)(0x42668284UL))
#define bM0P_GPIO_SET5_P52                              *((volatile unsigned int*)(0x42668288UL))
#define bM0P_GPIO_SET5_P53                              *((volatile unsigned int*)(0x4266828CUL))
#define bM0P_GPIO_SET5_P54                              *((volatile unsigned int*)(0x42668290UL))
#define bM0P_GPIO_SET5_P55                              *((volatile unsigned int*)(0x42668294UL))
#define bM0P_GPIO_SET5_P56                              *((volatile unsigned int*)(0x42668298UL))
#define bM0P_GPIO_SET5_P57                              *((volatile unsigned int*)(0x4266829CUL))
#define bM0P_GPIO_SET6_P60                              *((volatile unsigned int*)(0x42668300UL))
#define bM0P_GPIO_SET6_P61                              *((volatile unsigned int*)(0x42668304UL))
#define bM0P_GPIO_SET6_P62                              *((volatile unsigned int*)(0x42668308UL))
#define bM0P_GPIO_SET6_P63                              *((volatile unsigned int*)(0x4266830CUL))
#define bM0P_GPIO_SET6_P64                              *((volatile unsigned int*)(0x42668310UL))
#define bM0P_GPIO_SET6_P65                              *((volatile unsigned int*)(0x42668314UL))
#define bM0P_GPIO_SET6_P66                              *((volatile unsigned int*)(0x42668318UL))
#define bM0P_GPIO_SET6_P67                              *((volatile unsigned int*)(0x4266831CUL))
#define bM0P_GPIO_SET7_P70                              *((volatile unsigned int*)(0x42668380UL))
#define bM0P_GPIO_SET7_P71                              *((volatile unsigned int*)(0x42668384UL))
#define bM0P_GPIO_SET7_P72                              *((volatile unsigned int*)(0x42668388UL))
#define bM0P_GPIO_SET7_P73                              *((volatile unsigned int*)(0x4266838CUL))
#define bM0P_GPIO_SET7_P74                              *((volatile unsigned int*)(0x42668390UL))
#define bM0P_GPIO_SET8_P80                              *((volatile unsigned int*)(0x42668400UL))
#define bM0P_GPIO_ANALOG_ADE00                          *((volatile unsigned int*)(0x4266A000UL))
#define bM0P_GPIO_ANALOG_ADE01                          *((volatile unsigned int*)(0x4266A004UL))
#define bM0P_GPIO_ANALOG_ADE02                          *((volatile unsigned int*)(0x4266A008UL))
#define bM0P_GPIO_ANALOG_ADE03                          *((volatile unsigned int*)(0x4266A00CUL))
#define bM0P_GPIO_ANALOG_ADE04                          *((volatile unsigned int*)(0x4266A010UL))
#define bM0P_GPIO_ANALOG_ADE05                          *((volatile unsigned int*)(0x4266A014UL))
#define bM0P_GPIO_ANALOG_ADE06                          *((volatile unsigned int*)(0x4266A018UL))
#define bM0P_GPIO_ANALOG_ADE07                          *((volatile unsigned int*)(0x4266A01CUL))
#define bM0P_GPIO_ANALOG_ADE08                          *((volatile unsigned int*)(0x4266A020UL))
#define bM0P_GPIO_ANALOG_ADE09                          *((volatile unsigned int*)(0x4266A024UL))
#define bM0P_GPIO_ANALOG_ADE10                          *((volatile unsigned int*)(0x4266A028UL))
#define bM0P_GPIO_ANALOG_ADE11                          *((volatile unsigned int*)(0x4266A02CUL))
#define bM0P_GPIO_ANALOG_ADE12                          *((volatile unsigned int*)(0x4266A030UL))
#define bM0P_GPIO_ANALOG_ADE13                          *((volatile unsigned int*)(0x4266A034UL))
#define bM0P_GPIO_ANALOG_ADE14                          *((volatile unsigned int*)(0x4266A038UL))
#define bM0P_GPIO_ANALOG_ADE15                          *((volatile unsigned int*)(0x4266A03CUL))
#define bM0P_GPIO_SPS_SUBCS0                            *((volatile unsigned int*)(0x4266B000UL))
#define bM0P_GPIO_SPS_SUBCS1                            *((volatile unsigned int*)(0x4266B004UL))
#define bM0P_GPIO_SPS_MAINCS0                           *((volatile unsigned int*)(0x4266B008UL))
#define bM0P_GPIO_SPS_MAINCS1                           *((volatile unsigned int*)(0x4266B00CUL))
#define bM0P_GPIO_FN_SEL00_NMIS                         *((volatile unsigned int*)(0x4266C000UL))
#define bM0P_GPIO_FN_SEL00_CROUTE0                      *((volatile unsigned int*)(0x4266C004UL))
#define bM0P_GPIO_FN_SEL00_CROUTE1                      *((volatile unsigned int*)(0x4266C008UL))
#define bM0P_GPIO_FN_SEL00_RTCCOE0                      *((volatile unsigned int*)(0x4266C010UL))
#define bM0P_GPIO_FN_SEL00_RTCCOE1                      *((volatile unsigned int*)(0x4266C014UL))
#define bM0P_GPIO_FN_SEL00_SUBOUTE0                     *((volatile unsigned int*)(0x4266C018UL))
#define bM0P_GPIO_FN_SEL00_SUBOUTE1                     *((volatile unsigned int*)(0x4266C01CUL))
#define bM0P_GPIO_FN_SEL00_SWDEN                        *((volatile unsigned int*)(0x4266C020UL))
#define bM0P_GPIO_FN_SEL02_TIOA0E0                      *((volatile unsigned int*)(0x4266C108UL))
#define bM0P_GPIO_FN_SEL02_TIOA0E1                      *((volatile unsigned int*)(0x4266C10CUL))
#define bM0P_GPIO_FN_SEL02_TIOB0S0                      *((volatile unsigned int*)(0x4266C110UL))
#define bM0P_GPIO_FN_SEL02_TIOB0S1                      *((volatile unsigned int*)(0x4266C114UL))
#define bM0P_GPIO_FN_SEL02_TIOB0S2                      *((volatile unsigned int*)(0x4266C118UL))
#define bM0P_GPIO_FN_SEL02_TIOA1S0                      *((volatile unsigned int*)(0x4266C120UL))
#define bM0P_GPIO_FN_SEL02_TIOA1S1                      *((volatile unsigned int*)(0x4266C124UL))
#define bM0P_GPIO_FN_SEL02_TIOA1E0                      *((volatile unsigned int*)(0x4266C128UL))
#define bM0P_GPIO_FN_SEL02_TIOA1E1                      *((volatile unsigned int*)(0x4266C12CUL))
#define bM0P_GPIO_FN_SEL02_TIOB1S0                      *((volatile unsigned int*)(0x4266C130UL))
#define bM0P_GPIO_FN_SEL02_TIOB1S1                      *((volatile unsigned int*)(0x4266C134UL))
#define bM0P_GPIO_FN_SEL02_TIOA2E0                      *((volatile unsigned int*)(0x4266C148UL))
#define bM0P_GPIO_FN_SEL02_TIOA2E1                      *((volatile unsigned int*)(0x4266C14CUL))
#define bM0P_GPIO_FN_SEL02_TIOB2S0                      *((volatile unsigned int*)(0x4266C150UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S1                      *((volatile unsigned int*)(0x4266C154UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S2                      *((volatile unsigned int*)(0x4266C158UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S0                      *((volatile unsigned int*)(0x4266C160UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S1                      *((volatile unsigned int*)(0x4266C164UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E0                      *((volatile unsigned int*)(0x4266C168UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E1                      *((volatile unsigned int*)(0x4266C16CUL))
#define bM0P_GPIO_FN_SEL02_TIOB3S0                      *((volatile unsigned int*)(0x4266C170UL))
#define bM0P_GPIO_FN_SEL02_TIOB3S1                      *((volatile unsigned int*)(0x4266C174UL))
#define bM0P_GPIO_FN_SEL03_TIOA4E0                      *((volatile unsigned int*)(0x4266C188UL))
#define bM0P_GPIO_FN_SEL03_TIOA4E1                      *((volatile unsigned int*)(0x4266C18CUL))
#define bM0P_GPIO_FN_SEL03_TIOB4S0                      *((volatile unsigned int*)(0x4266C190UL))
#define bM0P_GPIO_FN_SEL03_TIOB4S1                      *((volatile unsigned int*)(0x4266C194UL))
#define bM0P_GPIO_FN_SEL03_TIOA5S0                      *((volatile unsigned int*)(0x4266C1A0UL))
#define bM0P_GPIO_FN_SEL03_TIOA5S1                      *((volatile unsigned int*)(0x4266C1A4UL))
#define bM0P_GPIO_FN_SEL03_TIOA5E0                      *((volatile unsigned int*)(0x4266C1A8UL))
#define bM0P_GPIO_FN_SEL03_TIOA5E1                      *((volatile unsigned int*)(0x4266C1ACUL))
#define bM0P_GPIO_FN_SEL03_TIOB5S0                      *((volatile unsigned int*)(0x4266C1B0UL))
#define bM0P_GPIO_FN_SEL03_TIOB5S1                      *((volatile unsigned int*)(0x4266C1B4UL))
#define bM0P_GPIO_FN_SEL03_TIOA6E0                      *((volatile unsigned int*)(0x4266C1C8UL))
#define bM0P_GPIO_FN_SEL03_TIOA6E1                      *((volatile unsigned int*)(0x4266C1CCUL))
#define bM0P_GPIO_FN_SEL03_TIOB6S0                      *((volatile unsigned int*)(0x4266C1D0UL))
#define bM0P_GPIO_FN_SEL03_TIOB6S1                      *((volatile unsigned int*)(0x4266C1D4UL))
#define bM0P_GPIO_FN_SEL03_TIOA7S0                      *((volatile unsigned int*)(0x4266C1E0UL))
#define bM0P_GPIO_FN_SEL03_TIOA7S1                      *((volatile unsigned int*)(0x4266C1E4UL))
#define bM0P_GPIO_FN_SEL03_TIOA7E0                      *((volatile unsigned int*)(0x4266C1E8UL))
#define bM0P_GPIO_FN_SEL03_TIOA7E1                      *((volatile unsigned int*)(0x4266C1ECUL))
#define bM0P_GPIO_FN_SEL03_TIOB7S0                      *((volatile unsigned int*)(0x4266C1F0UL))
#define bM0P_GPIO_FN_SEL03_TIOB7S1                      *((volatile unsigned int*)(0x4266C1F4UL))
#define bM0P_GPIO_FN_SEL04_EINT00S0                     *((volatile unsigned int*)(0x4266C200UL))
#define bM0P_GPIO_FN_SEL04_EINT00S1                     *((volatile unsigned int*)(0x4266C204UL))
#define bM0P_GPIO_FN_SEL04_EINT01S0                     *((volatile unsigned int*)(0x4266C208UL))
#define bM0P_GPIO_FN_SEL04_EINT01S1                     *((volatile unsigned int*)(0x4266C20CUL))
#define bM0P_GPIO_FN_SEL04_EINT02S0                     *((volatile unsigned int*)(0x4266C210UL))
#define bM0P_GPIO_FN_SEL04_EINT02S1                     *((volatile unsigned int*)(0x4266C214UL))
#define bM0P_GPIO_FN_SEL04_EINT03S0                     *((volatile unsigned int*)(0x4266C218UL))
#define bM0P_GPIO_FN_SEL04_EINT03S1                     *((volatile unsigned int*)(0x4266C21CUL))
#define bM0P_GPIO_FN_SEL04_EINT04S0                     *((volatile unsigned int*)(0x4266C220UL))
#define bM0P_GPIO_FN_SEL04_EINT04S1                     *((volatile unsigned int*)(0x4266C224UL))
#define bM0P_GPIO_FN_SEL04_EINT05S0                     *((volatile unsigned int*)(0x4266C228UL))
#define bM0P_GPIO_FN_SEL04_EINT05S1                     *((volatile unsigned int*)(0x4266C22CUL))
#define bM0P_GPIO_FN_SEL04_EINT06S0                     *((volatile unsigned int*)(0x4266C230UL))
#define bM0P_GPIO_FN_SEL04_EINT06S1                     *((volatile unsigned int*)(0x4266C234UL))
#define bM0P_GPIO_FN_SEL04_EINT07S0                     *((volatile unsigned int*)(0x4266C238UL))
#define bM0P_GPIO_FN_SEL04_EINT07S1                     *((volatile unsigned int*)(0x4266C23CUL))
#define bM0P_GPIO_FN_SEL04_EINT08S0                     *((volatile unsigned int*)(0x4266C240UL))
#define bM0P_GPIO_FN_SEL04_EINT08S1                     *((volatile unsigned int*)(0x4266C244UL))
#define bM0P_GPIO_FN_SEL04_EINT09S0                     *((volatile unsigned int*)(0x4266C248UL))
#define bM0P_GPIO_FN_SEL04_EINT09S1                     *((volatile unsigned int*)(0x4266C24CUL))
#define bM0P_GPIO_FN_SEL04_EINT10S0                     *((volatile unsigned int*)(0x4266C250UL))
#define bM0P_GPIO_FN_SEL04_EINT10S1                     *((volatile unsigned int*)(0x4266C254UL))
#define bM0P_GPIO_FN_SEL04_EINT11S0                     *((volatile unsigned int*)(0x4266C258UL))
#define bM0P_GPIO_FN_SEL04_EINT11S1                     *((volatile unsigned int*)(0x4266C25CUL))
#define bM0P_GPIO_FN_SEL04_EINT12S0                     *((volatile unsigned int*)(0x4266C260UL))
#define bM0P_GPIO_FN_SEL04_EINT12S1                     *((volatile unsigned int*)(0x4266C264UL))
#define bM0P_GPIO_FN_SEL04_EINT13S0                     *((volatile unsigned int*)(0x4266C268UL))
#define bM0P_GPIO_FN_SEL04_EINT13S1                     *((volatile unsigned int*)(0x4266C26CUL))
#define bM0P_GPIO_FN_SEL04_EINT14S0                     *((volatile unsigned int*)(0x4266C270UL))
#define bM0P_GPIO_FN_SEL04_EINT14S1                     *((volatile unsigned int*)(0x4266C274UL))
#define bM0P_GPIO_FN_SEL04_EINT15S0                     *((volatile unsigned int*)(0x4266C278UL))
#define bM0P_GPIO_FN_SEL04_EINT15S1                     *((volatile unsigned int*)(0x4266C27CUL))
#define bM0P_GPIO_FN_SEL05_SIN0S0                       *((volatile unsigned int*)(0x4266C290UL))
#define bM0P_GPIO_FN_SEL05_SIN0S1                       *((volatile unsigned int*)(0x4266C294UL))
#define bM0P_GPIO_FN_SEL05_SOT0B0                       *((volatile unsigned int*)(0x4266C298UL))
#define bM0P_GPIO_FN_SEL05_SOT0B1                       *((volatile unsigned int*)(0x4266C29CUL))
#define bM0P_GPIO_FN_SEL05_SCK0B0                       *((volatile unsigned int*)(0x4266C2A0UL))
#define bM0P_GPIO_FN_SEL05_SCK0B1                       *((volatile unsigned int*)(0x4266C2A4UL))
#define bM0P_GPIO_FN_SEL05_RTS1E0                       *((volatile unsigned int*)(0x4266C2C0UL))
#define bM0P_GPIO_FN_SEL05_RTS1E1                       *((volatile unsigned int*)(0x4266C2C4UL))
#define bM0P_GPIO_FN_SEL05_CTS1S0                       *((volatile unsigned int*)(0x4266C2C8UL))
#define bM0P_GPIO_FN_SEL05_CTS1S1                       *((volatile unsigned int*)(0x4266C2CCUL))
#define bM0P_GPIO_FN_SEL05_SIN1S0                       *((volatile unsigned int*)(0x4266C2D0UL))
#define bM0P_GPIO_FN_SEL05_SIN1S1                       *((volatile unsigned int*)(0x4266C2D4UL))
#define bM0P_GPIO_FN_SEL05_SOT1B0                       *((volatile unsigned int*)(0x4266C2D8UL))
#define bM0P_GPIO_FN_SEL05_SOT1B1                       *((volatile unsigned int*)(0x4266C2DCUL))
#define bM0P_GPIO_FN_SEL05_SCK1B0                       *((volatile unsigned int*)(0x4266C2E0UL))
#define bM0P_GPIO_FN_SEL05_SCK1B1                       *((volatile unsigned int*)(0x4266C2E4UL))
#define bM0P_GPIO_FN_SEL05_SCS10B0                      *((volatile unsigned int*)(0x4266C2E8UL))
#define bM0P_GPIO_FN_SEL05_SCS10B1                      *((volatile unsigned int*)(0x4266C2ECUL))
#define bM0P_GPIO_FN_SEL06_SIN2S0                       *((volatile unsigned int*)(0x4266C310UL))
#define bM0P_GPIO_FN_SEL06_SIN2S1                       *((volatile unsigned int*)(0x4266C314UL))
#define bM0P_GPIO_FN_SEL06_SOT2B0                       *((volatile unsigned int*)(0x4266C318UL))
#define bM0P_GPIO_FN_SEL06_SOT2B1                       *((volatile unsigned int*)(0x4266C31CUL))
#define bM0P_GPIO_FN_SEL06_SCK2B0                       *((volatile unsigned int*)(0x4266C320UL))
#define bM0P_GPIO_FN_SEL06_SCK2B1                       *((volatile unsigned int*)(0x4266C324UL))
#define bM0P_GPIO_FN_SEL06_SCS20B0                      *((volatile unsigned int*)(0x4266C328UL))
#define bM0P_GPIO_FN_SEL06_SCS20B1                      *((volatile unsigned int*)(0x4266C32CUL))
#define bM0P_GPIO_FN_SEL06_SCS21E0                      *((volatile unsigned int*)(0x4266C330UL))
#define bM0P_GPIO_FN_SEL06_SCS21E1                      *((volatile unsigned int*)(0x4266C334UL))
#define bM0P_GPIO_FN_SEL06_SCS22E0                      *((volatile unsigned int*)(0x4266C338UL))
#define bM0P_GPIO_FN_SEL06_SCS22E1                      *((volatile unsigned int*)(0x4266C33CUL))
#define bM0P_GPIO_FN_SEL07_RTS4E0                       *((volatile unsigned int*)(0x4266C380UL))
#define bM0P_GPIO_FN_SEL07_RTS4E1                       *((volatile unsigned int*)(0x4266C384UL))
#define bM0P_GPIO_FN_SEL07_CTS4S0                       *((volatile unsigned int*)(0x4266C388UL))
#define bM0P_GPIO_FN_SEL07_CTS4S1                       *((volatile unsigned int*)(0x4266C38CUL))
#define bM0P_GPIO_FN_SEL07_SIN4S0                       *((volatile unsigned int*)(0x4266C390UL))
#define bM0P_GPIO_FN_SEL07_SIN4S1                       *((volatile unsigned int*)(0x4266C394UL))
#define bM0P_GPIO_FN_SEL07_SOT4B0                       *((volatile unsigned int*)(0x4266C398UL))
#define bM0P_GPIO_FN_SEL07_SOT4B1                       *((volatile unsigned int*)(0x4266C39CUL))
#define bM0P_GPIO_FN_SEL07_SCK4B0                       *((volatile unsigned int*)(0x4266C3A0UL))
#define bM0P_GPIO_FN_SEL07_SCK4B1                       *((volatile unsigned int*)(0x4266C3A4UL))
#define bM0P_GPIO_FN_SEL07_SCS40B0                      *((volatile unsigned int*)(0x4266C3A8UL))
#define bM0P_GPIO_FN_SEL07_SCS40B1                      *((volatile unsigned int*)(0x4266C3ACUL))
#define bM0P_GPIO_FN_SEL07_SCS41E0                      *((volatile unsigned int*)(0x4266C3B0UL))
#define bM0P_GPIO_FN_SEL07_SCS41E1                      *((volatile unsigned int*)(0x4266C3B4UL))
#define bM0P_GPIO_FN_SEL07_SIN5S0                       *((volatile unsigned int*)(0x4266C3D0UL))
#define bM0P_GPIO_FN_SEL07_SIN5S1                       *((volatile unsigned int*)(0x4266C3D4UL))
#define bM0P_GPIO_FN_SEL07_SOT5B0                       *((volatile unsigned int*)(0x4266C3D8UL))
#define bM0P_GPIO_FN_SEL07_SOT5B1                       *((volatile unsigned int*)(0x4266C3DCUL))
#define bM0P_GPIO_FN_SEL07_SCK5B0                       *((volatile unsigned int*)(0x4266C3E0UL))
#define bM0P_GPIO_FN_SEL07_SCK5B1                       *((volatile unsigned int*)(0x4266C3E4UL))
#define bM0P_GPIO_FN_SEL07_SCS50B0                      *((volatile unsigned int*)(0x4266C3E8UL))
#define bM0P_GPIO_FN_SEL07_SCS50B1                      *((volatile unsigned int*)(0x4266C3ECUL))
#define bM0P_GPIO_FN_SEL08_RTS6E0                       *((volatile unsigned int*)(0x4266C400UL))
#define bM0P_GPIO_FN_SEL08_RTS6E1                       *((volatile unsigned int*)(0x4266C404UL))
#define bM0P_GPIO_FN_SEL08_CTS6S0                       *((volatile unsigned int*)(0x4266C408UL))
#define bM0P_GPIO_FN_SEL08_CTS6S1                       *((volatile unsigned int*)(0x4266C40CUL))
#define bM0P_GPIO_FN_SEL08_SIN6S0                       *((volatile unsigned int*)(0x4266C410UL))
#define bM0P_GPIO_FN_SEL08_SIN6S1                       *((volatile unsigned int*)(0x4266C414UL))
#define bM0P_GPIO_FN_SEL08_SOT6B0                       *((volatile unsigned int*)(0x4266C418UL))
#define bM0P_GPIO_FN_SEL08_SOT6B1                       *((volatile unsigned int*)(0x4266C41CUL))
#define bM0P_GPIO_FN_SEL08_SCK6B0                       *((volatile unsigned int*)(0x4266C420UL))
#define bM0P_GPIO_FN_SEL08_SCK6B1                       *((volatile unsigned int*)(0x4266C424UL))
#define bM0P_GPIO_FN_SEL08_SCS60B0                      *((volatile unsigned int*)(0x4266C428UL))
#define bM0P_GPIO_FN_SEL08_SCS60B1                      *((volatile unsigned int*)(0x4266C42CUL))
#define bM0P_GPIO_FN_SEL08_SCS61E0                      *((volatile unsigned int*)(0x4266C430UL))
#define bM0P_GPIO_FN_SEL08_SCS61E1                      *((volatile unsigned int*)(0x4266C434UL))
#define bM0P_GPIO_FN_SEL08_SCS62E0                      *((volatile unsigned int*)(0x4266C438UL))
#define bM0P_GPIO_FN_SEL08_SCS62E1                      *((volatile unsigned int*)(0x4266C43CUL))
#define bM0P_GPIO_FN_SEL09_VCOE0                        *((volatile unsigned int*)(0x4266C480UL))
#define bM0P_GPIO_FN_SEL09_VCOE1                        *((volatile unsigned int*)(0x4266C484UL))
#define bM0P_GPIO_FN_SEL09_BZOE0                        *((volatile unsigned int*)(0x4266C490UL))
#define bM0P_GPIO_FN_SEL09_BZOE1                        *((volatile unsigned int*)(0x4266C494UL))
#define bM0P_GPIO_FN_SEL09_ICCKE0                       *((volatile unsigned int*)(0x4266C4A0UL))
#define bM0P_GPIO_FN_SEL09_ICCKE1                       *((volatile unsigned int*)(0x4266C4A4UL))
#define bM0P_GPIO_FN_SEL09_ICIOB0                       *((volatile unsigned int*)(0x4266C4A8UL))
#define bM0P_GPIO_FN_SEL09_ICIOB1                       *((volatile unsigned int*)(0x4266C4ACUL))
#define bM0P_GPIO_FN_SEL09_ICRSTE0                      *((volatile unsigned int*)(0x4266C4B0UL))
#define bM0P_GPIO_FN_SEL09_ICRSTE1                      *((volatile unsigned int*)(0x4266C4B4UL))
#define bM0P_GPIO_ODR0_P00                              *((volatile unsigned int*)(0x4266E000UL))
#define bM0P_GPIO_ODR0_P01                              *((volatile unsigned int*)(0x4266E004UL))
#define bM0P_GPIO_ODR0_P02                              *((volatile unsigned int*)(0x4266E008UL))
#define bM0P_GPIO_ODR0_P03                              *((volatile unsigned int*)(0x4266E00CUL))
#define bM0P_GPIO_ODR0_P04                              *((volatile unsigned int*)(0x4266E010UL))
#define bM0P_GPIO_ODR0_P05                              *((volatile unsigned int*)(0x4266E014UL))
#define bM0P_GPIO_ODR0_P06                              *((volatile unsigned int*)(0x4266E018UL))
#define bM0P_GPIO_ODR0_P07                              *((volatile unsigned int*)(0x4266E01CUL))
#define bM0P_GPIO_ODR1_P10                              *((volatile unsigned int*)(0x4266E080UL))
#define bM0P_GPIO_ODR1_P11                              *((volatile unsigned int*)(0x4266E084UL))
#define bM0P_GPIO_ODR1_P12                              *((volatile unsigned int*)(0x4266E088UL))
#define bM0P_GPIO_ODR1_P13                              *((volatile unsigned int*)(0x4266E08CUL))
#define bM0P_GPIO_ODR1_P14                              *((volatile unsigned int*)(0x4266E090UL))
#define bM0P_GPIO_ODR1_P15                              *((volatile unsigned int*)(0x4266E094UL))
#define bM0P_GPIO_ODR1_P16                              *((volatile unsigned int*)(0x4266E098UL))
#define bM0P_GPIO_ODR1_P17                              *((volatile unsigned int*)(0x4266E09CUL))
#define bM0P_GPIO_ODR2_P20                              *((volatile unsigned int*)(0x4266E100UL))
#define bM0P_GPIO_ODR2_P21                              *((volatile unsigned int*)(0x4266E104UL))
#define bM0P_GPIO_ODR2_P22                              *((volatile unsigned int*)(0x4266E108UL))
#define bM0P_GPIO_ODR2_P23                              *((volatile unsigned int*)(0x4266E10CUL))
#define bM0P_GPIO_ODR2_P24                              *((volatile unsigned int*)(0x4266E110UL))
#define bM0P_GPIO_ODR2_P25                              *((volatile unsigned int*)(0x4266E114UL))
#define bM0P_GPIO_ODR2_P26                              *((volatile unsigned int*)(0x4266E118UL))
#define bM0P_GPIO_ODR2_P27                              *((volatile unsigned int*)(0x4266E11CUL))
