tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_GPIO_ODR3_P30                              *((volatile unsigned int*)(0x4266E180UL))
#define bM0P_GPIO_ODR3_P31                              *((volatile unsigned int*)(0x4266E184UL))
#define bM0P_GPIO_ODR3_P34                              *((volatile unsigned int*)(0x4266E190UL))
#define bM0P_GPIO_ODR3_P35                              *((volatile unsigned int*)(0x4266E194UL))
#define bM0P_GPIO_ODR3_P36                              *((volatile unsigned int*)(0x4266E198UL))
#define bM0P_GPIO_ODR3_P37                              *((volatile unsigned int*)(0x4266E19CUL))
#define bM0P_GPIO_ODR4_P40                              *((volatile unsigned int*)(0x4266E200UL))
#define bM0P_GPIO_ODR4_P41                              *((volatile unsigned int*)(0x4266E204UL))
#define bM0P_GPIO_ODR4_P45                              *((volatile unsigned int*)(0x4266E214UL))
#define bM0P_GPIO_ODR4_P46                              *((volatile unsigned int*)(0x4266E218UL))
#define bM0P_GPIO_ODR4_P47                              *((volatile unsigned int*)(0x4266E21CUL))
#define bM0P_GPIO_ODR5_P50                              *((volatile unsigned int*)(0x4266E280UL))
#define bM0P_GPIO_ODR5_P51                              *((volatile unsigned int*)(0x4266E284UL))
#define bM0P_GPIO_ODR5_P52                              *((volatile unsigned int*)(0x4266E288UL))
#define bM0P_GPIO_ODR5_P53                              *((volatile unsigned int*)(0x4266E28CUL))
#define bM0P_GPIO_ODR5_P54                              *((volatile unsigned int*)(0x4266E290UL))
#define bM0P_GPIO_ODR5_P55                              *((volatile unsigned int*)(0x4266E294UL))
#define bM0P_GPIO_ODR5_P56                              *((volatile unsigned int*)(0x4266E298UL))
#define bM0P_GPIO_ODR5_P57                              *((volatile unsigned int*)(0x4266E29CUL))
#define bM0P_GPIO_ODR6_P60                              *((volatile unsigned int*)(0x4266E300UL))
#define bM0P_GPIO_ODR6_P61                              *((volatile unsigned int*)(0x4266E304UL))
#define bM0P_GPIO_ODR6_P62                              *((volatile unsigned int*)(0x4266E308UL))
#define bM0P_GPIO_ODR6_P63                              *((volatile unsigned int*)(0x4266E30CUL))
#define bM0P_GPIO_ODR6_P64                              *((volatile unsigned int*)(0x4266E310UL))
#define bM0P_GPIO_ODR6_P65                              *((volatile unsigned int*)(0x4266E314UL))
#define bM0P_GPIO_ODR6_P66                              *((volatile unsigned int*)(0x4266E318UL))
#define bM0P_GPIO_ODR6_P67                              *((volatile unsigned int*)(0x4266E31CUL))
#define bM0P_GPIO_ODR7_P70                              *((volatile unsigned int*)(0x4266E380UL))
#define bM0P_GPIO_ODR7_P71                              *((volatile unsigned int*)(0x4266E384UL))
#define bM0P_GPIO_ODR7_P72                              *((volatile unsigned int*)(0x4266E388UL))
#define bM0P_GPIO_ODR7_P73                              *((volatile unsigned int*)(0x4266E38CUL))
#define bM0P_GPIO_ODR7_P74                              *((volatile unsigned int*)(0x4266E390UL))
#define bM0P_GPIO_ODR8_P80                              *((volatile unsigned int*)(0x4266E400UL))
#define bM0P_GPIO_LVDIE_LVDIE                           *((volatile unsigned int*)(0x4266E800UL))
#define bM0P_GPIO_FSETE0_P00                            *((volatile unsigned int*)(0x42672000UL))
#define bM0P_GPIO_FSETE0_P01                            *((volatile unsigned int*)(0x42672004UL))
#define bM0P_GPIO_FSETE0_P02                            *((volatile unsigned int*)(0x42672008UL))
#define bM0P_GPIO_FSETE0_P03                            *((volatile unsigned int*)(0x4267200CUL))
#define bM0P_GPIO_FSETE0_P04                            *((volatile unsigned int*)(0x42672010UL))
#define bM0P_GPIO_FSETE0_P05                            *((volatile unsigned int*)(0x42672014UL))
#define bM0P_GPIO_FSETE0_P06                            *((volatile unsigned int*)(0x42672018UL))
#define bM0P_GPIO_FSETE0_P07                            *((volatile unsigned int*)(0x4267201CUL))
#define bM0P_GPIO_FSETE1_P10                            *((volatile unsigned int*)(0x42672080UL))
#define bM0P_GPIO_FSETE1_P11                            *((volatile unsigned int*)(0x42672084UL))
#define bM0P_GPIO_FSETE1_P12                            *((volatile unsigned int*)(0x42672088UL))
#define bM0P_GPIO_FSETE1_P13                            *((volatile unsigned int*)(0x4267208CUL))
#define bM0P_GPIO_FSETE1_P14                            *((volatile unsigned int*)(0x42672090UL))
#define bM0P_GPIO_FSETE1_P15                            *((volatile unsigned int*)(0x42672094UL))
#define bM0P_GPIO_FSETE1_P16                            *((volatile unsigned int*)(0x42672098UL))
#define bM0P_GPIO_FSETE1_P17                            *((volatile unsigned int*)(0x4267209CUL))
#define bM0P_GPIO_FSETE2_P20                            *((volatile unsigned int*)(0x42672100UL))
#define bM0P_GPIO_FSETE2_P21                            *((volatile unsigned int*)(0x42672104UL))
#define bM0P_GPIO_FSETE2_P22                            *((volatile unsigned int*)(0x42672108UL))
#define bM0P_GPIO_FSETE2_P23                            *((volatile unsigned int*)(0x4267210CUL))
#define bM0P_GPIO_FSETE2_P24                            *((volatile unsigned int*)(0x42672110UL))
#define bM0P_GPIO_FSETE2_P25                            *((volatile unsigned int*)(0x42672114UL))
#define bM0P_GPIO_FSETE2_P26                            *((volatile unsigned int*)(0x42672118UL))
#define bM0P_GPIO_FSETE2_P27                            *((volatile unsigned int*)(0x4267211CUL))
#define bM0P_GPIO_FSETE3_P30                            *((volatile unsigned int*)(0x42672180UL))
#define bM0P_GPIO_FSETE3_P31                            *((volatile unsigned int*)(0x42672184UL))
#define bM0P_GPIO_FSETE3_P34                            *((volatile unsigned int*)(0x42672190UL))
#define bM0P_GPIO_FSETE3_P35                            *((volatile unsigned int*)(0x42672194UL))
#define bM0P_GPIO_FSETE3_P36                            *((volatile unsigned int*)(0x42672198UL))
#define bM0P_GPIO_FSETE3_P37                            *((volatile unsigned int*)(0x4267219CUL))
#define bM0P_GPIO_FSETE4_P40                            *((volatile unsigned int*)(0x42672200UL))
#define bM0P_GPIO_FSETE4_P41                            *((volatile unsigned int*)(0x42672204UL))
#define bM0P_GPIO_FSETE4_P45                            *((volatile unsigned int*)(0x42672214UL))
#define bM0P_GPIO_FSETE4_P46                            *((volatile unsigned int*)(0x42672218UL))
#define bM0P_GPIO_FSETE4_P47                            *((volatile unsigned int*)(0x4267221CUL))
#define bM0P_GPIO_FSETE5_P50                            *((volatile unsigned int*)(0x42672280UL))
#define bM0P_GPIO_FSETE5_P51                            *((volatile unsigned int*)(0x42672284UL))
#define bM0P_GPIO_FSETE5_P52                            *((volatile unsigned int*)(0x42672288UL))
#define bM0P_GPIO_FSETE5_P53                            *((volatile unsigned int*)(0x4267228CUL))
#define bM0P_GPIO_FSETE5_P54                            *((volatile unsigned int*)(0x42672290UL))
#define bM0P_GPIO_FSETE5_P55                            *((volatile unsigned int*)(0x42672294UL))
#define bM0P_GPIO_FSETE5_P56                            *((volatile unsigned int*)(0x42672298UL))
#define bM0P_GPIO_FSETE5_P57                            *((volatile unsigned int*)(0x4267229CUL))
#define bM0P_GPIO_FSETE6_P60                            *((volatile unsigned int*)(0x42672300UL))
#define bM0P_GPIO_FSETE6_P61                            *((volatile unsigned int*)(0x42672304UL))
#define bM0P_GPIO_FSETE6_P62                            *((volatile unsigned int*)(0x42672308UL))
#define bM0P_GPIO_FSETE6_P63                            *((volatile unsigned int*)(0x4267230CUL))
#define bM0P_GPIO_FSETE6_P64                            *((volatile unsigned int*)(0x42672310UL))
#define bM0P_GPIO_FSETE6_P65                            *((volatile unsigned int*)(0x42672314UL))
#define bM0P_GPIO_FSETE6_P66                            *((volatile unsigned int*)(0x42672318UL))
#define bM0P_GPIO_FSETE6_P67                            *((volatile unsigned int*)(0x4267231CUL))
#define bM0P_GPIO_FSETE7_P70                            *((volatile unsigned int*)(0x42672380UL))
#define bM0P_GPIO_FSETE7_P71                            *((volatile unsigned int*)(0x42672384UL))
#define bM0P_GPIO_FSETE7_P72                            *((volatile unsigned int*)(0x42672388UL))
#define bM0P_GPIO_FSETE7_P73                            *((volatile unsigned int*)(0x4267238CUL))
#define bM0P_GPIO_FSETE7_P74                            *((volatile unsigned int*)(0x42672390UL))
#define bM0P_GPIO_FSETE8_P80                            *((volatile unsigned int*)(0x42672400UL))
#define bM0P_HWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42220100UL))
#define bM0P_HWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42220104UL))
#define bM0P_HWWDT_WDT_CTL_CLKS                         *((volatile unsigned int*)(0x42220108UL))
#define bM0P_HWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42220200UL))
#define bM0P_IRQC_IRQ_ST02_NMI                          *((volatile unsigned int*)(0x42620200UL))
#define bM0P_IRQC_IRQ_ST02_HWWDG                        *((volatile unsigned int*)(0x42620204UL))
#define bM0P_IRQC_IRQ00PEND_AFDI                        *((volatile unsigned int*)(0x42620280UL))
#define bM0P_IRQC_IRQ00PEND_MCSV                        *((volatile unsigned int*)(0x42620284UL))
#define bM0P_IRQC_IRQ00PEND_SCSV                        *((volatile unsigned int*)(0x42620288UL))
#define bM0P_IRQC_IRQ01PEND_SWWDG                       *((volatile unsigned int*)(0x42620300UL))
#define bM0P_IRQC_IRQ02PEND_LVD                         *((volatile unsigned int*)(0x42620380UL))
#define bM0P_IRQC_IRQ04PEND_EXTI0                       *((volatile unsigned int*)(0x42620480UL))
#define bM0P_IRQC_IRQ04PEND_EXTI1                       *((volatile unsigned int*)(0x42620484UL))
#define bM0P_IRQC_IRQ04PEND_EXTI2                       *((volatile unsigned int*)(0x42620488UL))
#define bM0P_IRQC_IRQ04PEND_EXTI3                       *((volatile unsigned int*)(0x4262048CUL))
#define bM0P_IRQC_IRQ04PEND_EXTI4                       *((volatile unsigned int*)(0x42620490UL))
#define bM0P_IRQC_IRQ04PEND_EXTI5                       *((volatile unsigned int*)(0x42620494UL))
#define bM0P_IRQC_IRQ04PEND_EXTI6                       *((volatile unsigned int*)(0x42620498UL))
#define bM0P_IRQC_IRQ04PEND_EXTI7                       *((volatile unsigned int*)(0x4262049CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI8                       *((volatile unsigned int*)(0x42620500UL))
#define bM0P_IRQC_IRQ05PEND_EXTI9                       *((volatile unsigned int*)(0x42620504UL))
#define bM0P_IRQC_IRQ05PEND_EXTI10                      *((volatile unsigned int*)(0x42620508UL))
#define bM0P_IRQC_IRQ05PEND_EXTI11                      *((volatile unsigned int*)(0x4262050CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI12                      *((volatile unsigned int*)(0x42620510UL))
#define bM0P_IRQC_IRQ05PEND_EXTI13                      *((volatile unsigned int*)(0x42620514UL))
#define bM0P_IRQC_IRQ05PEND_EXTI14                      *((volatile unsigned int*)(0x42620518UL))
#define bM0P_IRQC_IRQ05PEND_EXTI15                      *((volatile unsigned int*)(0x4262051CUL))
#define bM0P_IRQC_IRQ06PEND_DTI1                        *((volatile unsigned int*)(0x42620580UL))
#define bM0P_IRQC_IRQ06PEND_DTI2                        *((volatile unsigned int*)(0x42620584UL))
#define bM0P_IRQC_IRQ07PEND_MSC0INT                     *((volatile unsigned int*)(0x42620600UL))
#define bM0P_IRQC_IRQ08PEND_MSC0INT0                    *((volatile unsigned int*)(0x42620680UL))
#define bM0P_IRQC_IRQ08PEND_MSC0INT1                    *((volatile unsigned int*)(0x42620684UL))
#define bM0P_IRQC_IRQ09PEND_MSC1INT                     *((volatile unsigned int*)(0x42620700UL))
#define bM0P_IRQC_IRQ10PEND_MSC1INT0                    *((volatile unsigned int*)(0x42620780UL))
#define bM0P_IRQC_IRQ10PEND_MSC1INT1                    *((volatile unsigned int*)(0x42620784UL))
#define bM0P_IRQC_IRQ11PEND_MSC2INT                     *((volatile unsigned int*)(0x42620800UL))
#define bM0P_IRQC_IRQ12PEND_MSC2INT0                    *((volatile unsigned int*)(0x42620880UL))
#define bM0P_IRQC_IRQ12PEND_MSC2INT1                    *((volatile unsigned int*)(0x42620884UL))
#define bM0P_IRQC_IRQ15PEND_MSC4INT                     *((volatile unsigned int*)(0x42620A00UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT0                    *((volatile unsigned int*)(0x42620A80UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT1                    *((volatile unsigned int*)(0x42620A84UL))
#define bM0P_IRQC_IRQ17PEND_MSC5INT                     *((volatile unsigned int*)(0x42620B00UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT0                    *((volatile unsigned int*)(0x42620B80UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT1                    *((volatile unsigned int*)(0x42620B84UL))
#define bM0P_IRQC_IRQ19PEND_MSC6INT                     *((volatile unsigned int*)(0x42620C00UL))
#define bM0P_IRQC_IRQ20PEND_MSC6INT0                    *((volatile unsigned int*)(0x42620C80UL))
#define bM0P_IRQC_IRQ20PEND_MSC6INT1                    *((volatile unsigned int*)(0x42620C84UL))
#define bM0P_IRQC_IRQ24PEND_MOSCI                       *((volatile unsigned int*)(0x42620E80UL))
#define bM0P_IRQC_IRQ24PEND_SOSCI                       *((volatile unsigned int*)(0x42620E84UL))
#define bM0P_IRQC_IRQ24PEND_RTCI                        *((volatile unsigned int*)(0x42620E94UL))
#define bM0P_IRQC_IRQ24PEND_RAMI                        *((volatile unsigned int*)(0x42620E9CUL))
#define bM0P_IRQC_IRQ25PEND_ADCCNVI                     *((volatile unsigned int*)(0x42620F00UL))
#define bM0P_IRQC_IRQ25PEND_ADCCMPI                     *((volatile unsigned int*)(0x42620F10UL))
#define bM0P_IRQC_IRQ26PEND_VCI                         *((volatile unsigned int*)(0x42620F94UL))
#define bM0P_IRQC_IRQ27PEND_ICCI                        *((volatile unsigned int*)(0x42621018UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH0                  *((volatile unsigned int*)(0x42621200UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH0                  *((volatile unsigned int*)(0x42621204UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH1                  *((volatile unsigned int*)(0x42621208UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH1                  *((volatile unsigned int*)(0x4262120CUL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH2                  *((volatile unsigned int*)(0x42621210UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH2                  *((volatile unsigned int*)(0x42621214UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH3                  *((volatile unsigned int*)(0x42621218UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH3                  *((volatile unsigned int*)(0x4262121CUL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH4                  *((volatile unsigned int*)(0x42621220UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH4                  *((volatile unsigned int*)(0x42621224UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH5                  *((volatile unsigned int*)(0x42621228UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH5                  *((volatile unsigned int*)(0x4262122CUL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH6                  *((volatile unsigned int*)(0x42621230UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH6                  *((volatile unsigned int*)(0x42621234UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ0CH7                  *((volatile unsigned int*)(0x42621238UL))
#define bM0P_IRQC_IRQ31PEND_CTIIRQ1CH7                  *((volatile unsigned int*)(0x4262123CUL))
#define bM0P_IRQC_IRQ31PEND_FLASHI                      *((volatile unsigned int*)(0x4262126CUL))
#define bM0P_LCDC_LCDCR0_CLKSEL                         *((volatile unsigned int*)(0x42640000UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME0                     *((volatile unsigned int*)(0x42640004UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME1                     *((volatile unsigned int*)(0x42640008UL))
#define bM0P_LCDC_LCDCR0_BIAS0                          *((volatile unsigned int*)(0x4264000CUL))
#define bM0P_LCDC_LCDCR0_BIAS1                          *((volatile unsigned int*)(0x42640010UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE0                      *((volatile unsigned int*)(0x42640014UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE1                      *((volatile unsigned int*)(0x42640018UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE2                      *((volatile unsigned int*)(0x4264001CUL))
#define bM0P_LCDC_LCDCR1_VLCD0                          *((volatile unsigned int*)(0x42640020UL))
#define bM0P_LCDC_LCDCR1_VLCD1                          *((volatile unsigned int*)(0x42640024UL))
#define bM0P_LCDC_LCDCR1_VLCD2                          *((volatile unsigned int*)(0x42640028UL))
#define bM0P_LCDC_LCDCR1_CT0                            *((volatile unsigned int*)(0x4264002CUL))
#define bM0P_LCDC_LCDCR1_CT1                            *((volatile unsigned int*)(0x42640030UL))
#define bM0P_LCDC_LCDCR1_CT2                            *((volatile unsigned int*)(0x42640034UL))
#define bM0P_LCDC_LCDCR1_CMOD                           *((volatile unsigned int*)(0x42640038UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ0                       *((volatile unsigned int*)(0x42640040UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ1                       *((volatile unsigned int*)(0x42640044UL))
#define bM0P_LCDC_LCDCR2_VSEL0                          *((volatile unsigned int*)(0x42640054UL))
#define bM0P_LCDC_LCDCR2_VSEL1                          *((volatile unsigned int*)(0x42640058UL))
#define bM0P_LCDC_LCDCR2_WSEL                           *((volatile unsigned int*)(0x4264005CUL))
#define bM0P_LCDC_LCDCR3_LCD_EN                         *((volatile unsigned int*)(0x42640060UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF0                       *((volatile unsigned int*)(0x42640070UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF1                       *((volatile unsigned int*)(0x42640074UL))
#define bM0P_LCDC_LCDDVC_VE0                            *((volatile unsigned int*)(0x42640080UL))
#define bM0P_LCDC_LCDDVC_VE1                            *((volatile unsigned int*)(0x42640084UL))
#define bM0P_LCDC_LCDDVC_VE2                            *((volatile unsigned int*)(0x42640088UL))
#define bM0P_LCDC_LCDDVC_VE3                            *((volatile unsigned int*)(0x4264008CUL))
#define bM0P_LCDC_LCDDVC_VE4                            *((volatile unsigned int*)(0x42640090UL))
#define bM0P_LCDC_LCDCE0_COME0                          *((volatile unsigned int*)(0x42640100UL))
#define bM0P_LCDC_LCDCE0_COME1                          *((volatile unsigned int*)(0x42640104UL))
#define bM0P_LCDC_LCDCE0_COME2                          *((volatile unsigned int*)(0x42640108UL))
#define bM0P_LCDC_LCDCE0_COME3                          *((volatile unsigned int*)(0x4264010CUL))
#define bM0P_LCDC_LCDCE0_COME4                          *((volatile unsigned int*)(0x42640110UL))
#define bM0P_LCDC_LCDCE0_COME5                          *((volatile unsigned int*)(0x42640114UL))
#define bM0P_LCDC_LCDCE0_COME6                          *((volatile unsigned int*)(0x42640118UL))
#define bM0P_LCDC_LCDCE0_COME7                          *((volatile unsigned int*)(0x4264011CUL))
#define bM0P_LCDC_LCDSE0_SEGE0                          *((volatile unsigned int*)(0x42640180UL))
#define bM0P_LCDC_LCDSE0_SEGE1                          *((volatile unsigned int*)(0x42640184UL))
#define bM0P_LCDC_LCDSE0_SEGE2                          *((volatile unsigned int*)(0x42640188UL))
#define bM0P_LCDC_LCDSE0_SEGE3                          *((volatile unsigned int*)(0x4264018CUL))
#define bM0P_LCDC_LCDSE0_SEGE4                          *((volatile unsigned int*)(0x42640190UL))
#define bM0P_LCDC_LCDSE0_SEGE5                          *((volatile unsigned int*)(0x42640194UL))
#define bM0P_LCDC_LCDSE0_SEGE6                          *((volatile unsigned int*)(0x42640198UL))
#define bM0P_LCDC_LCDSE0_SEGE7                          *((volatile unsigned int*)(0x4264019CUL))
#define bM0P_LCDC_LCDSE1_SEGE8                          *((volatile unsigned int*)(0x426401A0UL))
#define bM0P_LCDC_LCDSE1_SEGE9                          *((volatile unsigned int*)(0x426401A4UL))
#define bM0P_LCDC_LCDSE1_SEGE10                         *((volatile unsigned int*)(0x426401A8UL))
#define bM0P_LCDC_LCDSE1_SEGE11                         *((volatile unsigned int*)(0x426401ACUL))
#define bM0P_LCDC_LCDSE1_SEGE12                         *((volatile unsigned int*)(0x426401B0UL))
#define bM0P_LCDC_LCDSE1_SEGE13                         *((volatile unsigned int*)(0x426401B4UL))
#define bM0P_LCDC_LCDSE1_SEGE14                         *((volatile unsigned int*)(0x426401B8UL))
#define bM0P_LCDC_LCDSE1_SEGE15                         *((volatile unsigned int*)(0x426401BCUL))
#define bM0P_LCDC_LCDSE2_SEGE16                         *((volatile unsigned int*)(0x426401C0UL))
#define bM0P_LCDC_LCDSE2_SEGE17                         *((volatile unsigned int*)(0x426401C4UL))
#define bM0P_LCDC_LCDSE2_SEGE18                         *((volatile unsigned int*)(0x426401C8UL))
#define bM0P_LCDC_LCDSE2_SEGE19                         *((volatile unsigned int*)(0x426401CCUL))
#define bM0P_LCDC_LCDSE2_SEGE20                         *((volatile unsigned int*)(0x426401D0UL))
#define bM0P_LCDC_LCDSE2_SEGE21                         *((volatile unsigned int*)(0x426401D4UL))
#define bM0P_LCDC_LCDSE2_SEGE22                         *((volatile unsigned int*)(0x426401D8UL))
#define bM0P_LCDC_LCDSE2_SEGE23                         *((volatile unsigned int*)(0x426401DCUL))
#define bM0P_LCDC_LCDSE3_SEGE24                         *((volatile unsigned int*)(0x426401E0UL))
#define bM0P_LCDC_LCDSE3_SEGE25                         *((volatile unsigned int*)(0x426401E4UL))
#define bM0P_LCDC_LCDSE3_SEGE26                         *((volatile unsigned int*)(0x426401E8UL))
#define bM0P_LCDC_LCDSE3_SEGE27                         *((volatile unsigned int*)(0x426401ECUL))
#define bM0P_LCDC_LCDSE3_SEGE28                         *((volatile unsigned int*)(0x426401F0UL))
#define bM0P_LCDC_LCDSE3_SEGE29                         *((volatile unsigned int*)(0x426401F4UL))
#define bM0P_LCDC_LCDSE3_SEGE30                         *((volatile unsigned int*)(0x426401F8UL))
#define bM0P_LCDC_LCDSE3_SEGE31                         *((volatile unsigned int*)(0x426401FCUL))
#define bM0P_LCDC_LCDSE4_SEGE32                         *((volatile unsigned int*)(0x42640200UL))
#define bM0P_LCDC_LCDSE4_SEGE33                         *((volatile unsigned int*)(0x42640204UL))
#define bM0P_LCDC_LCDSE4_SEGE34                         *((volatile unsigned int*)(0x42640208UL))
#define bM0P_LCDC_LCDSE4_SEGE35                         *((volatile unsigned int*)(0x4264020CUL))
#define bM0P_LCDC_LCDSE4_SEGE36                         *((volatile unsigned int*)(0x42640210UL))
#define bM0P_LCDC_LCDSE4_SEGE37                         *((volatile unsigned int*)(0x42640214UL))
#define bM0P_LCDC_LCDSE4_SEGE38                         *((volatile unsigned int*)(0x42640218UL))
#define bM0P_LCDC_LCDSE4_SEGE39                         *((volatile unsigned int*)(0x4264021CUL))
#define bM0P_MSC0_I2C_MR_TXIE                           *((volatile unsigned int*)(0x42700008UL))
#define bM0P_MSC0_I2C_MR_RXIE                           *((volatile unsigned int*)(0x4270000CUL))
#define bM0P_MSC0_I2C_MR_MODE0                          *((volatile unsigned int*)(0x42700014UL))
#define bM0P_MSC0_I2C_MR_MODE1                          *((volatile unsigned int*)(0x42700018UL))
#define bM0P_MSC0_I2C_MR_MODE2                          *((volatile unsigned int*)(0x4270001CUL))
