tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC0_I2C_BC_INTF                           *((volatile unsigned int*)(0x42700020UL))
#define bM0P_MSC0_I2C_BC_BERF                           *((volatile unsigned int*)(0x42700024UL))
#define bM0P_MSC0_I2C_BC_INTE                           *((volatile unsigned int*)(0x42700028UL))
#define bM0P_MSC0_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x4270002CUL))
#define bM0P_MSC0_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x42700030UL))
#define bM0P_MSC0_I2C_BC_ACKE                           *((volatile unsigned int*)(0x42700034UL))
#define bM0P_MSC0_I2C_BC_OFITS                          *((volatile unsigned int*)(0x42700038UL))
#define bM0P_MSC0_I2C_BC_MSS                            *((volatile unsigned int*)(0x4270003CUL))
#define bM0P_MSC0_I2C_BS_BSS                            *((volatile unsigned int*)(0x42700080UL))
#define bM0P_MSC0_I2C_BS_STPCC                          *((volatile unsigned int*)(0x42700084UL))
#define bM0P_MSC0_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x42700088UL))
#define bM0P_MSC0_I2C_BS_ABL                            *((volatile unsigned int*)(0x4270008CUL))
#define bM0P_MSC0_I2C_BS_TRX                            *((volatile unsigned int*)(0x42700090UL))
#define bM0P_MSC0_I2C_BS_RAD                            *((volatile unsigned int*)(0x42700094UL))
#define bM0P_MSC0_I2C_BS_ACKF                           *((volatile unsigned int*)(0x42700098UL))
#define bM0P_MSC0_I2C_BS_FBB                            *((volatile unsigned int*)(0x4270009CUL))
#define bM0P_MSC0_I2C_SR_TBIF                           *((volatile unsigned int*)(0x427000A0UL))
#define bM0P_MSC0_I2C_SR_TDEF                           *((volatile unsigned int*)(0x427000A4UL))
#define bM0P_MSC0_I2C_SR_RDFF                           *((volatile unsigned int*)(0x427000A8UL))
#define bM0P_MSC0_I2C_SR_ORF                            *((volatile unsigned int*)(0x427000ACUL))
#define bM0P_MSC0_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x427000B0UL))
#define bM0P_MSC0_I2C_SR_TEFS                           *((volatile unsigned int*)(0x427000B8UL))
#define bM0P_MSC0_I2C_SR_RECLR                          *((volatile unsigned int*)(0x427000BCUL))
#define bM0P_MSC0_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x42700180UL))
#define bM0P_MSC0_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x42700184UL))
#define bM0P_MSC0_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x42700188UL))
#define bM0P_MSC0_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x4270018CUL))
#define bM0P_MSC0_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x42700190UL))
#define bM0P_MSC0_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x42700194UL))
#define bM0P_MSC0_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x42700198UL))
#define bM0P_MSC0_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x4270019CUL))
#define bM0P_MSC0_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x427001A0UL))
#define bM0P_MSC0_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x427001A4UL))
#define bM0P_MSC0_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x427001A8UL))
#define bM0P_MSC0_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x427001ACUL))
#define bM0P_MSC0_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x427001B0UL))
#define bM0P_MSC0_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x427001B4UL))
#define bM0P_MSC0_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x427001B8UL))
#define bM0P_MSC0_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x42700200UL))
#define bM0P_MSC0_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x42700204UL))
#define bM0P_MSC0_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x42700208UL))
#define bM0P_MSC0_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x4270020CUL))
#define bM0P_MSC0_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x42700210UL))
#define bM0P_MSC0_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x42700214UL))
#define bM0P_MSC0_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x42700218UL))
#define bM0P_MSC0_I2C_SA_AE                             *((volatile unsigned int*)(0x4270021CUL))
#define bM0P_MSC0_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x42700220UL))
#define bM0P_MSC0_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x42700224UL))
#define bM0P_MSC0_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x42700228UL))
#define bM0P_MSC0_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x4270022CUL))
#define bM0P_MSC0_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x42700230UL))
#define bM0P_MSC0_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x42700234UL))
#define bM0P_MSC0_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x42700238UL))
#define bM0P_MSC0_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x4270023CUL))
#define bM0P_MSC0_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x427003A0UL))
#define bM0P_MSC0_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x427003A4UL))
#define bM0P_MSC0_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x427003A8UL))
#define bM0P_MSC0_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x427003ACUL))
#define bM0P_MSC0_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x427003B0UL))
#define bM0P_MSC0_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x427003B4UL))
#define bM0P_MSC1_I2C_MR_TXIE                           *((volatile unsigned int*)(0x42702008UL))
#define bM0P_MSC1_I2C_MR_RXIE                           *((volatile unsigned int*)(0x4270200CUL))
#define bM0P_MSC1_I2C_MR_MODE0                          *((volatile unsigned int*)(0x42702014UL))
#define bM0P_MSC1_I2C_MR_MODE1                          *((volatile unsigned int*)(0x42702018UL))
#define bM0P_MSC1_I2C_MR_MODE2                          *((volatile unsigned int*)(0x4270201CUL))
#define bM0P_MSC1_I2C_BC_INTF                           *((volatile unsigned int*)(0x42702020UL))
#define bM0P_MSC1_I2C_BC_BERF                           *((volatile unsigned int*)(0x42702024UL))
#define bM0P_MSC1_I2C_BC_INTE                           *((volatile unsigned int*)(0x42702028UL))
#define bM0P_MSC1_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x4270202CUL))
#define bM0P_MSC1_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x42702030UL))
#define bM0P_MSC1_I2C_BC_ACKE                           *((volatile unsigned int*)(0x42702034UL))
#define bM0P_MSC1_I2C_BC_OFITS                          *((volatile unsigned int*)(0x42702038UL))
#define bM0P_MSC1_I2C_BC_MSS                            *((volatile unsigned int*)(0x4270203CUL))
#define bM0P_MSC1_I2C_BS_BSS                            *((volatile unsigned int*)(0x42702080UL))
#define bM0P_MSC1_I2C_BS_STPCC                          *((volatile unsigned int*)(0x42702084UL))
#define bM0P_MSC1_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x42702088UL))
#define bM0P_MSC1_I2C_BS_ABL                            *((volatile unsigned int*)(0x4270208CUL))
#define bM0P_MSC1_I2C_BS_TRX                            *((volatile unsigned int*)(0x42702090UL))
#define bM0P_MSC1_I2C_BS_RAD                            *((volatile unsigned int*)(0x42702094UL))
#define bM0P_MSC1_I2C_BS_ACKF                           *((volatile unsigned int*)(0x42702098UL))
#define bM0P_MSC1_I2C_BS_FBB                            *((volatile unsigned int*)(0x4270209CUL))
#define bM0P_MSC1_I2C_SR_TBIF                           *((volatile unsigned int*)(0x427020A0UL))
#define bM0P_MSC1_I2C_SR_TDEF                           *((volatile unsigned int*)(0x427020A4UL))
#define bM0P_MSC1_I2C_SR_RDFF                           *((volatile unsigned int*)(0x427020A8UL))
#define bM0P_MSC1_I2C_SR_ORF                            *((volatile unsigned int*)(0x427020ACUL))
#define bM0P_MSC1_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x427020B0UL))
#define bM0P_MSC1_I2C_SR_TEFS                           *((volatile unsigned int*)(0x427020B8UL))
#define bM0P_MSC1_I2C_SR_RECLR                          *((volatile unsigned int*)(0x427020BCUL))
#define bM0P_MSC1_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x42702180UL))
#define bM0P_MSC1_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x42702184UL))
#define bM0P_MSC1_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x42702188UL))
#define bM0P_MSC1_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x4270218CUL))
#define bM0P_MSC1_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x42702190UL))
#define bM0P_MSC1_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x42702194UL))
#define bM0P_MSC1_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x42702198UL))
#define bM0P_MSC1_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x4270219CUL))
#define bM0P_MSC1_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x427021A0UL))
#define bM0P_MSC1_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x427021A4UL))
#define bM0P_MSC1_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x427021A8UL))
#define bM0P_MSC1_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x427021ACUL))
#define bM0P_MSC1_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x427021B0UL))
#define bM0P_MSC1_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x427021B4UL))
#define bM0P_MSC1_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x427021B8UL))
#define bM0P_MSC1_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x42702200UL))
#define bM0P_MSC1_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x42702204UL))
#define bM0P_MSC1_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x42702208UL))
#define bM0P_MSC1_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x4270220CUL))
#define bM0P_MSC1_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x42702210UL))
#define bM0P_MSC1_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x42702214UL))
#define bM0P_MSC1_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x42702218UL))
#define bM0P_MSC1_I2C_SA_AE                             *((volatile unsigned int*)(0x4270221CUL))
#define bM0P_MSC1_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x42702220UL))
#define bM0P_MSC1_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x42702224UL))
#define bM0P_MSC1_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x42702228UL))
#define bM0P_MSC1_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x4270222CUL))
#define bM0P_MSC1_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x42702230UL))
#define bM0P_MSC1_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x42702234UL))
#define bM0P_MSC1_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x42702238UL))
#define bM0P_MSC1_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x4270223CUL))
#define bM0P_MSC1_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x427023A0UL))
#define bM0P_MSC1_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x427023A4UL))
#define bM0P_MSC1_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x427023A8UL))
#define bM0P_MSC1_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x427023ACUL))
#define bM0P_MSC1_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x427023B0UL))
#define bM0P_MSC1_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x427023B4UL))
#define bM0P_MSC2_I2C_MR_TXIE                           *((volatile unsigned int*)(0x42704008UL))
#define bM0P_MSC2_I2C_MR_RXIE                           *((volatile unsigned int*)(0x4270400CUL))
#define bM0P_MSC2_I2C_MR_MODE0                          *((volatile unsigned int*)(0x42704014UL))
#define bM0P_MSC2_I2C_MR_MODE1                          *((volatile unsigned int*)(0x42704018UL))
#define bM0P_MSC2_I2C_MR_MODE2                          *((volatile unsigned int*)(0x4270401CUL))
#define bM0P_MSC2_I2C_BC_INTF                           *((volatile unsigned int*)(0x42704020UL))
#define bM0P_MSC2_I2C_BC_BERF                           *((volatile unsigned int*)(0x42704024UL))
#define bM0P_MSC2_I2C_BC_INTE                           *((volatile unsigned int*)(0x42704028UL))
#define bM0P_MSC2_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x4270402CUL))
#define bM0P_MSC2_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x42704030UL))
#define bM0P_MSC2_I2C_BC_ACKE                           *((volatile unsigned int*)(0x42704034UL))
#define bM0P_MSC2_I2C_BC_OFITS                          *((volatile unsigned int*)(0x42704038UL))
#define bM0P_MSC2_I2C_BC_MSS                            *((volatile unsigned int*)(0x4270403CUL))
#define bM0P_MSC2_I2C_BS_BSS                            *((volatile unsigned int*)(0x42704080UL))
#define bM0P_MSC2_I2C_BS_STPCC                          *((volatile unsigned int*)(0x42704084UL))
#define bM0P_MSC2_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x42704088UL))
#define bM0P_MSC2_I2C_BS_ABL                            *((volatile unsigned int*)(0x4270408CUL))
#define bM0P_MSC2_I2C_BS_TRX                            *((volatile unsigned int*)(0x42704090UL))
#define bM0P_MSC2_I2C_BS_RAD                            *((volatile unsigned int*)(0x42704094UL))
#define bM0P_MSC2_I2C_BS_ACKF                           *((volatile unsigned int*)(0x42704098UL))
#define bM0P_MSC2_I2C_BS_FBB                            *((volatile unsigned int*)(0x4270409CUL))
#define bM0P_MSC2_I2C_SR_TBIF                           *((volatile unsigned int*)(0x427040A0UL))
#define bM0P_MSC2_I2C_SR_TDEF                           *((volatile unsigned int*)(0x427040A4UL))
#define bM0P_MSC2_I2C_SR_RDFF                           *((volatile unsigned int*)(0x427040A8UL))
#define bM0P_MSC2_I2C_SR_ORF                            *((volatile unsigned int*)(0x427040ACUL))
#define bM0P_MSC2_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x427040B0UL))
#define bM0P_MSC2_I2C_SR_TEFS                           *((volatile unsigned int*)(0x427040B8UL))
#define bM0P_MSC2_I2C_SR_RECLR                          *((volatile unsigned int*)(0x427040BCUL))
#define bM0P_MSC2_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x42704180UL))
#define bM0P_MSC2_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x42704184UL))
#define bM0P_MSC2_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x42704188UL))
#define bM0P_MSC2_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x4270418CUL))
#define bM0P_MSC2_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x42704190UL))
#define bM0P_MSC2_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x42704194UL))
#define bM0P_MSC2_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x42704198UL))
#define bM0P_MSC2_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x4270419CUL))
#define bM0P_MSC2_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x427041A0UL))
#define bM0P_MSC2_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x427041A4UL))
#define bM0P_MSC2_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x427041A8UL))
#define bM0P_MSC2_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x427041ACUL))
#define bM0P_MSC2_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x427041B0UL))
#define bM0P_MSC2_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x427041B4UL))
#define bM0P_MSC2_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x427041B8UL))
#define bM0P_MSC2_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x42704200UL))
#define bM0P_MSC2_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x42704204UL))
#define bM0P_MSC2_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x42704208UL))
#define bM0P_MSC2_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x4270420CUL))
#define bM0P_MSC2_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x42704210UL))
#define bM0P_MSC2_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x42704214UL))
#define bM0P_MSC2_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x42704218UL))
#define bM0P_MSC2_I2C_SA_AE                             *((volatile unsigned int*)(0x4270421CUL))
#define bM0P_MSC2_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x42704220UL))
#define bM0P_MSC2_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x42704224UL))
#define bM0P_MSC2_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x42704228UL))
#define bM0P_MSC2_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x4270422CUL))
#define bM0P_MSC2_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x42704230UL))
#define bM0P_MSC2_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x42704234UL))
#define bM0P_MSC2_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x42704238UL))
#define bM0P_MSC2_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x4270423CUL))
#define bM0P_MSC2_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x427043A0UL))
#define bM0P_MSC2_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x427043A4UL))
#define bM0P_MSC2_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x427043A8UL))
#define bM0P_MSC2_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x427043ACUL))
#define bM0P_MSC2_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x427043B0UL))
#define bM0P_MSC2_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x427043B4UL))
#define bM0P_MSC4_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E0008UL))
#define bM0P_MSC4_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E000CUL))
#define bM0P_MSC4_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E0014UL))
#define bM0P_MSC4_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E0018UL))
#define bM0P_MSC4_I2C_MR_MODE2                          *((volatile unsigned int*)(0x426E001CUL))
#define bM0P_MSC4_I2C_BC_INTF                           *((volatile unsigned int*)(0x426E0020UL))
#define bM0P_MSC4_I2C_BC_BERF                           *((volatile unsigned int*)(0x426E0024UL))
#define bM0P_MSC4_I2C_BC_INTE                           *((volatile unsigned int*)(0x426E0028UL))
#define bM0P_MSC4_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x426E002CUL))
#define bM0P_MSC4_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x426E0030UL))
#define bM0P_MSC4_I2C_BC_ACKE                           *((volatile unsigned int*)(0x426E0034UL))
#define bM0P_MSC4_I2C_BC_OFITS                          *((volatile unsigned int*)(0x426E0038UL))
#define bM0P_MSC4_I2C_BC_MSS                            *((volatile unsigned int*)(0x426E003CUL))
#define bM0P_MSC4_I2C_BS_BSS                            *((volatile unsigned int*)(0x426E0080UL))
#define bM0P_MSC4_I2C_BS_STPCC                          *((volatile unsigned int*)(0x426E0084UL))
#define bM0P_MSC4_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x426E0088UL))
#define bM0P_MSC4_I2C_BS_ABL                            *((volatile unsigned int*)(0x426E008CUL))
#define bM0P_MSC4_I2C_BS_TRX                            *((volatile unsigned int*)(0x426E0090UL))
#define bM0P_MSC4_I2C_BS_RAD                            *((volatile unsigned int*)(0x426E0094UL))
#define bM0P_MSC4_I2C_BS_ACKF                           *((volatile unsigned int*)(0x426E0098UL))
#define bM0P_MSC4_I2C_BS_FBB                            *((volatile unsigned int*)(0x426E009CUL))
#define bM0P_MSC4_I2C_SR_TBIF                           *((volatile unsigned int*)(0x426E00A0UL))
#define bM0P_MSC4_I2C_SR_TDEF                           *((volatile unsigned int*)(0x426E00A4UL))
#define bM0P_MSC4_I2C_SR_RDFF                           *((volatile unsigned int*)(0x426E00A8UL))
#define bM0P_MSC4_I2C_SR_ORF                            *((volatile unsigned int*)(0x426E00ACUL))
#define bM0P_MSC4_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x426E00B0UL))
#define bM0P_MSC4_I2C_SR_TEFS                           *((volatile unsigned int*)(0x426E00B8UL))
#define bM0P_MSC4_I2C_SR_RECLR                          *((volatile unsigned int*)(0x426E00BCUL))
#define bM0P_MSC4_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x426E0180UL))
#define bM0P_MSC4_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x426E0184UL))
#define bM0P_MSC4_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x426E0188UL))
#define bM0P_MSC4_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x426E018CUL))
#define bM0P_MSC4_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x426E0190UL))
#define bM0P_MSC4_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x426E0194UL))
#define bM0P_MSC4_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x426E0198UL))
#define bM0P_MSC4_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x426E019CUL))
#define bM0P_MSC4_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x426E01A0UL))
#define bM0P_MSC4_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x426E01A4UL))
#define bM0P_MSC4_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x426E01A8UL))
#define bM0P_MSC4_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x426E01ACUL))
#define bM0P_MSC4_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x426E01B0UL))
#define bM0P_MSC4_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x426E01B4UL))
#define bM0P_MSC4_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x426E01B8UL))
#define bM0P_MSC4_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x426E0200UL))
#define bM0P_MSC4_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x426E0204UL))
#define bM0P_MSC4_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x426E0208UL))
#define bM0P_MSC4_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x426E020CUL))
#define bM0P_MSC4_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x426E0210UL))
#define bM0P_MSC4_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x426E0214UL))
#define bM0P_MSC4_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x426E0218UL))
#define bM0P_MSC4_I2C_SA_AE                             *((volatile unsigned int*)(0x426E021CUL))
#define bM0P_MSC4_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x426E0220UL))
#define bM0P_MSC4_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x426E0224UL))
#define bM0P_MSC4_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x426E0228UL))
