tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC4_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x426E022CUL))
#define bM0P_MSC4_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x426E0230UL))
#define bM0P_MSC4_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x426E0234UL))
#define bM0P_MSC4_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x426E0238UL))
#define bM0P_MSC4_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x426E023CUL))
#define bM0P_MSC4_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x426E03A0UL))
#define bM0P_MSC4_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x426E03A4UL))
#define bM0P_MSC4_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x426E03A8UL))
#define bM0P_MSC4_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x426E03ACUL))
#define bM0P_MSC4_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x426E03B0UL))
#define bM0P_MSC4_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x426E03B4UL))
#define bM0P_MSC5_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E2008UL))
#define bM0P_MSC5_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E200CUL))
#define bM0P_MSC5_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E2014UL))
#define bM0P_MSC5_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E2018UL))
#define bM0P_MSC5_I2C_MR_MODE2                          *((volatile unsigned int*)(0x426E201CUL))
#define bM0P_MSC5_I2C_BC_INTF                           *((volatile unsigned int*)(0x426E2020UL))
#define bM0P_MSC5_I2C_BC_BERF                           *((volatile unsigned int*)(0x426E2024UL))
#define bM0P_MSC5_I2C_BC_INTE                           *((volatile unsigned int*)(0x426E2028UL))
#define bM0P_MSC5_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x426E202CUL))
#define bM0P_MSC5_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x426E2030UL))
#define bM0P_MSC5_I2C_BC_ACKE                           *((volatile unsigned int*)(0x426E2034UL))
#define bM0P_MSC5_I2C_BC_OFITS                          *((volatile unsigned int*)(0x426E2038UL))
#define bM0P_MSC5_I2C_BC_MSS                            *((volatile unsigned int*)(0x426E203CUL))
#define bM0P_MSC5_I2C_BS_BSS                            *((volatile unsigned int*)(0x426E2080UL))
#define bM0P_MSC5_I2C_BS_STPCC                          *((volatile unsigned int*)(0x426E2084UL))
#define bM0P_MSC5_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x426E2088UL))
#define bM0P_MSC5_I2C_BS_ABL                            *((volatile unsigned int*)(0x426E208CUL))
#define bM0P_MSC5_I2C_BS_TRX                            *((volatile unsigned int*)(0x426E2090UL))
#define bM0P_MSC5_I2C_BS_RAD                            *((volatile unsigned int*)(0x426E2094UL))
#define bM0P_MSC5_I2C_BS_ACKF                           *((volatile unsigned int*)(0x426E2098UL))
#define bM0P_MSC5_I2C_BS_FBB                            *((volatile unsigned int*)(0x426E209CUL))
#define bM0P_MSC5_I2C_SR_TBIF                           *((volatile unsigned int*)(0x426E20A0UL))
#define bM0P_MSC5_I2C_SR_TDEF                           *((volatile unsigned int*)(0x426E20A4UL))
#define bM0P_MSC5_I2C_SR_RDFF                           *((volatile unsigned int*)(0x426E20A8UL))
#define bM0P_MSC5_I2C_SR_ORF                            *((volatile unsigned int*)(0x426E20ACUL))
#define bM0P_MSC5_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x426E20B0UL))
#define bM0P_MSC5_I2C_SR_TEFS                           *((volatile unsigned int*)(0x426E20B8UL))
#define bM0P_MSC5_I2C_SR_RECLR                          *((volatile unsigned int*)(0x426E20BCUL))
#define bM0P_MSC5_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x426E2180UL))
#define bM0P_MSC5_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x426E2184UL))
#define bM0P_MSC5_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x426E2188UL))
#define bM0P_MSC5_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x426E218CUL))
#define bM0P_MSC5_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x426E2190UL))
#define bM0P_MSC5_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x426E2194UL))
#define bM0P_MSC5_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x426E2198UL))
#define bM0P_MSC5_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x426E219CUL))
#define bM0P_MSC5_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x426E21A0UL))
#define bM0P_MSC5_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x426E21A4UL))
#define bM0P_MSC5_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x426E21A8UL))
#define bM0P_MSC5_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x426E21ACUL))
#define bM0P_MSC5_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x426E21B0UL))
#define bM0P_MSC5_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x426E21B4UL))
#define bM0P_MSC5_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x426E21B8UL))
#define bM0P_MSC5_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x426E2200UL))
#define bM0P_MSC5_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x426E2204UL))
#define bM0P_MSC5_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x426E2208UL))
#define bM0P_MSC5_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x426E220CUL))
#define bM0P_MSC5_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x426E2210UL))
#define bM0P_MSC5_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x426E2214UL))
#define bM0P_MSC5_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x426E2218UL))
#define bM0P_MSC5_I2C_SA_AE                             *((volatile unsigned int*)(0x426E221CUL))
#define bM0P_MSC5_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x426E2220UL))
#define bM0P_MSC5_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x426E2224UL))
#define bM0P_MSC5_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x426E2228UL))
#define bM0P_MSC5_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x426E222CUL))
#define bM0P_MSC5_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x426E2230UL))
#define bM0P_MSC5_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x426E2234UL))
#define bM0P_MSC5_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x426E2238UL))
#define bM0P_MSC5_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x426E223CUL))
#define bM0P_MSC5_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x426E23A0UL))
#define bM0P_MSC5_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x426E23A4UL))
#define bM0P_MSC5_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x426E23A8UL))
#define bM0P_MSC5_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x426E23ACUL))
#define bM0P_MSC5_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x426E23B0UL))
#define bM0P_MSC5_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x426E23B4UL))
#define bM0P_MSC6_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E4008UL))
#define bM0P_MSC6_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E400CUL))
#define bM0P_MSC6_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E4014UL))
#define bM0P_MSC6_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E4018UL))
#define bM0P_MSC6_I2C_MR_MODE2                          *((volatile unsigned int*)(0x426E401CUL))
#define bM0P_MSC6_I2C_BC_INTF                           *((volatile unsigned int*)(0x426E4020UL))
#define bM0P_MSC6_I2C_BC_BERF                           *((volatile unsigned int*)(0x426E4024UL))
#define bM0P_MSC6_I2C_BC_INTE                           *((volatile unsigned int*)(0x426E4028UL))
#define bM0P_MSC6_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x426E402CUL))
#define bM0P_MSC6_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x426E4030UL))
#define bM0P_MSC6_I2C_BC_ACKE                           *((volatile unsigned int*)(0x426E4034UL))
#define bM0P_MSC6_I2C_BC_OFITS                          *((volatile unsigned int*)(0x426E4038UL))
#define bM0P_MSC6_I2C_BC_MSS                            *((volatile unsigned int*)(0x426E403CUL))
#define bM0P_MSC6_I2C_BS_BSS                            *((volatile unsigned int*)(0x426E4080UL))
#define bM0P_MSC6_I2C_BS_STPCC                          *((volatile unsigned int*)(0x426E4084UL))
#define bM0P_MSC6_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x426E4088UL))
#define bM0P_MSC6_I2C_BS_ABL                            *((volatile unsigned int*)(0x426E408CUL))
#define bM0P_MSC6_I2C_BS_TRX                            *((volatile unsigned int*)(0x426E4090UL))
#define bM0P_MSC6_I2C_BS_RAD                            *((volatile unsigned int*)(0x426E4094UL))
#define bM0P_MSC6_I2C_BS_ACKF                           *((volatile unsigned int*)(0x426E4098UL))
#define bM0P_MSC6_I2C_BS_FBB                            *((volatile unsigned int*)(0x426E409CUL))
#define bM0P_MSC6_I2C_SR_TBIF                           *((volatile unsigned int*)(0x426E40A0UL))
#define bM0P_MSC6_I2C_SR_TDEF                           *((volatile unsigned int*)(0x426E40A4UL))
#define bM0P_MSC6_I2C_SR_RDFF                           *((volatile unsigned int*)(0x426E40A8UL))
#define bM0P_MSC6_I2C_SR_ORF                            *((volatile unsigned int*)(0x426E40ACUL))
#define bM0P_MSC6_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x426E40B0UL))
#define bM0P_MSC6_I2C_SR_TEFS                           *((volatile unsigned int*)(0x426E40B8UL))
#define bM0P_MSC6_I2C_SR_RECLR                          *((volatile unsigned int*)(0x426E40BCUL))
#define bM0P_MSC6_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x426E4180UL))
#define bM0P_MSC6_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x426E4184UL))
#define bM0P_MSC6_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x426E4188UL))
#define bM0P_MSC6_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x426E418CUL))
#define bM0P_MSC6_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x426E4190UL))
#define bM0P_MSC6_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x426E4194UL))
#define bM0P_MSC6_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x426E4198UL))
#define bM0P_MSC6_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x426E419CUL))
#define bM0P_MSC6_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x426E41A0UL))
#define bM0P_MSC6_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x426E41A4UL))
#define bM0P_MSC6_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x426E41A8UL))
#define bM0P_MSC6_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x426E41ACUL))
#define bM0P_MSC6_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x426E41B0UL))
#define bM0P_MSC6_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x426E41B4UL))
#define bM0P_MSC6_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x426E41B8UL))
#define bM0P_MSC6_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x426E4200UL))
#define bM0P_MSC6_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x426E4204UL))
#define bM0P_MSC6_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x426E4208UL))
#define bM0P_MSC6_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x426E420CUL))
#define bM0P_MSC6_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x426E4210UL))
#define bM0P_MSC6_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x426E4214UL))
#define bM0P_MSC6_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x426E4218UL))
#define bM0P_MSC6_I2C_SA_AE                             *((volatile unsigned int*)(0x426E421CUL))
#define bM0P_MSC6_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x426E4220UL))
#define bM0P_MSC6_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x426E4224UL))
#define bM0P_MSC6_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x426E4228UL))
#define bM0P_MSC6_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x426E422CUL))
#define bM0P_MSC6_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x426E4230UL))
#define bM0P_MSC6_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x426E4234UL))
#define bM0P_MSC6_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x426E4238UL))
#define bM0P_MSC6_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x426E423CUL))
#define bM0P_MSC6_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x426E43A0UL))
#define bM0P_MSC6_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x426E43A4UL))
#define bM0P_MSC6_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x426E43A8UL))
#define bM0P_MSC6_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x426E43ACUL))
#define bM0P_MSC6_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x426E43B0UL))
#define bM0P_MSC6_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x426E43B4UL))
#define bM0P_MSC0_SPI_MR_DOE                            *((volatile unsigned int*)(0x42700000UL))
#define bM0P_MSC0_SPI_MR_CKE                            *((volatile unsigned int*)(0x42700004UL))
#define bM0P_MSC0_SPI_MR_TDS                            *((volatile unsigned int*)(0x42700008UL))
#define bM0P_MSC0_SPI_MR_CINV                           *((volatile unsigned int*)(0x4270000CUL))
#define bM0P_MSC0_SPI_MR_MODE0                          *((volatile unsigned int*)(0x42700014UL))
#define bM0P_MSC0_SPI_MR_MODE1                          *((volatile unsigned int*)(0x42700018UL))
#define bM0P_MSC0_SPI_MR_MODE2                          *((volatile unsigned int*)(0x4270001CUL))
#define bM0P_MSC0_SPI_CR_TXE                            *((volatile unsigned int*)(0x42700020UL))
#define bM0P_MSC0_SPI_CR_RXE                            *((volatile unsigned int*)(0x42700024UL))
#define bM0P_MSC0_SPI_CR_TBIE                           *((volatile unsigned int*)(0x42700028UL))
#define bM0P_MSC0_SPI_CR_TXIE                           *((volatile unsigned int*)(0x4270002CUL))
#define bM0P_MSC0_SPI_CR_RXIE                           *((volatile unsigned int*)(0x42700030UL))
#define bM0P_MSC0_SPI_CR_SPIMODE                        *((volatile unsigned int*)(0x42700034UL))
#define bM0P_MSC0_SPI_CR_MSS                            *((volatile unsigned int*)(0x42700038UL))
#define bM0P_MSC0_SPI_CR_PCL                            *((volatile unsigned int*)(0x4270003CUL))
#define bM0P_MSC0_SPI_ECR_DL0                           *((volatile unsigned int*)(0x42700080UL))
#define bM0P_MSC0_SPI_ECR_DL1                           *((volatile unsigned int*)(0x42700084UL))
#define bM0P_MSC0_SPI_ECR_DL2                           *((volatile unsigned int*)(0x42700088UL))
#define bM0P_MSC0_SPI_ECR_DTRWS0                        *((volatile unsigned int*)(0x4270008CUL))
#define bM0P_MSC0_SPI_ECR_DTRWS1                        *((volatile unsigned int*)(0x42700090UL))
#define bM0P_MSC0_SPI_ECR_CSFE                          *((volatile unsigned int*)(0x42700094UL))
#define bM0P_MSC0_SPI_ECR_DL3                           *((volatile unsigned int*)(0x42700098UL))
#define bM0P_MSC0_SPI_ECR_SOPS                          *((volatile unsigned int*)(0x4270009CUL))
#define bM0P_MSC0_SPI_SR_TBIF                           *((volatile unsigned int*)(0x427000A0UL))
#define bM0P_MSC0_SPI_SR_TDEF                           *((volatile unsigned int*)(0x427000A4UL))
#define bM0P_MSC0_SPI_SR_RDFF                           *((volatile unsigned int*)(0x427000A8UL))
#define bM0P_MSC0_SPI_SR_ORF                            *((volatile unsigned int*)(0x427000ACUL))
#define bM0P_MSC0_SPI_SR_RECLR                          *((volatile unsigned int*)(0x427000BCUL))
#define bM0P_MSC0_SPI_BRS_BRS0                          *((volatile unsigned int*)(0x42700180UL))
#define bM0P_MSC0_SPI_BRS_BRS1                          *((volatile unsigned int*)(0x42700184UL))
#define bM0P_MSC0_SPI_BRS_BRS2                          *((volatile unsigned int*)(0x42700188UL))
#define bM0P_MSC0_SPI_BRS_BRS3                          *((volatile unsigned int*)(0x4270018CUL))
#define bM0P_MSC0_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x42700190UL))
#define bM0P_MSC0_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x42700194UL))
#define bM0P_MSC0_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x42700198UL))
#define bM0P_MSC0_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x4270019CUL))
#define bM0P_MSC0_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x427001A0UL))
#define bM0P_MSC0_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x427001A4UL))
#define bM0P_MSC0_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x427001A8UL))
#define bM0P_MSC0_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x427001ACUL))
#define bM0P_MSC0_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x427001B0UL))
#define bM0P_MSC0_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x427001B4UL))
#define bM0P_MSC0_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x427001B8UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x42700380UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x42700384UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x42700388UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x4270038CUL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x42700390UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x42700394UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x42700398UL))
#define bM0P_MSC0_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x4270039CUL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x427003A0UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x427003A4UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x427003A8UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x427003ACUL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x427003B0UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x427003B4UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x427003B8UL))
#define bM0P_MSC0_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x427003BCUL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x42700400UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x42700404UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x42700408UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x4270040CUL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x42700410UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x42700414UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x42700418UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x4270041CUL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x42700420UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x42700424UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x42700428UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x4270042CUL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x42700430UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x42700434UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x42700438UL))
#define bM0P_MSC0_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x4270043CUL))
#define bM0P_MSC0_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x42700480UL))
#define bM0P_MSC0_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x42700484UL))
#define bM0P_MSC0_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x42700488UL))
#define bM0P_MSC0_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x4270048CUL))
#define bM0P_MSC0_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x42700490UL))
#define bM0P_MSC0_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x42700498UL))
#define bM0P_MSC0_SPI_EACR_TIE                          *((volatile unsigned int*)(0x4270049CUL))
#define bM0P_MSC0_SPI_EACR_TIF                          *((volatile unsigned int*)(0x427004A0UL))
#define bM0P_MSC0_SPI_EACR_CSER                         *((volatile unsigned int*)(0x427004ACUL))
#define bM0P_MSC0_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x427004B0UL))
#define bM0P_MSC0_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x427004B4UL))
#define bM0P_MSC0_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x42700500UL))
#define bM0P_MSC0_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x42700504UL))
#define bM0P_MSC0_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x42700508UL))
#define bM0P_MSC0_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x4270050CUL))
#define bM0P_MSC0_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x42700510UL))
#define bM0P_MSC0_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x42700514UL))
#define bM0P_MSC0_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x42700518UL))
#define bM0P_MSC0_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x4270051CUL))
#define bM0P_MSC0_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x42700520UL))
#define bM0P_MSC0_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x42700524UL))
#define bM0P_MSC0_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x42700528UL))
#define bM0P_MSC0_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x4270052CUL))
#define bM0P_MSC0_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x42700530UL))
#define bM0P_MSC0_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x42700534UL))
#define bM0P_MSC0_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x42700538UL))
#define bM0P_MSC0_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x4270053CUL))
#define bM0P_MSC0_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x42700580UL))
