tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC0_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x42700584UL))
#define bM0P_MSC0_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x42700588UL))
#define bM0P_MSC0_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x4270058CUL))
#define bM0P_MSC0_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x42700590UL))
#define bM0P_MSC0_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x42700594UL))
#define bM0P_MSC0_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x42700598UL))
#define bM0P_MSC0_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x4270059CUL))
#define bM0P_MSC0_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x427005A0UL))
#define bM0P_MSC0_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x427005A4UL))
#define bM0P_MSC0_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x427005A8UL))
#define bM0P_MSC0_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x427005ACUL))
#define bM0P_MSC0_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x427005B0UL))
#define bM0P_MSC0_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x427005B4UL))
#define bM0P_MSC0_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x427005B8UL))
#define bM0P_MSC0_SPI_TMC_TMC15                         *((volatile unsigned int*)(0x427005BCUL))
#define bM0P_MSC0_SPI_CSCR_CSOE                         *((volatile unsigned int*)(0x42700600UL))
#define bM0P_MSC0_SPI_CSCR_CSEN0                        *((volatile unsigned int*)(0x42700604UL))
#define bM0P_MSC0_SPI_CSCR_CSEN1                        *((volatile unsigned int*)(0x42700608UL))
#define bM0P_MSC0_SPI_CSCR_CSEN2                        *((volatile unsigned int*)(0x4270060CUL))
#define bM0P_MSC0_SPI_CSCR_CSEN3                        *((volatile unsigned int*)(0x42700610UL))
#define bM0P_MSC0_SPI_CSCR_CSLVS                        *((volatile unsigned int*)(0x42700614UL))
#define bM0P_MSC0_SPI_CSCR_CSTODIV0                     *((volatile unsigned int*)(0x42700618UL))
#define bM0P_MSC0_SPI_CSCR_CSTODIV1                     *((volatile unsigned int*)(0x4270061CUL))
#define bM0P_MSC0_SPI_CSCR_CSTODIV2                     *((volatile unsigned int*)(0x42700620UL))
#define bM0P_MSC0_SPI_CSCR_CSAH                         *((volatile unsigned int*)(0x42700624UL))
#define bM0P_MSC0_SPI_CSCR_CSAD0                        *((volatile unsigned int*)(0x42700628UL))
#define bM0P_MSC0_SPI_CSCR_CSAD1                        *((volatile unsigned int*)(0x4270062CUL))
#define bM0P_MSC0_SPI_CSCR_CSAE0                        *((volatile unsigned int*)(0x42700630UL))
#define bM0P_MSC0_SPI_CSCR_CSAE1                        *((volatile unsigned int*)(0x42700634UL))
#define bM0P_MSC0_SPI_CSCR_CSAS0                        *((volatile unsigned int*)(0x42700638UL))
#define bM0P_MSC0_SPI_CSCR_CSAS1                        *((volatile unsigned int*)(0x4270063CUL))
#define bM0P_MSC0_SPI_CSFR0_CS1DL0                      *((volatile unsigned int*)(0x42700680UL))
#define bM0P_MSC0_SPI_CSFR0_CS1DL1                      *((volatile unsigned int*)(0x42700684UL))
#define bM0P_MSC0_SPI_CSFR0_CS1DL2                      *((volatile unsigned int*)(0x42700688UL))
#define bM0P_MSC0_SPI_CSFR0_CS1DL3                      *((volatile unsigned int*)(0x4270068CUL))
#define bM0P_MSC0_SPI_CSFR0_CS1TDS                      *((volatile unsigned int*)(0x42700690UL))
#define bM0P_MSC0_SPI_CSFR0_CS1SPI                      *((volatile unsigned int*)(0x42700694UL))
#define bM0P_MSC0_SPI_CSFR0_CS1CINV                     *((volatile unsigned int*)(0x42700698UL))
#define bM0P_MSC0_SPI_CSFR0_CS1CSLVS                    *((volatile unsigned int*)(0x4270069CUL))
#define bM0P_MSC0_SPI_CSFR1_CS2DL0                      *((volatile unsigned int*)(0x427006A0UL))
#define bM0P_MSC0_SPI_CSFR1_CS2DL1                      *((volatile unsigned int*)(0x427006A4UL))
#define bM0P_MSC0_SPI_CSFR1_CS2DL2                      *((volatile unsigned int*)(0x427006A8UL))
#define bM0P_MSC0_SPI_CSFR1_CS2DL3                      *((volatile unsigned int*)(0x427006ACUL))
#define bM0P_MSC0_SPI_CSFR1_CS2TDS                      *((volatile unsigned int*)(0x427006B0UL))
#define bM0P_MSC0_SPI_CSFR1_CS2SPI                      *((volatile unsigned int*)(0x427006B4UL))
#define bM0P_MSC0_SPI_CSFR1_CS2CINV                     *((volatile unsigned int*)(0x427006B8UL))
#define bM0P_MSC0_SPI_CSFR1_CS2CSLVS                    *((volatile unsigned int*)(0x427006BCUL))
#define bM0P_MSC0_SPI_CSFR2_CS3DL0                      *((volatile unsigned int*)(0x42700700UL))
#define bM0P_MSC0_SPI_CSFR2_CS3DL1                      *((volatile unsigned int*)(0x42700704UL))
#define bM0P_MSC0_SPI_CSFR2_CS3DL2                      *((volatile unsigned int*)(0x42700708UL))
#define bM0P_MSC0_SPI_CSFR2_CS3DL3                      *((volatile unsigned int*)(0x4270070CUL))
#define bM0P_MSC0_SPI_CSFR2_CS3TDS                      *((volatile unsigned int*)(0x42700710UL))
#define bM0P_MSC0_SPI_CSFR2_CS3SPI                      *((volatile unsigned int*)(0x42700714UL))
#define bM0P_MSC0_SPI_CSFR2_CS3CINV                     *((volatile unsigned int*)(0x42700718UL))
#define bM0P_MSC0_SPI_CSFR2_CS3CSLVS                    *((volatile unsigned int*)(0x4270071CUL))
#define bM0P_MSC1_SPI_MR_DOE                            *((volatile unsigned int*)(0x42702000UL))
#define bM0P_MSC1_SPI_MR_CKE                            *((volatile unsigned int*)(0x42702004UL))
#define bM0P_MSC1_SPI_MR_TDS                            *((volatile unsigned int*)(0x42702008UL))
#define bM0P_MSC1_SPI_MR_CINV                           *((volatile unsigned int*)(0x4270200CUL))
#define bM0P_MSC1_SPI_MR_MODE0                          *((volatile unsigned int*)(0x42702014UL))
#define bM0P_MSC1_SPI_MR_MODE1                          *((volatile unsigned int*)(0x42702018UL))
#define bM0P_MSC1_SPI_MR_MODE2                          *((volatile unsigned int*)(0x4270201CUL))
#define bM0P_MSC1_SPI_CR_TXE                            *((volatile unsigned int*)(0x42702020UL))
#define bM0P_MSC1_SPI_CR_RXE                            *((volatile unsigned int*)(0x42702024UL))
#define bM0P_MSC1_SPI_CR_TBIE                           *((volatile unsigned int*)(0x42702028UL))
#define bM0P_MSC1_SPI_CR_TXIE                           *((volatile unsigned int*)(0x4270202CUL))
#define bM0P_MSC1_SPI_CR_RXIE                           *((volatile unsigned int*)(0x42702030UL))
#define bM0P_MSC1_SPI_CR_SPIMODE                        *((volatile unsigned int*)(0x42702034UL))
#define bM0P_MSC1_SPI_CR_MSS                            *((volatile unsigned int*)(0x42702038UL))
#define bM0P_MSC1_SPI_CR_PCL                            *((volatile unsigned int*)(0x4270203CUL))
#define bM0P_MSC1_SPI_ECR_DL0                           *((volatile unsigned int*)(0x42702080UL))
#define bM0P_MSC1_SPI_ECR_DL1                           *((volatile unsigned int*)(0x42702084UL))
#define bM0P_MSC1_SPI_ECR_DL2                           *((volatile unsigned int*)(0x42702088UL))
#define bM0P_MSC1_SPI_ECR_DTRWS0                        *((volatile unsigned int*)(0x4270208CUL))
#define bM0P_MSC1_SPI_ECR_DTRWS1                        *((volatile unsigned int*)(0x42702090UL))
#define bM0P_MSC1_SPI_ECR_CSFE                          *((volatile unsigned int*)(0x42702094UL))
#define bM0P_MSC1_SPI_ECR_DL3                           *((volatile unsigned int*)(0x42702098UL))
#define bM0P_MSC1_SPI_ECR_SOPS                          *((volatile unsigned int*)(0x4270209CUL))
#define bM0P_MSC1_SPI_SR_TBIF                           *((volatile unsigned int*)(0x427020A0UL))
#define bM0P_MSC1_SPI_SR_TDEF                           *((volatile unsigned int*)(0x427020A4UL))
#define bM0P_MSC1_SPI_SR_RDFF                           *((volatile unsigned int*)(0x427020A8UL))
#define bM0P_MSC1_SPI_SR_ORF                            *((volatile unsigned int*)(0x427020ACUL))
#define bM0P_MSC1_SPI_SR_RECLR                          *((volatile unsigned int*)(0x427020BCUL))
#define bM0P_MSC1_SPI_BRS_BRS0                          *((volatile unsigned int*)(0x42702180UL))
#define bM0P_MSC1_SPI_BRS_BRS1                          *((volatile unsigned int*)(0x42702184UL))
#define bM0P_MSC1_SPI_BRS_BRS2                          *((volatile unsigned int*)(0x42702188UL))
#define bM0P_MSC1_SPI_BRS_BRS3                          *((volatile unsigned int*)(0x4270218CUL))
#define bM0P_MSC1_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x42702190UL))
#define bM0P_MSC1_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x42702194UL))
#define bM0P_MSC1_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x42702198UL))
#define bM0P_MSC1_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x4270219CUL))
#define bM0P_MSC1_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x427021A0UL))
#define bM0P_MSC1_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x427021A4UL))
#define bM0P_MSC1_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x427021A8UL))
#define bM0P_MSC1_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x427021ACUL))
#define bM0P_MSC1_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x427021B0UL))
#define bM0P_MSC1_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x427021B4UL))
#define bM0P_MSC1_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x427021B8UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x42702380UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x42702384UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x42702388UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x4270238CUL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x42702390UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x42702394UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x42702398UL))
#define bM0P_MSC1_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x4270239CUL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x427023A0UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x427023A4UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x427023A8UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x427023ACUL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x427023B0UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x427023B4UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x427023B8UL))
#define bM0P_MSC1_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x427023BCUL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x42702400UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x42702404UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x42702408UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x4270240CUL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x42702410UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x42702414UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x42702418UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x4270241CUL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x42702420UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x42702424UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x42702428UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x4270242CUL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x42702430UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x42702434UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x42702438UL))
#define bM0P_MSC1_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x4270243CUL))
#define bM0P_MSC1_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x42702480UL))
#define bM0P_MSC1_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x42702484UL))
#define bM0P_MSC1_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x42702488UL))
#define bM0P_MSC1_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x4270248CUL))
#define bM0P_MSC1_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x42702490UL))
#define bM0P_MSC1_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x42702498UL))
#define bM0P_MSC1_SPI_EACR_TIE                          *((volatile unsigned int*)(0x4270249CUL))
#define bM0P_MSC1_SPI_EACR_TIF                          *((volatile unsigned int*)(0x427024A0UL))
#define bM0P_MSC1_SPI_EACR_CSER                         *((volatile unsigned int*)(0x427024ACUL))
#define bM0P_MSC1_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x427024B0UL))
#define bM0P_MSC1_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x427024B4UL))
#define bM0P_MSC1_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x42702500UL))
#define bM0P_MSC1_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x42702504UL))
#define bM0P_MSC1_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x42702508UL))
#define bM0P_MSC1_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x4270250CUL))
#define bM0P_MSC1_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x42702510UL))
#define bM0P_MSC1_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x42702514UL))
#define bM0P_MSC1_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x42702518UL))
#define bM0P_MSC1_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x4270251CUL))
#define bM0P_MSC1_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x42702520UL))
#define bM0P_MSC1_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x42702524UL))
#define bM0P_MSC1_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x42702528UL))
#define bM0P_MSC1_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x4270252CUL))
#define bM0P_MSC1_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x42702530UL))
#define bM0P_MSC1_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x42702534UL))
#define bM0P_MSC1_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x42702538UL))
#define bM0P_MSC1_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x4270253CUL))
#define bM0P_MSC1_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x42702580UL))
#define bM0P_MSC1_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x42702584UL))
#define bM0P_MSC1_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x42702588UL))
#define bM0P_MSC1_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x4270258CUL))
#define bM0P_MSC1_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x42702590UL))
#define bM0P_MSC1_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x42702594UL))
#define bM0P_MSC1_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x42702598UL))
#define bM0P_MSC1_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x4270259CUL))
#define bM0P_MSC1_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x427025A0UL))
#define bM0P_MSC1_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x427025A4UL))
#define bM0P_MSC1_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x427025A8UL))
#define bM0P_MSC1_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x427025ACUL))
#define bM0P_MSC1_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x427025B0UL))
#define bM0P_MSC1_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x427025B4UL))
#define bM0P_MSC1_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x427025B8UL))
#define bM0P_MSC1_SPI_TMC_TMC15                         *((volatile unsigned int*)(0x427025BCUL))
#define bM0P_MSC1_SPI_CSCR_CSOE                         *((volatile unsigned int*)(0x42702600UL))
#define bM0P_MSC1_SPI_CSCR_CSEN0                        *((volatile unsigned int*)(0x42702604UL))
#define bM0P_MSC1_SPI_CSCR_CSEN1                        *((volatile unsigned int*)(0x42702608UL))
#define bM0P_MSC1_SPI_CSCR_CSEN2                        *((volatile unsigned int*)(0x4270260CUL))
#define bM0P_MSC1_SPI_CSCR_CSEN3                        *((volatile unsigned int*)(0x42702610UL))
#define bM0P_MSC1_SPI_CSCR_CSLVS                        *((volatile unsigned int*)(0x42702614UL))
#define bM0P_MSC1_SPI_CSCR_CSTODIV0                     *((volatile unsigned int*)(0x42702618UL))
#define bM0P_MSC1_SPI_CSCR_CSTODIV1                     *((volatile unsigned int*)(0x4270261CUL))
#define bM0P_MSC1_SPI_CSCR_CSTODIV2                     *((volatile unsigned int*)(0x42702620UL))
#define bM0P_MSC1_SPI_CSCR_CSAH                         *((volatile unsigned int*)(0x42702624UL))
#define bM0P_MSC1_SPI_CSCR_CSAD0                        *((volatile unsigned int*)(0x42702628UL))
#define bM0P_MSC1_SPI_CSCR_CSAD1                        *((volatile unsigned int*)(0x4270262CUL))
#define bM0P_MSC1_SPI_CSCR_CSAE0                        *((volatile unsigned int*)(0x42702630UL))
#define bM0P_MSC1_SPI_CSCR_CSAE1                        *((volatile unsigned int*)(0x42702634UL))
#define bM0P_MSC1_SPI_CSCR_CSAS0                        *((volatile unsigned int*)(0x42702638UL))
#define bM0P_MSC1_SPI_CSCR_CSAS1                        *((volatile unsigned int*)(0x4270263CUL))
#define bM0P_MSC1_SPI_CSFR0_CS1DL0                      *((volatile unsigned int*)(0x42702680UL))
#define bM0P_MSC1_SPI_CSFR0_CS1DL1                      *((volatile unsigned int*)(0x42702684UL))
#define bM0P_MSC1_SPI_CSFR0_CS1DL2                      *((volatile unsigned int*)(0x42702688UL))
#define bM0P_MSC1_SPI_CSFR0_CS1DL3                      *((volatile unsigned int*)(0x4270268CUL))
#define bM0P_MSC1_SPI_CSFR0_CS1TDS                      *((volatile unsigned int*)(0x42702690UL))
#define bM0P_MSC1_SPI_CSFR0_CS1SPI                      *((volatile unsigned int*)(0x42702694UL))
#define bM0P_MSC1_SPI_CSFR0_CS1CINV                     *((volatile unsigned int*)(0x42702698UL))
#define bM0P_MSC1_SPI_CSFR0_CS1CSLVS                    *((volatile unsigned int*)(0x4270269CUL))
#define bM0P_MSC1_SPI_CSFR1_CS2DL0                      *((volatile unsigned int*)(0x427026A0UL))
#define bM0P_MSC1_SPI_CSFR1_CS2DL1                      *((volatile unsigned int*)(0x427026A4UL))
#define bM0P_MSC1_SPI_CSFR1_CS2DL2                      *((volatile unsigned int*)(0x427026A8UL))
#define bM0P_MSC1_SPI_CSFR1_CS2DL3                      *((volatile unsigned int*)(0x427026ACUL))
#define bM0P_MSC1_SPI_CSFR1_CS2TDS                      *((volatile unsigned int*)(0x427026B0UL))
#define bM0P_MSC1_SPI_CSFR1_CS2SPI                      *((volatile unsigned int*)(0x427026B4UL))
#define bM0P_MSC1_SPI_CSFR1_CS2CINV                     *((volatile unsigned int*)(0x427026B8UL))
#define bM0P_MSC1_SPI_CSFR1_CS2CSLVS                    *((volatile unsigned int*)(0x427026BCUL))
#define bM0P_MSC1_SPI_CSFR2_CS3DL0                      *((volatile unsigned int*)(0x42702700UL))
#define bM0P_MSC1_SPI_CSFR2_CS3DL1                      *((volatile unsigned int*)(0x42702704UL))
#define bM0P_MSC1_SPI_CSFR2_CS3DL2                      *((volatile unsigned int*)(0x42702708UL))
#define bM0P_MSC1_SPI_CSFR2_CS3DL3                      *((volatile unsigned int*)(0x4270270CUL))
#define bM0P_MSC1_SPI_CSFR2_CS3TDS                      *((volatile unsigned int*)(0x42702710UL))
#define bM0P_MSC1_SPI_CSFR2_CS3SPI                      *((volatile unsigned int*)(0x42702714UL))
#define bM0P_MSC1_SPI_CSFR2_CS3CINV                     *((volatile unsigned int*)(0x42702718UL))
#define bM0P_MSC1_SPI_CSFR2_CS3CSLVS                    *((volatile unsigned int*)(0x4270271CUL))
#define bM0P_MSC2_SPI_MR_DOE                            *((volatile unsigned int*)(0x42704000UL))
#define bM0P_MSC2_SPI_MR_CKE                            *((volatile unsigned int*)(0x42704004UL))
#define bM0P_MSC2_SPI_MR_TDS                            *((volatile unsigned int*)(0x42704008UL))
#define bM0P_MSC2_SPI_MR_CINV                           *((volatile unsigned int*)(0x4270400CUL))
#define bM0P_MSC2_SPI_MR_MODE0                          *((volatile unsigned int*)(0x42704014UL))
#define bM0P_MSC2_SPI_MR_MODE1                          *((volatile unsigned int*)(0x42704018UL))
#define bM0P_MSC2_SPI_MR_MODE2                          *((volatile unsigned int*)(0x4270401CUL))
#define bM0P_MSC2_SPI_CR_TXE                            *((volatile unsigned int*)(0x42704020UL))
#define bM0P_MSC2_SPI_CR_RXE                            *((volatile unsigned int*)(0x42704024UL))
#define bM0P_MSC2_SPI_CR_TBIE                           *((volatile unsigned int*)(0x42704028UL))
#define bM0P_MSC2_SPI_CR_TXIE                           *((volatile unsigned int*)(0x4270402CUL))
#define bM0P_MSC2_SPI_CR_RXIE                           *((volatile unsigned int*)(0x42704030UL))
#define bM0P_MSC2_SPI_CR_SPIMODE                        *((volatile unsigned int*)(0x42704034UL))
#define bM0P_MSC2_SPI_CR_MSS                            *((volatile unsigned int*)(0x42704038UL))
#define bM0P_MSC2_SPI_CR_PCL                            *((volatile unsigned int*)(0x4270403CUL))
#define bM0P_MSC2_SPI_ECR_DL0                           *((volatile unsigned int*)(0x42704080UL))
#define bM0P_MSC2_SPI_ECR_DL1                           *((volatile unsigned int*)(0x42704084UL))
#define bM0P_MSC2_SPI_ECR_DL2                           *((volatile unsigned int*)(0x42704088UL))
#define bM0P_MSC2_SPI_ECR_DTRWS0                        *((volatile unsigned int*)(0x4270408CUL))
#define bM0P_MSC2_SPI_ECR_DTRWS1                        *((volatile unsigned int*)(0x42704090UL))
#define bM0P_MSC2_SPI_ECR_CSFE                          *((volatile unsigned int*)(0x42704094UL))
#define bM0P_MSC2_SPI_ECR_DL3                           *((volatile unsigned int*)(0x42704098UL))
#define bM0P_MSC2_SPI_ECR_SOPS                          *((volatile unsigned int*)(0x4270409CUL))
#define bM0P_MSC2_SPI_SR_TBIF                           *((volatile unsigned int*)(0x427040A0UL))
#define bM0P_MSC2_SPI_SR_TDEF                           *((volatile unsigned int*)(0x427040A4UL))
#define bM0P_MSC2_SPI_SR_RDFF                           *((volatile unsigned int*)(0x427040A8UL))
#define bM0P_MSC2_SPI_SR_ORF                            *((volatile unsigned int*)(0x427040ACUL))
#define bM0P_MSC2_SPI_SR_RECLR                          *((volatile unsigned int*)(0x427040BCUL))
#define bM0P_MSC2_SPI_BRS_BRS0                          *((volatile unsigned int*)(0x42704180UL))
#define bM0P_MSC2_SPI_BRS_BRS1                          *((volatile unsigned int*)(0x42704184UL))
#define bM0P_MSC2_SPI_BRS_BRS2                          *((volatile unsigned int*)(0x42704188UL))
