tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC2_SPI_BRS_BRS3                          *((volatile unsigned int*)(0x4270418CUL))
#define bM0P_MSC2_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x42704190UL))
#define bM0P_MSC2_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x42704194UL))
#define bM0P_MSC2_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x42704198UL))
#define bM0P_MSC2_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x4270419CUL))
#define bM0P_MSC2_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x427041A0UL))
#define bM0P_MSC2_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x427041A4UL))
#define bM0P_MSC2_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x427041A8UL))
#define bM0P_MSC2_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x427041ACUL))
#define bM0P_MSC2_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x427041B0UL))
#define bM0P_MSC2_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x427041B4UL))
#define bM0P_MSC2_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x427041B8UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x42704380UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x42704384UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x42704388UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x4270438CUL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x42704390UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x42704394UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x42704398UL))
#define bM0P_MSC2_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x4270439CUL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x427043A0UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x427043A4UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x427043A8UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x427043ACUL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x427043B0UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x427043B4UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x427043B8UL))
#define bM0P_MSC2_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x427043BCUL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x42704400UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x42704404UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x42704408UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x4270440CUL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x42704410UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x42704414UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x42704418UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x4270441CUL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x42704420UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x42704424UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x42704428UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x4270442CUL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x42704430UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x42704434UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x42704438UL))
#define bM0P_MSC2_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x4270443CUL))
#define bM0P_MSC2_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x42704480UL))
#define bM0P_MSC2_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x42704484UL))
#define bM0P_MSC2_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x42704488UL))
#define bM0P_MSC2_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x4270448CUL))
#define bM0P_MSC2_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x42704490UL))
#define bM0P_MSC2_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x42704498UL))
#define bM0P_MSC2_SPI_EACR_TIE                          *((volatile unsigned int*)(0x4270449CUL))
#define bM0P_MSC2_SPI_EACR_TIF                          *((volatile unsigned int*)(0x427044A0UL))
#define bM0P_MSC2_SPI_EACR_CSER                         *((volatile unsigned int*)(0x427044ACUL))
#define bM0P_MSC2_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x427044B0UL))
#define bM0P_MSC2_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x427044B4UL))
#define bM0P_MSC2_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x42704500UL))
#define bM0P_MSC2_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x42704504UL))
#define bM0P_MSC2_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x42704508UL))
#define bM0P_MSC2_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x4270450CUL))
#define bM0P_MSC2_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x42704510UL))
#define bM0P_MSC2_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x42704514UL))
#define bM0P_MSC2_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x42704518UL))
#define bM0P_MSC2_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x4270451CUL))
#define bM0P_MSC2_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x42704520UL))
#define bM0P_MSC2_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x42704524UL))
#define bM0P_MSC2_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x42704528UL))
#define bM0P_MSC2_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x4270452CUL))
#define bM0P_MSC2_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x42704530UL))
#define bM0P_MSC2_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x42704534UL))
#define bM0P_MSC2_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x42704538UL))
#define bM0P_MSC2_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x4270453CUL))
#define bM0P_MSC2_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x42704580UL))
#define bM0P_MSC2_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x42704584UL))
#define bM0P_MSC2_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x42704588UL))
#define bM0P_MSC2_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x4270458CUL))
#define bM0P_MSC2_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x42704590UL))
#define bM0P_MSC2_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x42704594UL))
#define bM0P_MSC2_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x42704598UL))
#define bM0P_MSC2_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x4270459CUL))
#define bM0P_MSC2_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x427045A0UL))
#define bM0P_MSC2_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x427045A4UL))
#define bM0P_MSC2_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x427045A8UL))
#define bM0P_MSC2_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x427045ACUL))
#define bM0P_MSC2_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x427045B0UL))
#define bM0P_MSC2_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x427045B4UL))
#define bM0P_MSC2_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x427045B8UL))
#define bM0P_MSC2_SPI_TMC_TMC15                         *((volatile unsigned int*)(0x427045BCUL))
#define bM0P_MSC2_SPI_CSCR_CSOE                         *((volatile unsigned int*)(0x42704600UL))
#define bM0P_MSC2_SPI_CSCR_CSEN0                        *((volatile unsigned int*)(0x42704604UL))
#define bM0P_MSC2_SPI_CSCR_CSEN1                        *((volatile unsigned int*)(0x42704608UL))
#define bM0P_MSC2_SPI_CSCR_CSEN2                        *((volatile unsigned int*)(0x4270460CUL))
#define bM0P_MSC2_SPI_CSCR_CSEN3                        *((volatile unsigned int*)(0x42704610UL))
#define bM0P_MSC2_SPI_CSCR_CSLVS                        *((volatile unsigned int*)(0x42704614UL))
#define bM0P_MSC2_SPI_CSCR_CSTODIV0                     *((volatile unsigned int*)(0x42704618UL))
#define bM0P_MSC2_SPI_CSCR_CSTODIV1                     *((volatile unsigned int*)(0x4270461CUL))
#define bM0P_MSC2_SPI_CSCR_CSTODIV2                     *((volatile unsigned int*)(0x42704620UL))
#define bM0P_MSC2_SPI_CSCR_CSAH                         *((volatile unsigned int*)(0x42704624UL))
#define bM0P_MSC2_SPI_CSCR_CSAD0                        *((volatile unsigned int*)(0x42704628UL))
#define bM0P_MSC2_SPI_CSCR_CSAD1                        *((volatile unsigned int*)(0x4270462CUL))
#define bM0P_MSC2_SPI_CSCR_CSAE0                        *((volatile unsigned int*)(0x42704630UL))
#define bM0P_MSC2_SPI_CSCR_CSAE1                        *((volatile unsigned int*)(0x42704634UL))
#define bM0P_MSC2_SPI_CSCR_CSAS0                        *((volatile unsigned int*)(0x42704638UL))
#define bM0P_MSC2_SPI_CSCR_CSAS1                        *((volatile unsigned int*)(0x4270463CUL))
#define bM0P_MSC2_SPI_CSFR0_CS1DL0                      *((volatile unsigned int*)(0x42704680UL))
#define bM0P_MSC2_SPI_CSFR0_CS1DL1                      *((volatile unsigned int*)(0x42704684UL))
#define bM0P_MSC2_SPI_CSFR0_CS1DL2                      *((volatile unsigned int*)(0x42704688UL))
#define bM0P_MSC2_SPI_CSFR0_CS1DL3                      *((volatile unsigned int*)(0x4270468CUL))
#define bM0P_MSC2_SPI_CSFR0_CS1TDS                      *((volatile unsigned int*)(0x42704690UL))
#define bM0P_MSC2_SPI_CSFR0_CS1SPI                      *((volatile unsigned int*)(0x42704694UL))
#define bM0P_MSC2_SPI_CSFR0_CS1CINV                     *((volatile unsigned int*)(0x42704698UL))
#define bM0P_MSC2_SPI_CSFR0_CS1CSLVS                    *((volatile unsigned int*)(0x4270469CUL))
#define bM0P_MSC2_SPI_CSFR1_CS2DL0                      *((volatile unsigned int*)(0x427046A0UL))
#define bM0P_MSC2_SPI_CSFR1_CS2DL1                      *((volatile unsigned int*)(0x427046A4UL))
#define bM0P_MSC2_SPI_CSFR1_CS2DL2                      *((volatile unsigned int*)(0x427046A8UL))
#define bM0P_MSC2_SPI_CSFR1_CS2DL3                      *((volatile unsigned int*)(0x427046ACUL))
#define bM0P_MSC2_SPI_CSFR1_CS2TDS                      *((volatile unsigned int*)(0x427046B0UL))
#define bM0P_MSC2_SPI_CSFR1_CS2SPI                      *((volatile unsigned int*)(0x427046B4UL))
#define bM0P_MSC2_SPI_CSFR1_CS2CINV                     *((volatile unsigned int*)(0x427046B8UL))
#define bM0P_MSC2_SPI_CSFR1_CS2CSLVS                    *((volatile unsigned int*)(0x427046BCUL))
#define bM0P_MSC2_SPI_CSFR2_CS3DL0                      *((volatile unsigned int*)(0x42704700UL))
#define bM0P_MSC2_SPI_CSFR2_CS3DL1                      *((volatile unsigned int*)(0x42704704UL))
#define bM0P_MSC2_SPI_CSFR2_CS3DL2                      *((volatile unsigned int*)(0x42704708UL))
#define bM0P_MSC2_SPI_CSFR2_CS3DL3                      *((volatile unsigned int*)(0x4270470CUL))
#define bM0P_MSC2_SPI_CSFR2_CS3TDS                      *((volatile unsigned int*)(0x42704710UL))
#define bM0P_MSC2_SPI_CSFR2_CS3SPI                      *((volatile unsigned int*)(0x42704714UL))
#define bM0P_MSC2_SPI_CSFR2_CS3CINV                     *((volatile unsigned int*)(0x42704718UL))
#define bM0P_MSC2_SPI_CSFR2_CS3CSLVS                    *((volatile unsigned int*)(0x4270471CUL))
#define bM0P_MSC4_SPI_MR_DOE                            *((volatile unsigned int*)(0x426E0000UL))
#define bM0P_MSC4_SPI_MR_CKE                            *((volatile unsigned int*)(0x426E0004UL))
#define bM0P_MSC4_SPI_MR_TDS                            *((volatile unsigned int*)(0x426E0008UL))
#define bM0P_MSC4_SPI_MR_CINV                           *((volatile unsigned int*)(0x426E000CUL))
#define bM0P_MSC4_SPI_MR_MODE0                          *((volatile unsigned int*)(0x426E0014UL))
#define bM0P_MSC4_SPI_MR_MODE1                          *((volatile unsigned int*)(0x426E0018UL))
#define bM0P_MSC4_SPI_MR_MODE2                          *((volatile unsigned int*)(0x426E001CUL))
#define bM0P_MSC4_SPI_CR_TXE                            *((volatile unsigned int*)(0x426E0020UL))
#define bM0P_MSC4_SPI_CR_RXE                            *((volatile unsigned int*)(0x426E0024UL))
#define bM0P_MSC4_SPI_CR_TBIE                           *((volatile unsigned int*)(0x426E0028UL))
#define bM0P_MSC4_SPI_CR_TXIE                           *((volatile unsigned int*)(0x426E002CUL))
#define bM0P_MSC4_SPI_CR_RXIE                           *((volatile unsigned int*)(0x426E0030UL))
#define bM0P_MSC4_SPI_CR_SPIMODE                        *((volatile unsigned int*)(0x426E0034UL))
#define bM0P_MSC4_SPI_CR_MSS                            *((volatile unsigned int*)(0x426E0038UL))
#define bM0P_MSC4_SPI_CR_PCL                            *((volatile unsigned int*)(0x426E003CUL))
#define bM0P_MSC4_SPI_ECR_DL0                           *((volatile unsigned int*)(0x426E0080UL))
#define bM0P_MSC4_SPI_ECR_DL1                           *((volatile unsigned int*)(0x426E0084UL))
#define bM0P_MSC4_SPI_ECR_DL2                           *((volatile unsigned int*)(0x426E0088UL))
#define bM0P_MSC4_SPI_ECR_DTRWS0                        *((volatile unsigned int*)(0x426E008CUL))
#define bM0P_MSC4_SPI_ECR_DTRWS1                        *((volatile unsigned int*)(0x426E0090UL))
#define bM0P_MSC4_SPI_ECR_CSFE                          *((volatile unsigned int*)(0x426E0094UL))
#define bM0P_MSC4_SPI_ECR_DL3                           *((volatile unsigned int*)(0x426E0098UL))
#define bM0P_MSC4_SPI_ECR_SOPS                          *((volatile unsigned int*)(0x426E009CUL))
#define bM0P_MSC4_SPI_SR_TBIF                           *((volatile unsigned int*)(0x426E00A0UL))
#define bM0P_MSC4_SPI_SR_TDEF                           *((volatile unsigned int*)(0x426E00A4UL))
#define bM0P_MSC4_SPI_SR_RDFF                           *((volatile unsigned int*)(0x426E00A8UL))
#define bM0P_MSC4_SPI_SR_ORF                            *((volatile unsigned int*)(0x426E00ACUL))
#define bM0P_MSC4_SPI_SR_RECLR                          *((volatile unsigned int*)(0x426E00BCUL))
#define bM0P_MSC4_SPI_BRS_BRS0                          *((volatile unsigned int*)(0x426E0180UL))
#define bM0P_MSC4_SPI_BRS_BRS1                          *((volatile unsigned int*)(0x426E0184UL))
#define bM0P_MSC4_SPI_BRS_BRS2                          *((volatile unsigned int*)(0x426E0188UL))
#define bM0P_MSC4_SPI_BRS_BRS3                          *((volatile unsigned int*)(0x426E018CUL))
#define bM0P_MSC4_SPI_BRS_BRS4                          *((volatile unsigned int*)(0x426E0190UL))
#define bM0P_MSC4_SPI_BRS_BRS5                          *((volatile unsigned int*)(0x426E0194UL))
#define bM0P_MSC4_SPI_BRS_BRS6                          *((volatile unsigned int*)(0x426E0198UL))
#define bM0P_MSC4_SPI_BRS_BRS7                          *((volatile unsigned int*)(0x426E019CUL))
#define bM0P_MSC4_SPI_BRS_BRS8                          *((volatile unsigned int*)(0x426E01A0UL))
#define bM0P_MSC4_SPI_BRS_BRS9                          *((volatile unsigned int*)(0x426E01A4UL))
#define bM0P_MSC4_SPI_BRS_BRS10                         *((volatile unsigned int*)(0x426E01A8UL))
#define bM0P_MSC4_SPI_BRS_BRS11                         *((volatile unsigned int*)(0x426E01ACUL))
#define bM0P_MSC4_SPI_BRS_BRS12                         *((volatile unsigned int*)(0x426E01B0UL))
#define bM0P_MSC4_SPI_BRS_BRS13                         *((volatile unsigned int*)(0x426E01B4UL))
#define bM0P_MSC4_SPI_BRS_BRS14                         *((volatile unsigned int*)(0x426E01B8UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY0                    *((volatile unsigned int*)(0x426E0380UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY1                    *((volatile unsigned int*)(0x426E0384UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x426E0388UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x426E038CUL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x426E0390UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x426E0394UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x426E0398UL))
#define bM0P_MSC4_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x426E039CUL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x426E03A0UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x426E03A4UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x426E03A8UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x426E03ACUL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x426E03B0UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x426E03B4UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x426E03B8UL))
#define bM0P_MSC4_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x426E03BCUL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x426E0400UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x426E0404UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x426E0408UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x426E040CUL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x426E0410UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x426E0414UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x426E0418UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x426E041CUL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x426E0420UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x426E0424UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x426E0428UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x426E042CUL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x426E0430UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x426E0434UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x426E0438UL))
#define bM0P_MSC4_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x426E043CUL))
#define bM0P_MSC4_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x426E0480UL))
#define bM0P_MSC4_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x426E0484UL))
#define bM0P_MSC4_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x426E0488UL))
#define bM0P_MSC4_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x426E048CUL))
#define bM0P_MSC4_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x426E0490UL))
#define bM0P_MSC4_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x426E0498UL))
#define bM0P_MSC4_SPI_EACR_TIE                          *((volatile unsigned int*)(0x426E049CUL))
#define bM0P_MSC4_SPI_EACR_TIF                          *((volatile unsigned int*)(0x426E04A0UL))
#define bM0P_MSC4_SPI_EACR_CSER                         *((volatile unsigned int*)(0x426E04ACUL))
#define bM0P_MSC4_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x426E04B0UL))
#define bM0P_MSC4_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x426E04B4UL))
#define bM0P_MSC4_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x426E0500UL))
#define bM0P_MSC4_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x426E0504UL))
#define bM0P_MSC4_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x426E0508UL))
#define bM0P_MSC4_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x426E050CUL))
#define bM0P_MSC4_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x426E0510UL))
#define bM0P_MSC4_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x426E0514UL))
#define bM0P_MSC4_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x426E0518UL))
#define bM0P_MSC4_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x426E051CUL))
#define bM0P_MSC4_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x426E0520UL))
#define bM0P_MSC4_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x426E0524UL))
#define bM0P_MSC4_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x426E0528UL))
#define bM0P_MSC4_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x426E052CUL))
#define bM0P_MSC4_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x426E0530UL))
#define bM0P_MSC4_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x426E0534UL))
#define bM0P_MSC4_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x426E0538UL))
#define bM0P_MSC4_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x426E053CUL))
#define bM0P_MSC4_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x426E0580UL))
#define bM0P_MSC4_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x426E0584UL))
#define bM0P_MSC4_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x426E0588UL))
#define bM0P_MSC4_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x426E058CUL))
#define bM0P_MSC4_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x426E0590UL))
#define bM0P_MSC4_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x426E0594UL))
#define bM0P_MSC4_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x426E0598UL))
#define bM0P_MSC4_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x426E059CUL))
#define bM0P_MSC4_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x426E05A0UL))
#define bM0P_MSC4_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x426E05A4UL))
#define bM0P_MSC4_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x426E05A8UL))
#define bM0P_MSC4_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x426E05ACUL))
#define bM0P_MSC4_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x426E05B0UL))
#define bM0P_MSC4_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x426E05B4UL))
#define bM0P_MSC4_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x426E05B8UL))
