tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY2                    *((volatile unsigned int*)(0x426E4388UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY3                    *((volatile unsigned int*)(0x426E438CUL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY4                    *((volatile unsigned int*)(0x426E4390UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY5                    *((volatile unsigned int*)(0x426E4394UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY6                    *((volatile unsigned int*)(0x426E4398UL))
#define bM0P_MSC6_SPI_CSTMG0_CSHDLY7                    *((volatile unsigned int*)(0x426E439CUL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY0                    *((volatile unsigned int*)(0x426E43A0UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY1                    *((volatile unsigned int*)(0x426E43A4UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY2                    *((volatile unsigned int*)(0x426E43A8UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY3                    *((volatile unsigned int*)(0x426E43ACUL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY4                    *((volatile unsigned int*)(0x426E43B0UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY5                    *((volatile unsigned int*)(0x426E43B4UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY6                    *((volatile unsigned int*)(0x426E43B8UL))
#define bM0P_MSC6_SPI_CSTMG1_CSSDLY7                    *((volatile unsigned int*)(0x426E43BCUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS0                     *((volatile unsigned int*)(0x426E4400UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS1                     *((volatile unsigned int*)(0x426E4404UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS2                     *((volatile unsigned int*)(0x426E4408UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS3                     *((volatile unsigned int*)(0x426E440CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS4                     *((volatile unsigned int*)(0x426E4410UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS5                     *((volatile unsigned int*)(0x426E4414UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS6                     *((volatile unsigned int*)(0x426E4418UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS7                     *((volatile unsigned int*)(0x426E441CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS8                     *((volatile unsigned int*)(0x426E4420UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS9                     *((volatile unsigned int*)(0x426E4424UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS10                    *((volatile unsigned int*)(0x426E4428UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS11                    *((volatile unsigned int*)(0x426E442CUL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS12                    *((volatile unsigned int*)(0x426E4430UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS13                    *((volatile unsigned int*)(0x426E4434UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS14                    *((volatile unsigned int*)(0x426E4438UL))
#define bM0P_MSC6_SPI_CSTMG32_CSDS15                    *((volatile unsigned int*)(0x426E443CUL))
#define bM0P_MSC6_SPI_EACR_TMRE                         *((volatile unsigned int*)(0x426E4480UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV0                      *((volatile unsigned int*)(0x426E4484UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV1                      *((volatile unsigned int*)(0x426E4488UL))
#define bM0P_MSC6_SPI_EACR_CLKDIV2                      *((volatile unsigned int*)(0x426E448CUL))
#define bM0P_MSC6_SPI_EACR_CLKDIV3                      *((volatile unsigned int*)(0x426E4490UL))
#define bM0P_MSC6_SPI_EACR_SYNTE                        *((volatile unsigned int*)(0x426E4498UL))
#define bM0P_MSC6_SPI_EACR_TIE                          *((volatile unsigned int*)(0x426E449CUL))
#define bM0P_MSC6_SPI_EACR_TIF                          *((volatile unsigned int*)(0x426E44A0UL))
#define bM0P_MSC6_SPI_EACR_CSER                         *((volatile unsigned int*)(0x426E44ACUL))
#define bM0P_MSC6_SPI_EACR_CSEIE                        *((volatile unsigned int*)(0x426E44B0UL))
#define bM0P_MSC6_SPI_EACR_TBEE                         *((volatile unsigned int*)(0x426E44B4UL))
#define bM0P_MSC6_SPI_TMR_TMR0                          *((volatile unsigned int*)(0x426E4500UL))
#define bM0P_MSC6_SPI_TMR_TMR1                          *((volatile unsigned int*)(0x426E4504UL))
#define bM0P_MSC6_SPI_TMR_TMR2                          *((volatile unsigned int*)(0x426E4508UL))
#define bM0P_MSC6_SPI_TMR_TMR3                          *((volatile unsigned int*)(0x426E450CUL))
#define bM0P_MSC6_SPI_TMR_TMR4                          *((volatile unsigned int*)(0x426E4510UL))
#define bM0P_MSC6_SPI_TMR_TMR5                          *((volatile unsigned int*)(0x426E4514UL))
#define bM0P_MSC6_SPI_TMR_TMR6                          *((volatile unsigned int*)(0x426E4518UL))
#define bM0P_MSC6_SPI_TMR_TMR7                          *((volatile unsigned int*)(0x426E451CUL))
#define bM0P_MSC6_SPI_TMR_TMR8                          *((volatile unsigned int*)(0x426E4520UL))
#define bM0P_MSC6_SPI_TMR_TMR9                          *((volatile unsigned int*)(0x426E4524UL))
#define bM0P_MSC6_SPI_TMR_TMR10                         *((volatile unsigned int*)(0x426E4528UL))
#define bM0P_MSC6_SPI_TMR_TMR11                         *((volatile unsigned int*)(0x426E452CUL))
#define bM0P_MSC6_SPI_TMR_TMR12                         *((volatile unsigned int*)(0x426E4530UL))
#define bM0P_MSC6_SPI_TMR_TMR13                         *((volatile unsigned int*)(0x426E4534UL))
#define bM0P_MSC6_SPI_TMR_TMR14                         *((volatile unsigned int*)(0x426E4538UL))
#define bM0P_MSC6_SPI_TMR_TMR15                         *((volatile unsigned int*)(0x426E453CUL))
#define bM0P_MSC6_SPI_TMC_TMC0                          *((volatile unsigned int*)(0x426E4580UL))
#define bM0P_MSC6_SPI_TMC_TMC1                          *((volatile unsigned int*)(0x426E4584UL))
#define bM0P_MSC6_SPI_TMC_TMC2                          *((volatile unsigned int*)(0x426E4588UL))
#define bM0P_MSC6_SPI_TMC_TMC3                          *((volatile unsigned int*)(0x426E458CUL))
#define bM0P_MSC6_SPI_TMC_TMC4                          *((volatile unsigned int*)(0x426E4590UL))
#define bM0P_MSC6_SPI_TMC_TMC5                          *((volatile unsigned int*)(0x426E4594UL))
#define bM0P_MSC6_SPI_TMC_TMC6                          *((volatile unsigned int*)(0x426E4598UL))
#define bM0P_MSC6_SPI_TMC_TMC7                          *((volatile unsigned int*)(0x426E459CUL))
#define bM0P_MSC6_SPI_TMC_TMC8                          *((volatile unsigned int*)(0x426E45A0UL))
#define bM0P_MSC6_SPI_TMC_TMC9                          *((volatile unsigned int*)(0x426E45A4UL))
#define bM0P_MSC6_SPI_TMC_TMC10                         *((volatile unsigned int*)(0x426E45A8UL))
#define bM0P_MSC6_SPI_TMC_TMC11                         *((volatile unsigned int*)(0x426E45ACUL))
#define bM0P_MSC6_SPI_TMC_TMC12                         *((volatile unsigned int*)(0x426E45B0UL))
#define bM0P_MSC6_SPI_TMC_TMC13                         *((volatile unsigned int*)(0x426E45B4UL))
#define bM0P_MSC6_SPI_TMC_TMC14                         *((volatile unsigned int*)(0x426E45B8UL))
#define bM0P_MSC6_SPI_TMC_TMC15                         *((volatile unsigned int*)(0x426E45BCUL))
#define bM0P_MSC6_SPI_CSCR_CSOE                         *((volatile unsigned int*)(0x426E4600UL))
#define bM0P_MSC6_SPI_CSCR_CSEN0                        *((volatile unsigned int*)(0x426E4604UL))
#define bM0P_MSC6_SPI_CSCR_CSEN1                        *((volatile unsigned int*)(0x426E4608UL))
#define bM0P_MSC6_SPI_CSCR_CSEN2                        *((volatile unsigned int*)(0x426E460CUL))
#define bM0P_MSC6_SPI_CSCR_CSEN3                        *((volatile unsigned int*)(0x426E4610UL))
#define bM0P_MSC6_SPI_CSCR_CSLVS                        *((volatile unsigned int*)(0x426E4614UL))
#define bM0P_MSC6_SPI_CSCR_CSTODIV0                     *((volatile unsigned int*)(0x426E4618UL))
#define bM0P_MSC6_SPI_CSCR_CSTODIV1                     *((volatile unsigned int*)(0x426E461CUL))
#define bM0P_MSC6_SPI_CSCR_CSTODIV2                     *((volatile unsigned int*)(0x426E4620UL))
#define bM0P_MSC6_SPI_CSCR_CSAH                         *((volatile unsigned int*)(0x426E4624UL))
#define bM0P_MSC6_SPI_CSCR_CSAD0                        *((volatile unsigned int*)(0x426E4628UL))
#define bM0P_MSC6_SPI_CSCR_CSAD1                        *((volatile unsigned int*)(0x426E462CUL))
#define bM0P_MSC6_SPI_CSCR_CSAE0                        *((volatile unsigned int*)(0x426E4630UL))
#define bM0P_MSC6_SPI_CSCR_CSAE1                        *((volatile unsigned int*)(0x426E4634UL))
#define bM0P_MSC6_SPI_CSCR_CSAS0                        *((volatile unsigned int*)(0x426E4638UL))
#define bM0P_MSC6_SPI_CSCR_CSAS1                        *((volatile unsigned int*)(0x426E463CUL))
#define bM0P_MSC6_SPI_CSFR0_CS1DL0                      *((volatile unsigned int*)(0x426E4680UL))
#define bM0P_MSC6_SPI_CSFR0_CS1DL1                      *((volatile unsigned int*)(0x426E4684UL))
#define bM0P_MSC6_SPI_CSFR0_CS1DL2                      *((volatile unsigned int*)(0x426E4688UL))
#define bM0P_MSC6_SPI_CSFR0_CS1DL3                      *((volatile unsigned int*)(0x426E468CUL))
#define bM0P_MSC6_SPI_CSFR0_CS1TDS                      *((volatile unsigned int*)(0x426E4690UL))
#define bM0P_MSC6_SPI_CSFR0_CS1SPI                      *((volatile unsigned int*)(0x426E4694UL))
#define bM0P_MSC6_SPI_CSFR0_CS1CINV                     *((volatile unsigned int*)(0x426E4698UL))
#define bM0P_MSC6_SPI_CSFR0_CS1CSLVS                    *((volatile unsigned int*)(0x426E469CUL))
#define bM0P_MSC6_SPI_CSFR1_CS2DL0                      *((volatile unsigned int*)(0x426E46A0UL))
#define bM0P_MSC6_SPI_CSFR1_CS2DL1                      *((volatile unsigned int*)(0x426E46A4UL))
#define bM0P_MSC6_SPI_CSFR1_CS2DL2                      *((volatile unsigned int*)(0x426E46A8UL))
#define bM0P_MSC6_SPI_CSFR1_CS2DL3                      *((volatile unsigned int*)(0x426E46ACUL))
#define bM0P_MSC6_SPI_CSFR1_CS2TDS                      *((volatile unsigned int*)(0x426E46B0UL))
#define bM0P_MSC6_SPI_CSFR1_CS2SPI                      *((volatile unsigned int*)(0x426E46B4UL))
#define bM0P_MSC6_SPI_CSFR1_CS2CINV                     *((volatile unsigned int*)(0x426E46B8UL))
#define bM0P_MSC6_SPI_CSFR1_CS2CSLVS                    *((volatile unsigned int*)(0x426E46BCUL))
#define bM0P_MSC6_SPI_CSFR2_CS3DL0                      *((volatile unsigned int*)(0x426E4700UL))
#define bM0P_MSC6_SPI_CSFR2_CS3DL1                      *((volatile unsigned int*)(0x426E4704UL))
#define bM0P_MSC6_SPI_CSFR2_CS3DL2                      *((volatile unsigned int*)(0x426E4708UL))
#define bM0P_MSC6_SPI_CSFR2_CS3DL3                      *((volatile unsigned int*)(0x426E470CUL))
#define bM0P_MSC6_SPI_CSFR2_CS3TDS                      *((volatile unsigned int*)(0x426E4710UL))
#define bM0P_MSC6_SPI_CSFR2_CS3SPI                      *((volatile unsigned int*)(0x426E4714UL))
#define bM0P_MSC6_SPI_CSFR2_CS3CINV                     *((volatile unsigned int*)(0x426E4718UL))
#define bM0P_MSC6_SPI_CSFR2_CS3CSLVS                    *((volatile unsigned int*)(0x426E471CUL))
#define bM0P_MSC0_UART_MR_DOE                           *((volatile unsigned int*)(0x42700000UL))
#define bM0P_MSC0_UART_MR_TDS                           *((volatile unsigned int*)(0x42700008UL))
#define bM0P_MSC0_UART_MR_SBLS                          *((volatile unsigned int*)(0x4270000CUL))
#define bM0P_MSC0_UART_MR_MODE0                         *((volatile unsigned int*)(0x42700014UL))
#define bM0P_MSC0_UART_MR_MODE1                         *((volatile unsigned int*)(0x42700018UL))
#define bM0P_MSC0_UART_MR_MODE2                         *((volatile unsigned int*)(0x4270001CUL))
#define bM0P_MSC0_UART_CR_TXE                           *((volatile unsigned int*)(0x42700020UL))
#define bM0P_MSC0_UART_CR_RXE                           *((volatile unsigned int*)(0x42700024UL))
#define bM0P_MSC0_UART_CR_TBIE                          *((volatile unsigned int*)(0x42700028UL))
#define bM0P_MSC0_UART_CR_TXIE                          *((volatile unsigned int*)(0x4270002CUL))
#define bM0P_MSC0_UART_CR_RXIE                          *((volatile unsigned int*)(0x42700030UL))
#define bM0P_MSC0_UART_CR_PCL                           *((volatile unsigned int*)(0x4270003CUL))
#define bM0P_MSC0_UART_ECR_DL0                          *((volatile unsigned int*)(0x42700080UL))
#define bM0P_MSC0_UART_ECR_DL1                          *((volatile unsigned int*)(0x42700084UL))
#define bM0P_MSC0_UART_ECR_DL2                          *((volatile unsigned int*)(0x42700088UL))
#define bM0P_MSC0_UART_ECR_PS                           *((volatile unsigned int*)(0x4270008CUL))
#define bM0P_MSC0_UART_ECR_PE                           *((volatile unsigned int*)(0x42700090UL))
#define bM0P_MSC0_UART_ECR_INV                          *((volatile unsigned int*)(0x42700094UL))
#define bM0P_MSC0_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x42700098UL))
#define bM0P_MSC0_UART_ECR_FCEB                         *((volatile unsigned int*)(0x4270009CUL))
#define bM0P_MSC0_UART_SR_TBIF                          *((volatile unsigned int*)(0x427000A0UL))
#define bM0P_MSC0_UART_SR_TDEF                          *((volatile unsigned int*)(0x427000A4UL))
#define bM0P_MSC0_UART_SR_RDFF                          *((volatile unsigned int*)(0x427000A8UL))
#define bM0P_MSC0_UART_SR_ORF                           *((volatile unsigned int*)(0x427000ACUL))
#define bM0P_MSC0_UART_SR_FEF                           *((volatile unsigned int*)(0x427000B0UL))
#define bM0P_MSC0_UART_SR_PEF                           *((volatile unsigned int*)(0x427000B4UL))
#define bM0P_MSC0_UART_SR_RECLR                         *((volatile unsigned int*)(0x427000BCUL))
#define bM0P_MSC0_UART_BRS_BRS0                         *((volatile unsigned int*)(0x42700180UL))
#define bM0P_MSC0_UART_BRS_BRS1                         *((volatile unsigned int*)(0x42700184UL))
#define bM0P_MSC0_UART_BRS_BRS2                         *((volatile unsigned int*)(0x42700188UL))
#define bM0P_MSC0_UART_BRS_BRS3                         *((volatile unsigned int*)(0x4270018CUL))
#define bM0P_MSC0_UART_BRS_BRS4                         *((volatile unsigned int*)(0x42700190UL))
#define bM0P_MSC0_UART_BRS_BRS5                         *((volatile unsigned int*)(0x42700194UL))
#define bM0P_MSC0_UART_BRS_BRS6                         *((volatile unsigned int*)(0x42700198UL))
#define bM0P_MSC0_UART_BRS_BRS7                         *((volatile unsigned int*)(0x4270019CUL))
#define bM0P_MSC0_UART_BRS_BRS8                         *((volatile unsigned int*)(0x427001A0UL))
#define bM0P_MSC0_UART_BRS_BRS9                         *((volatile unsigned int*)(0x427001A4UL))
#define bM0P_MSC0_UART_BRS_BRS10                        *((volatile unsigned int*)(0x427001A8UL))
#define bM0P_MSC0_UART_BRS_BRS11                        *((volatile unsigned int*)(0x427001ACUL))
#define bM0P_MSC0_UART_BRS_BRS12                        *((volatile unsigned int*)(0x427001B0UL))
#define bM0P_MSC0_UART_BRS_BRS13                        *((volatile unsigned int*)(0x427001B4UL))
#define bM0P_MSC0_UART_BRS_BRS14                        *((volatile unsigned int*)(0x427001B8UL))
#define bM0P_MSC0_UART_BRS_EXT                          *((volatile unsigned int*)(0x427001BCUL))
#define bM0P_MSC0_UART_COMP_COMP0                       *((volatile unsigned int*)(0x42700A00UL))
#define bM0P_MSC0_UART_COMP_COMP1                       *((volatile unsigned int*)(0x42700A04UL))
#define bM0P_MSC0_UART_COMP_COMP2                       *((volatile unsigned int*)(0x42700A08UL))
#define bM0P_MSC0_UART_COMP_COMP3                       *((volatile unsigned int*)(0x42700A0CUL))
#define bM0P_MSC0_UART_COMP_COMP4                       *((volatile unsigned int*)(0x42700A10UL))
#define bM0P_MSC0_UART_COMP_COMP5                       *((volatile unsigned int*)(0x42700A14UL))
#define bM0P_MSC0_UART_COMP_COMP6                       *((volatile unsigned int*)(0x42700A18UL))
#define bM0P_MSC0_UART_COMP_COMP7                       *((volatile unsigned int*)(0x42700A1CUL))
#define bM0P_MSC0_UART_COMP_COMP8                       *((volatile unsigned int*)(0x42700A20UL))
#define bM0P_MSC0_UART_COMP_COMP9                       *((volatile unsigned int*)(0x42700A24UL))
#define bM0P_MSC0_UART_COMP_CEN                         *((volatile unsigned int*)(0x42700A3CUL))
#define bM0P_MSC1_UART_MR_DOE                           *((volatile unsigned int*)(0x42702000UL))
#define bM0P_MSC1_UART_MR_TDS                           *((volatile unsigned int*)(0x42702008UL))
#define bM0P_MSC1_UART_MR_SBLS                          *((volatile unsigned int*)(0x4270200CUL))
#define bM0P_MSC1_UART_MR_MODE0                         *((volatile unsigned int*)(0x42702014UL))
#define bM0P_MSC1_UART_MR_MODE1                         *((volatile unsigned int*)(0x42702018UL))
#define bM0P_MSC1_UART_MR_MODE2                         *((volatile unsigned int*)(0x4270201CUL))
#define bM0P_MSC1_UART_CR_TXE                           *((volatile unsigned int*)(0x42702020UL))
#define bM0P_MSC1_UART_CR_RXE                           *((volatile unsigned int*)(0x42702024UL))
#define bM0P_MSC1_UART_CR_TBIE                          *((volatile unsigned int*)(0x42702028UL))
#define bM0P_MSC1_UART_CR_TXIE                          *((volatile unsigned int*)(0x4270202CUL))
#define bM0P_MSC1_UART_CR_RXIE                          *((volatile unsigned int*)(0x42702030UL))
#define bM0P_MSC1_UART_CR_PCL                           *((volatile unsigned int*)(0x4270203CUL))
#define bM0P_MSC1_UART_ECR_DL0                          *((volatile unsigned int*)(0x42702080UL))
#define bM0P_MSC1_UART_ECR_DL1                          *((volatile unsigned int*)(0x42702084UL))
#define bM0P_MSC1_UART_ECR_DL2                          *((volatile unsigned int*)(0x42702088UL))
#define bM0P_MSC1_UART_ECR_PS                           *((volatile unsigned int*)(0x4270208CUL))
#define bM0P_MSC1_UART_ECR_PE                           *((volatile unsigned int*)(0x42702090UL))
#define bM0P_MSC1_UART_ECR_INV                          *((volatile unsigned int*)(0x42702094UL))
#define bM0P_MSC1_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x42702098UL))
#define bM0P_MSC1_UART_ECR_FCEB                         *((volatile unsigned int*)(0x4270209CUL))
#define bM0P_MSC1_UART_SR_TBIF                          *((volatile unsigned int*)(0x427020A0UL))
#define bM0P_MSC1_UART_SR_TDEF                          *((volatile unsigned int*)(0x427020A4UL))
#define bM0P_MSC1_UART_SR_RDFF                          *((volatile unsigned int*)(0x427020A8UL))
#define bM0P_MSC1_UART_SR_ORF                           *((volatile unsigned int*)(0x427020ACUL))
#define bM0P_MSC1_UART_SR_FEF                           *((volatile unsigned int*)(0x427020B0UL))
#define bM0P_MSC1_UART_SR_PEF                           *((volatile unsigned int*)(0x427020B4UL))
#define bM0P_MSC1_UART_SR_RECLR                         *((volatile unsigned int*)(0x427020BCUL))
#define bM0P_MSC1_UART_BRS_BRS0                         *((volatile unsigned int*)(0x42702180UL))
#define bM0P_MSC1_UART_BRS_BRS1                         *((volatile unsigned int*)(0x42702184UL))
#define bM0P_MSC1_UART_BRS_BRS2                         *((volatile unsigned int*)(0x42702188UL))
#define bM0P_MSC1_UART_BRS_BRS3                         *((volatile unsigned int*)(0x4270218CUL))
#define bM0P_MSC1_UART_BRS_BRS4                         *((volatile unsigned int*)(0x42702190UL))
#define bM0P_MSC1_UART_BRS_BRS5                         *((volatile unsigned int*)(0x42702194UL))
#define bM0P_MSC1_UART_BRS_BRS6                         *((volatile unsigned int*)(0x42702198UL))
#define bM0P_MSC1_UART_BRS_BRS7                         *((volatile unsigned int*)(0x4270219CUL))
#define bM0P_MSC1_UART_BRS_BRS8                         *((volatile unsigned int*)(0x427021A0UL))
#define bM0P_MSC1_UART_BRS_BRS9                         *((volatile unsigned int*)(0x427021A4UL))
#define bM0P_MSC1_UART_BRS_BRS10                        *((volatile unsigned int*)(0x427021A8UL))
#define bM0P_MSC1_UART_BRS_BRS11                        *((volatile unsigned int*)(0x427021ACUL))
#define bM0P_MSC1_UART_BRS_BRS12                        *((volatile unsigned int*)(0x427021B0UL))
#define bM0P_MSC1_UART_BRS_BRS13                        *((volatile unsigned int*)(0x427021B4UL))
#define bM0P_MSC1_UART_BRS_BRS14                        *((volatile unsigned int*)(0x427021B8UL))
#define bM0P_MSC1_UART_BRS_EXT                          *((volatile unsigned int*)(0x427021BCUL))
#define bM0P_MSC1_UART_COMP_COMP0                       *((volatile unsigned int*)(0x42702A00UL))
#define bM0P_MSC1_UART_COMP_COMP1                       *((volatile unsigned int*)(0x42702A04UL))
#define bM0P_MSC1_UART_COMP_COMP2                       *((volatile unsigned int*)(0x42702A08UL))
#define bM0P_MSC1_UART_COMP_COMP3                       *((volatile unsigned int*)(0x42702A0CUL))
#define bM0P_MSC1_UART_COMP_COMP4                       *((volatile unsigned int*)(0x42702A10UL))
#define bM0P_MSC1_UART_COMP_COMP5                       *((volatile unsigned int*)(0x42702A14UL))
#define bM0P_MSC1_UART_COMP_COMP6                       *((volatile unsigned int*)(0x42702A18UL))
#define bM0P_MSC1_UART_COMP_COMP7                       *((volatile unsigned int*)(0x42702A1CUL))
#define bM0P_MSC1_UART_COMP_COMP8                       *((volatile unsigned int*)(0x42702A20UL))
#define bM0P_MSC1_UART_COMP_COMP9                       *((volatile unsigned int*)(0x42702A24UL))
#define bM0P_MSC1_UART_COMP_CEN                         *((volatile unsigned int*)(0x42702A3CUL))
#define bM0P_MSC2_UART_MR_DOE                           *((volatile unsigned int*)(0x42704000UL))
#define bM0P_MSC2_UART_MR_TDS                           *((volatile unsigned int*)(0x42704008UL))
#define bM0P_MSC2_UART_MR_SBLS                          *((volatile unsigned int*)(0x4270400CUL))
#define bM0P_MSC2_UART_MR_MODE0                         *((volatile unsigned int*)(0x42704014UL))
#define bM0P_MSC2_UART_MR_MODE1                         *((volatile unsigned int*)(0x42704018UL))
#define bM0P_MSC2_UART_MR_MODE2                         *((volatile unsigned int*)(0x4270401CUL))
#define bM0P_MSC2_UART_CR_TXE                           *((volatile unsigned int*)(0x42704020UL))
#define bM0P_MSC2_UART_CR_RXE                           *((volatile unsigned int*)(0x42704024UL))
#define bM0P_MSC2_UART_CR_TBIE                          *((volatile unsigned int*)(0x42704028UL))
#define bM0P_MSC2_UART_CR_TXIE                          *((volatile unsigned int*)(0x4270402CUL))
#define bM0P_MSC2_UART_CR_RXIE                          *((volatile unsigned int*)(0x42704030UL))
#define bM0P_MSC2_UART_CR_PCL                           *((volatile unsigned int*)(0x4270403CUL))
#define bM0P_MSC2_UART_ECR_DL0                          *((volatile unsigned int*)(0x42704080UL))
#define bM0P_MSC2_UART_ECR_DL1                          *((volatile unsigned int*)(0x42704084UL))
#define bM0P_MSC2_UART_ECR_DL2                          *((volatile unsigned int*)(0x42704088UL))
#define bM0P_MSC2_UART_ECR_PS                           *((volatile unsigned int*)(0x4270408CUL))
#define bM0P_MSC2_UART_ECR_PE                           *((volatile unsigned int*)(0x42704090UL))
#define bM0P_MSC2_UART_ECR_INV                          *((volatile unsigned int*)(0x42704094UL))
#define bM0P_MSC2_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x42704098UL))
#define bM0P_MSC2_UART_ECR_FCEB                         *((volatile unsigned int*)(0x4270409CUL))
#define bM0P_MSC2_UART_SR_TBIF                          *((volatile unsigned int*)(0x427040A0UL))
#define bM0P_MSC2_UART_SR_TDEF                          *((volatile unsigned int*)(0x427040A4UL))
#define bM0P_MSC2_UART_SR_RDFF                          *((volatile unsigned int*)(0x427040A8UL))
