tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_MSC2_UART_SR_ORF                           *((volatile unsigned int*)(0x427040ACUL))
#define bM0P_MSC2_UART_SR_FEF                           *((volatile unsigned int*)(0x427040B0UL))
#define bM0P_MSC2_UART_SR_PEF                           *((volatile unsigned int*)(0x427040B4UL))
#define bM0P_MSC2_UART_SR_RECLR                         *((volatile unsigned int*)(0x427040BCUL))
#define bM0P_MSC2_UART_BRS_BRS0                         *((volatile unsigned int*)(0x42704180UL))
#define bM0P_MSC2_UART_BRS_BRS1                         *((volatile unsigned int*)(0x42704184UL))
#define bM0P_MSC2_UART_BRS_BRS2                         *((volatile unsigned int*)(0x42704188UL))
#define bM0P_MSC2_UART_BRS_BRS3                         *((volatile unsigned int*)(0x4270418CUL))
#define bM0P_MSC2_UART_BRS_BRS4                         *((volatile unsigned int*)(0x42704190UL))
#define bM0P_MSC2_UART_BRS_BRS5                         *((volatile unsigned int*)(0x42704194UL))
#define bM0P_MSC2_UART_BRS_BRS6                         *((volatile unsigned int*)(0x42704198UL))
#define bM0P_MSC2_UART_BRS_BRS7                         *((volatile unsigned int*)(0x4270419CUL))
#define bM0P_MSC2_UART_BRS_BRS8                         *((volatile unsigned int*)(0x427041A0UL))
#define bM0P_MSC2_UART_BRS_BRS9                         *((volatile unsigned int*)(0x427041A4UL))
#define bM0P_MSC2_UART_BRS_BRS10                        *((volatile unsigned int*)(0x427041A8UL))
#define bM0P_MSC2_UART_BRS_BRS11                        *((volatile unsigned int*)(0x427041ACUL))
#define bM0P_MSC2_UART_BRS_BRS12                        *((volatile unsigned int*)(0x427041B0UL))
#define bM0P_MSC2_UART_BRS_BRS13                        *((volatile unsigned int*)(0x427041B4UL))
#define bM0P_MSC2_UART_BRS_BRS14                        *((volatile unsigned int*)(0x427041B8UL))
#define bM0P_MSC2_UART_BRS_EXT                          *((volatile unsigned int*)(0x427041BCUL))
#define bM0P_MSC2_UART_COMP_COMP0                       *((volatile unsigned int*)(0x42704A00UL))
#define bM0P_MSC2_UART_COMP_COMP1                       *((volatile unsigned int*)(0x42704A04UL))
#define bM0P_MSC2_UART_COMP_COMP2                       *((volatile unsigned int*)(0x42704A08UL))
#define bM0P_MSC2_UART_COMP_COMP3                       *((volatile unsigned int*)(0x42704A0CUL))
#define bM0P_MSC2_UART_COMP_COMP4                       *((volatile unsigned int*)(0x42704A10UL))
#define bM0P_MSC2_UART_COMP_COMP5                       *((volatile unsigned int*)(0x42704A14UL))
#define bM0P_MSC2_UART_COMP_COMP6                       *((volatile unsigned int*)(0x42704A18UL))
#define bM0P_MSC2_UART_COMP_COMP7                       *((volatile unsigned int*)(0x42704A1CUL))
#define bM0P_MSC2_UART_COMP_COMP8                       *((volatile unsigned int*)(0x42704A20UL))
#define bM0P_MSC2_UART_COMP_COMP9                       *((volatile unsigned int*)(0x42704A24UL))
#define bM0P_MSC2_UART_COMP_CEN                         *((volatile unsigned int*)(0x42704A3CUL))
#define bM0P_MSC4_UART_MR_DOE                           *((volatile unsigned int*)(0x426E0000UL))
#define bM0P_MSC4_UART_MR_TDS                           *((volatile unsigned int*)(0x426E0008UL))
#define bM0P_MSC4_UART_MR_SBLS                          *((volatile unsigned int*)(0x426E000CUL))
#define bM0P_MSC4_UART_MR_MODE0                         *((volatile unsigned int*)(0x426E0014UL))
#define bM0P_MSC4_UART_MR_MODE1                         *((volatile unsigned int*)(0x426E0018UL))
#define bM0P_MSC4_UART_MR_MODE2                         *((volatile unsigned int*)(0x426E001CUL))
#define bM0P_MSC4_UART_CR_TXE                           *((volatile unsigned int*)(0x426E0020UL))
#define bM0P_MSC4_UART_CR_RXE                           *((volatile unsigned int*)(0x426E0024UL))
#define bM0P_MSC4_UART_CR_TBIE                          *((volatile unsigned int*)(0x426E0028UL))
#define bM0P_MSC4_UART_CR_TXIE                          *((volatile unsigned int*)(0x426E002CUL))
#define bM0P_MSC4_UART_CR_RXIE                          *((volatile unsigned int*)(0x426E0030UL))
#define bM0P_MSC4_UART_CR_PCL                           *((volatile unsigned int*)(0x426E003CUL))
#define bM0P_MSC4_UART_ECR_DL0                          *((volatile unsigned int*)(0x426E0080UL))
#define bM0P_MSC4_UART_ECR_DL1                          *((volatile unsigned int*)(0x426E0084UL))
#define bM0P_MSC4_UART_ECR_DL2                          *((volatile unsigned int*)(0x426E0088UL))
#define bM0P_MSC4_UART_ECR_PS                           *((volatile unsigned int*)(0x426E008CUL))
#define bM0P_MSC4_UART_ECR_PE                           *((volatile unsigned int*)(0x426E0090UL))
#define bM0P_MSC4_UART_ECR_INV                          *((volatile unsigned int*)(0x426E0094UL))
#define bM0P_MSC4_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x426E0098UL))
#define bM0P_MSC4_UART_ECR_FCEB                         *((volatile unsigned int*)(0x426E009CUL))
#define bM0P_MSC4_UART_SR_TBIF                          *((volatile unsigned int*)(0x426E00A0UL))
#define bM0P_MSC4_UART_SR_TDEF                          *((volatile unsigned int*)(0x426E00A4UL))
#define bM0P_MSC4_UART_SR_RDFF                          *((volatile unsigned int*)(0x426E00A8UL))
#define bM0P_MSC4_UART_SR_ORF                           *((volatile unsigned int*)(0x426E00ACUL))
#define bM0P_MSC4_UART_SR_FEF                           *((volatile unsigned int*)(0x426E00B0UL))
#define bM0P_MSC4_UART_SR_PEF                           *((volatile unsigned int*)(0x426E00B4UL))
#define bM0P_MSC4_UART_SR_RECLR                         *((volatile unsigned int*)(0x426E00BCUL))
#define bM0P_MSC4_UART_BRS_BRS0                         *((volatile unsigned int*)(0x426E0180UL))
#define bM0P_MSC4_UART_BRS_BRS1                         *((volatile unsigned int*)(0x426E0184UL))
#define bM0P_MSC4_UART_BRS_BRS2                         *((volatile unsigned int*)(0x426E0188UL))
#define bM0P_MSC4_UART_BRS_BRS3                         *((volatile unsigned int*)(0x426E018CUL))
#define bM0P_MSC4_UART_BRS_BRS4                         *((volatile unsigned int*)(0x426E0190UL))
#define bM0P_MSC4_UART_BRS_BRS5                         *((volatile unsigned int*)(0x426E0194UL))
#define bM0P_MSC4_UART_BRS_BRS6                         *((volatile unsigned int*)(0x426E0198UL))
#define bM0P_MSC4_UART_BRS_BRS7                         *((volatile unsigned int*)(0x426E019CUL))
#define bM0P_MSC4_UART_BRS_BRS8                         *((volatile unsigned int*)(0x426E01A0UL))
#define bM0P_MSC4_UART_BRS_BRS9                         *((volatile unsigned int*)(0x426E01A4UL))
#define bM0P_MSC4_UART_BRS_BRS10                        *((volatile unsigned int*)(0x426E01A8UL))
#define bM0P_MSC4_UART_BRS_BRS11                        *((volatile unsigned int*)(0x426E01ACUL))
#define bM0P_MSC4_UART_BRS_BRS12                        *((volatile unsigned int*)(0x426E01B0UL))
#define bM0P_MSC4_UART_BRS_BRS13                        *((volatile unsigned int*)(0x426E01B4UL))
#define bM0P_MSC4_UART_BRS_BRS14                        *((volatile unsigned int*)(0x426E01B8UL))
#define bM0P_MSC4_UART_BRS_EXT                          *((volatile unsigned int*)(0x426E01BCUL))
#define bM0P_MSC4_UART_COMP_COMP0                       *((volatile unsigned int*)(0x426E0A00UL))
#define bM0P_MSC4_UART_COMP_COMP1                       *((volatile unsigned int*)(0x426E0A04UL))
#define bM0P_MSC4_UART_COMP_COMP2                       *((volatile unsigned int*)(0x426E0A08UL))
#define bM0P_MSC4_UART_COMP_COMP3                       *((volatile unsigned int*)(0x426E0A0CUL))
#define bM0P_MSC4_UART_COMP_COMP4                       *((volatile unsigned int*)(0x426E0A10UL))
#define bM0P_MSC4_UART_COMP_COMP5                       *((volatile unsigned int*)(0x426E0A14UL))
#define bM0P_MSC4_UART_COMP_COMP6                       *((volatile unsigned int*)(0x426E0A18UL))
#define bM0P_MSC4_UART_COMP_COMP7                       *((volatile unsigned int*)(0x426E0A1CUL))
#define bM0P_MSC4_UART_COMP_COMP8                       *((volatile unsigned int*)(0x426E0A20UL))
#define bM0P_MSC4_UART_COMP_COMP9                       *((volatile unsigned int*)(0x426E0A24UL))
#define bM0P_MSC4_UART_COMP_CEN                         *((volatile unsigned int*)(0x426E0A3CUL))
#define bM0P_MSC5_UART_MR_DOE                           *((volatile unsigned int*)(0x426E2000UL))
#define bM0P_MSC5_UART_MR_TDS                           *((volatile unsigned int*)(0x426E2008UL))
#define bM0P_MSC5_UART_MR_SBLS                          *((volatile unsigned int*)(0x426E200CUL))
#define bM0P_MSC5_UART_MR_MODE0                         *((volatile unsigned int*)(0x426E2014UL))
#define bM0P_MSC5_UART_MR_MODE1                         *((volatile unsigned int*)(0x426E2018UL))
#define bM0P_MSC5_UART_MR_MODE2                         *((volatile unsigned int*)(0x426E201CUL))
#define bM0P_MSC5_UART_CR_TXE                           *((volatile unsigned int*)(0x426E2020UL))
#define bM0P_MSC5_UART_CR_RXE                           *((volatile unsigned int*)(0x426E2024UL))
#define bM0P_MSC5_UART_CR_TBIE                          *((volatile unsigned int*)(0x426E2028UL))
#define bM0P_MSC5_UART_CR_TXIE                          *((volatile unsigned int*)(0x426E202CUL))
#define bM0P_MSC5_UART_CR_RXIE                          *((volatile unsigned int*)(0x426E2030UL))
#define bM0P_MSC5_UART_CR_PCL                           *((volatile unsigned int*)(0x426E203CUL))
#define bM0P_MSC5_UART_ECR_DL0                          *((volatile unsigned int*)(0x426E2080UL))
#define bM0P_MSC5_UART_ECR_DL1                          *((volatile unsigned int*)(0x426E2084UL))
#define bM0P_MSC5_UART_ECR_DL2                          *((volatile unsigned int*)(0x426E2088UL))
#define bM0P_MSC5_UART_ECR_PS                           *((volatile unsigned int*)(0x426E208CUL))
#define bM0P_MSC5_UART_ECR_PE                           *((volatile unsigned int*)(0x426E2090UL))
#define bM0P_MSC5_UART_ECR_INV                          *((volatile unsigned int*)(0x426E2094UL))
#define bM0P_MSC5_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x426E2098UL))
#define bM0P_MSC5_UART_ECR_FCEB                         *((volatile unsigned int*)(0x426E209CUL))
#define bM0P_MSC5_UART_SR_TBIF                          *((volatile unsigned int*)(0x426E20A0UL))
#define bM0P_MSC5_UART_SR_TDEF                          *((volatile unsigned int*)(0x426E20A4UL))
#define bM0P_MSC5_UART_SR_RDFF                          *((volatile unsigned int*)(0x426E20A8UL))
#define bM0P_MSC5_UART_SR_ORF                           *((volatile unsigned int*)(0x426E20ACUL))
#define bM0P_MSC5_UART_SR_FEF                           *((volatile unsigned int*)(0x426E20B0UL))
#define bM0P_MSC5_UART_SR_PEF                           *((volatile unsigned int*)(0x426E20B4UL))
#define bM0P_MSC5_UART_SR_RECLR                         *((volatile unsigned int*)(0x426E20BCUL))
#define bM0P_MSC5_UART_BRS_BRS0                         *((volatile unsigned int*)(0x426E2180UL))
#define bM0P_MSC5_UART_BRS_BRS1                         *((volatile unsigned int*)(0x426E2184UL))
#define bM0P_MSC5_UART_BRS_BRS2                         *((volatile unsigned int*)(0x426E2188UL))
#define bM0P_MSC5_UART_BRS_BRS3                         *((volatile unsigned int*)(0x426E218CUL))
#define bM0P_MSC5_UART_BRS_BRS4                         *((volatile unsigned int*)(0x426E2190UL))
#define bM0P_MSC5_UART_BRS_BRS5                         *((volatile unsigned int*)(0x426E2194UL))
#define bM0P_MSC5_UART_BRS_BRS6                         *((volatile unsigned int*)(0x426E2198UL))
#define bM0P_MSC5_UART_BRS_BRS7                         *((volatile unsigned int*)(0x426E219CUL))
#define bM0P_MSC5_UART_BRS_BRS8                         *((volatile unsigned int*)(0x426E21A0UL))
#define bM0P_MSC5_UART_BRS_BRS9                         *((volatile unsigned int*)(0x426E21A4UL))
#define bM0P_MSC5_UART_BRS_BRS10                        *((volatile unsigned int*)(0x426E21A8UL))
#define bM0P_MSC5_UART_BRS_BRS11                        *((volatile unsigned int*)(0x426E21ACUL))
#define bM0P_MSC5_UART_BRS_BRS12                        *((volatile unsigned int*)(0x426E21B0UL))
#define bM0P_MSC5_UART_BRS_BRS13                        *((volatile unsigned int*)(0x426E21B4UL))
#define bM0P_MSC5_UART_BRS_BRS14                        *((volatile unsigned int*)(0x426E21B8UL))
#define bM0P_MSC5_UART_BRS_EXT                          *((volatile unsigned int*)(0x426E21BCUL))
#define bM0P_MSC5_UART_COMP_COMP0                       *((volatile unsigned int*)(0x426E2A00UL))
#define bM0P_MSC5_UART_COMP_COMP1                       *((volatile unsigned int*)(0x426E2A04UL))
#define bM0P_MSC5_UART_COMP_COMP2                       *((volatile unsigned int*)(0x426E2A08UL))
#define bM0P_MSC5_UART_COMP_COMP3                       *((volatile unsigned int*)(0x426E2A0CUL))
#define bM0P_MSC5_UART_COMP_COMP4                       *((volatile unsigned int*)(0x426E2A10UL))
#define bM0P_MSC5_UART_COMP_COMP5                       *((volatile unsigned int*)(0x426E2A14UL))
#define bM0P_MSC5_UART_COMP_COMP6                       *((volatile unsigned int*)(0x426E2A18UL))
#define bM0P_MSC5_UART_COMP_COMP7                       *((volatile unsigned int*)(0x426E2A1CUL))
#define bM0P_MSC5_UART_COMP_COMP8                       *((volatile unsigned int*)(0x426E2A20UL))
#define bM0P_MSC5_UART_COMP_COMP9                       *((volatile unsigned int*)(0x426E2A24UL))
#define bM0P_MSC5_UART_COMP_CEN                         *((volatile unsigned int*)(0x426E2A3CUL))
#define bM0P_MSC6_UART_MR_DOE                           *((volatile unsigned int*)(0x426E4000UL))
#define bM0P_MSC6_UART_MR_TDS                           *((volatile unsigned int*)(0x426E4008UL))
#define bM0P_MSC6_UART_MR_SBLS                          *((volatile unsigned int*)(0x426E400CUL))
#define bM0P_MSC6_UART_MR_MODE0                         *((volatile unsigned int*)(0x426E4014UL))
#define bM0P_MSC6_UART_MR_MODE1                         *((volatile unsigned int*)(0x426E4018UL))
#define bM0P_MSC6_UART_MR_MODE2                         *((volatile unsigned int*)(0x426E401CUL))
#define bM0P_MSC6_UART_CR_TXE                           *((volatile unsigned int*)(0x426E4020UL))
#define bM0P_MSC6_UART_CR_RXE                           *((volatile unsigned int*)(0x426E4024UL))
#define bM0P_MSC6_UART_CR_TBIE                          *((volatile unsigned int*)(0x426E4028UL))
#define bM0P_MSC6_UART_CR_TXIE                          *((volatile unsigned int*)(0x426E402CUL))
#define bM0P_MSC6_UART_CR_RXIE                          *((volatile unsigned int*)(0x426E4030UL))
#define bM0P_MSC6_UART_CR_PCL                           *((volatile unsigned int*)(0x426E403CUL))
#define bM0P_MSC6_UART_ECR_DL0                          *((volatile unsigned int*)(0x426E4080UL))
#define bM0P_MSC6_UART_ECR_DL1                          *((volatile unsigned int*)(0x426E4084UL))
#define bM0P_MSC6_UART_ECR_DL2                          *((volatile unsigned int*)(0x426E4088UL))
#define bM0P_MSC6_UART_ECR_PS                           *((volatile unsigned int*)(0x426E408CUL))
#define bM0P_MSC6_UART_ECR_PE                           *((volatile unsigned int*)(0x426E4090UL))
#define bM0P_MSC6_UART_ECR_INV                          *((volatile unsigned int*)(0x426E4094UL))
#define bM0P_MSC6_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x426E4098UL))
#define bM0P_MSC6_UART_ECR_FCEB                         *((volatile unsigned int*)(0x426E409CUL))
#define bM0P_MSC6_UART_SR_TBIF                          *((volatile unsigned int*)(0x426E40A0UL))
#define bM0P_MSC6_UART_SR_TDEF                          *((volatile unsigned int*)(0x426E40A4UL))
#define bM0P_MSC6_UART_SR_RDFF                          *((volatile unsigned int*)(0x426E40A8UL))
#define bM0P_MSC6_UART_SR_ORF                           *((volatile unsigned int*)(0x426E40ACUL))
#define bM0P_MSC6_UART_SR_FEF                           *((volatile unsigned int*)(0x426E40B0UL))
#define bM0P_MSC6_UART_SR_PEF                           *((volatile unsigned int*)(0x426E40B4UL))
#define bM0P_MSC6_UART_SR_RECLR                         *((volatile unsigned int*)(0x426E40BCUL))
#define bM0P_MSC6_UART_BRS_BRS0                         *((volatile unsigned int*)(0x426E4180UL))
#define bM0P_MSC6_UART_BRS_BRS1                         *((volatile unsigned int*)(0x426E4184UL))
#define bM0P_MSC6_UART_BRS_BRS2                         *((volatile unsigned int*)(0x426E4188UL))
#define bM0P_MSC6_UART_BRS_BRS3                         *((volatile unsigned int*)(0x426E418CUL))
#define bM0P_MSC6_UART_BRS_BRS4                         *((volatile unsigned int*)(0x426E4190UL))
#define bM0P_MSC6_UART_BRS_BRS5                         *((volatile unsigned int*)(0x426E4194UL))
#define bM0P_MSC6_UART_BRS_BRS6                         *((volatile unsigned int*)(0x426E4198UL))
#define bM0P_MSC6_UART_BRS_BRS7                         *((volatile unsigned int*)(0x426E419CUL))
#define bM0P_MSC6_UART_BRS_BRS8                         *((volatile unsigned int*)(0x426E41A0UL))
#define bM0P_MSC6_UART_BRS_BRS9                         *((volatile unsigned int*)(0x426E41A4UL))
#define bM0P_MSC6_UART_BRS_BRS10                        *((volatile unsigned int*)(0x426E41A8UL))
#define bM0P_MSC6_UART_BRS_BRS11                        *((volatile unsigned int*)(0x426E41ACUL))
#define bM0P_MSC6_UART_BRS_BRS12                        *((volatile unsigned int*)(0x426E41B0UL))
#define bM0P_MSC6_UART_BRS_BRS13                        *((volatile unsigned int*)(0x426E41B4UL))
#define bM0P_MSC6_UART_BRS_BRS14                        *((volatile unsigned int*)(0x426E41B8UL))
#define bM0P_MSC6_UART_BRS_EXT                          *((volatile unsigned int*)(0x426E41BCUL))
#define bM0P_MSC6_UART_COMP_COMP0                       *((volatile unsigned int*)(0x426E4A00UL))
#define bM0P_MSC6_UART_COMP_COMP1                       *((volatile unsigned int*)(0x426E4A04UL))
#define bM0P_MSC6_UART_COMP_COMP2                       *((volatile unsigned int*)(0x426E4A08UL))
#define bM0P_MSC6_UART_COMP_COMP3                       *((volatile unsigned int*)(0x426E4A0CUL))
#define bM0P_MSC6_UART_COMP_COMP4                       *((volatile unsigned int*)(0x426E4A10UL))
#define bM0P_MSC6_UART_COMP_COMP5                       *((volatile unsigned int*)(0x426E4A14UL))
#define bM0P_MSC6_UART_COMP_COMP6                       *((volatile unsigned int*)(0x426E4A18UL))
#define bM0P_MSC6_UART_COMP_COMP7                       *((volatile unsigned int*)(0x426E4A1CUL))
#define bM0P_MSC6_UART_COMP_COMP8                       *((volatile unsigned int*)(0x426E4A20UL))
#define bM0P_MSC6_UART_COMP_COMP9                       *((volatile unsigned int*)(0x426E4A24UL))
#define bM0P_MSC6_UART_COMP_CEN                         *((volatile unsigned int*)(0x426E4A3CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY0                    *((volatile unsigned int*)(0x425C0000UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY1                    *((volatile unsigned int*)(0x425C0004UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY2                    *((volatile unsigned int*)(0x425C0008UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY3                    *((volatile unsigned int*)(0x425C000CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY4                    *((volatile unsigned int*)(0x425C0010UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY5                    *((volatile unsigned int*)(0x425C0014UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY6                    *((volatile unsigned int*)(0x425C0018UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY7                    *((volatile unsigned int*)(0x425C001CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY8                    *((volatile unsigned int*)(0x425C0020UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY9                    *((volatile unsigned int*)(0x425C0024UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY10                   *((volatile unsigned int*)(0x425C0028UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY11                   *((volatile unsigned int*)(0x425C002CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY12                   *((volatile unsigned int*)(0x425C0030UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY13                   *((volatile unsigned int*)(0x425C0034UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY14                   *((volatile unsigned int*)(0x425C0038UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY15                   *((volatile unsigned int*)(0x425C003CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY16                   *((volatile unsigned int*)(0x425C0040UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY17                   *((volatile unsigned int*)(0x425C0044UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY18                   *((volatile unsigned int*)(0x425C0048UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY19                   *((volatile unsigned int*)(0x425C004CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY20                   *((volatile unsigned int*)(0x425C0050UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY21                   *((volatile unsigned int*)(0x425C0054UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY22                   *((volatile unsigned int*)(0x425C0058UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY23                   *((volatile unsigned int*)(0x425C005CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY24                   *((volatile unsigned int*)(0x425C0060UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY25                   *((volatile unsigned int*)(0x425C0064UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY26                   *((volatile unsigned int*)(0x425C0068UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY27                   *((volatile unsigned int*)(0x425C006CUL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY28                   *((volatile unsigned int*)(0x425C0070UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY29                   *((volatile unsigned int*)(0x425C0074UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY30                   *((volatile unsigned int*)(0x425C0078UL))
#define bM0P_OSC_HICR_TRMKEY_TRMKEY31                   *((volatile unsigned int*)(0x425C007CUL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM0                    *((volatile unsigned int*)(0x425C0080UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM1                    *((volatile unsigned int*)(0x425C0084UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM2                    *((volatile unsigned int*)(0x425C0088UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM3                    *((volatile unsigned int*)(0x425C008CUL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM4                    *((volatile unsigned int*)(0x425C0090UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM5                    *((volatile unsigned int*)(0x425C0094UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM6                    *((volatile unsigned int*)(0x425C0098UL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM7                    *((volatile unsigned int*)(0x425C009CUL))
#define bM0P_OSC_HICR_FTRM_CR4MFTRM8                    *((volatile unsigned int*)(0x425C00A0UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM0                   *((volatile unsigned int*)(0x425C00C0UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM1                   *((volatile unsigned int*)(0x425C00C4UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM2                   *((volatile unsigned int*)(0x425C00C8UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM3                   *((volatile unsigned int*)(0x425C00CCUL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM4                   *((volatile unsigned int*)(0x425C00D0UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM5                   *((volatile unsigned int*)(0x425C00D4UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM6                   *((volatile unsigned int*)(0x425C00D8UL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM7                   *((volatile unsigned int*)(0x425C00DCUL))
#define bM0P_OSC_HICR_FTRM_CR16MFTRM8                   *((volatile unsigned int*)(0x425C00E0UL))
#define bM0P_OSC_HICR_TTRM_CR4MTTRM0                    *((volatile unsigned int*)(0x425C0100UL))
