tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_OSC_HICR_TTRM_CR4MTTRM1                    *((volatile unsigned int*)(0x425C0104UL))
#define bM0P_OSC_HICR_TTRM_CR4MTTRM2                    *((volatile unsigned int*)(0x425C0108UL))
#define bM0P_OSC_HICR_TTRM_CR4MTTRM3                    *((volatile unsigned int*)(0x425C010CUL))
#define bM0P_OSC_HICR_TTRM_CR16MTTRM0                   *((volatile unsigned int*)(0x425C0140UL))
#define bM0P_OSC_HICR_TTRM_CR16MTTRM1                   *((volatile unsigned int*)(0x425C0144UL))
#define bM0P_OSC_HICR_TTRM_CR16MTTRM2                   *((volatile unsigned int*)(0x425C0148UL))
#define bM0P_OSC_HICR_TTRM_CR16MTTRM3                   *((volatile unsigned int*)(0x425C014CUL))
#define bM0P_OSC_HICR_FMC_FMC0                          *((volatile unsigned int*)(0x425C0180UL))
#define bM0P_OSC_HICR_FMC_FMC1                          *((volatile unsigned int*)(0x425C0184UL))
#define bM0P_OSC_HICR_CSR_CSR0                          *((volatile unsigned int*)(0x425C0200UL))
#define bM0P_OSC_HICR_CSR_CSR1                          *((volatile unsigned int*)(0x425C0204UL))
#define bM0P_OSC_HICR_CSR_CSR2                          *((volatile unsigned int*)(0x425C0208UL))
#define bM0P_OSC_HSXT_PWRCTL_HXSEL0                     *((volatile unsigned int*)(0x425C0400UL))
#define bM0P_OSC_HSXT_PWRCTL_HXSEL1                     *((volatile unsigned int*)(0x425C0404UL))
#define bM0P_OSC_HSXT_PWRCTL_HIBS0                      *((volatile unsigned int*)(0x425C0440UL))
#define bM0P_OSC_HSXT_PWRCTL_HIBS1                      *((volatile unsigned int*)(0x425C0444UL))
#define bM0P_OSC_LSXT_PWRCTL_LCSEL0                     *((volatile unsigned int*)(0x425C0600UL))
#define bM0P_OSC_LSXT_PWRCTL_LCSEL1                     *((volatile unsigned int*)(0x425C0604UL))
#define bM0P_OSC_LSXT_PWRCTL_LIBS0                      *((volatile unsigned int*)(0x425C0640UL))
#define bM0P_OSC_LSXT_PWRCTL_LIBS1                      *((volatile unsigned int*)(0x425C0644UL))
#define bM0P_PARITY_CTL_PE                              *((volatile unsigned int*)(0x42780000UL))
#define bM0P_PARITY_CTL_PIE                             *((volatile unsigned int*)(0x42780004UL))
#define bM0P_PARITY_CTL_PERROR                          *((volatile unsigned int*)(0x42780010UL))
#define bM0P_PARITY_ADDR_ADDR0                          *((volatile unsigned int*)(0x42780080UL))
#define bM0P_PARITY_ADDR_ADDR1                          *((volatile unsigned int*)(0x42780084UL))
#define bM0P_PARITY_ADDR_ADDR2                          *((volatile unsigned int*)(0x42780088UL))
#define bM0P_PARITY_ADDR_ADDR3                          *((volatile unsigned int*)(0x4278008CUL))
#define bM0P_PARITY_ADDR_ADDR4                          *((volatile unsigned int*)(0x42780090UL))
#define bM0P_PARITY_ADDR_ADDR5                          *((volatile unsigned int*)(0x42780094UL))
#define bM0P_PARITY_ADDR_ADDR6                          *((volatile unsigned int*)(0x42780098UL))
#define bM0P_PARITY_ADDR_ADDR7                          *((volatile unsigned int*)(0x4278009CUL))
#define bM0P_PARITY_ADDR_ADDR8                          *((volatile unsigned int*)(0x427800A0UL))
#define bM0P_PARITY_ADDR_ADDR9                          *((volatile unsigned int*)(0x427800A4UL))
#define bM0P_PARITY_ADDR_ADDR10                         *((volatile unsigned int*)(0x427800A8UL))
#define bM0P_PARITY_ADDR_ADDR11                         *((volatile unsigned int*)(0x427800ACUL))
#define bM0P_PARITY_ADDR_ADDR12                         *((volatile unsigned int*)(0x427800B0UL))
#define bM0P_PARITY_ADDR_ADDR13                         *((volatile unsigned int*)(0x427800B4UL))
#define bM0P_PARITY_ADDR_ADDR14                         *((volatile unsigned int*)(0x427800B8UL))
#define bM0P_PARITY_ADDR_ADDR15                         *((volatile unsigned int*)(0x427800BCUL))
#define bM0P_PARITY_ADDR_ADDR16                         *((volatile unsigned int*)(0x427800C0UL))
#define bM0P_PARITY_ADDR_ADDR17                         *((volatile unsigned int*)(0x427800C4UL))
#define bM0P_PARITY_ADDR_ADDR18                         *((volatile unsigned int*)(0x427800C8UL))
#define bM0P_PARITY_ADDR_ADDR19                         *((volatile unsigned int*)(0x427800CCUL))
#define bM0P_PARITY_ADDR_ADDR20                         *((volatile unsigned int*)(0x427800D0UL))
#define bM0P_PARITY_ADDR_ADDR21                         *((volatile unsigned int*)(0x427800D4UL))
#define bM0P_PARITY_ADDR_ADDR22                         *((volatile unsigned int*)(0x427800D8UL))
#define bM0P_PARITY_ADDR_ADDR23                         *((volatile unsigned int*)(0x427800DCUL))
#define bM0P_PARITY_ADDR_ADDR24                         *((volatile unsigned int*)(0x427800E0UL))
#define bM0P_PARITY_ADDR_ADDR25                         *((volatile unsigned int*)(0x427800E4UL))
#define bM0P_PARITY_ADDR_ADDR26                         *((volatile unsigned int*)(0x427800E8UL))
#define bM0P_PARITY_ADDR_ADDR27                         *((volatile unsigned int*)(0x427800ECUL))
#define bM0P_PARITY_ADDR_ADDR28                         *((volatile unsigned int*)(0x427800F0UL))
#define bM0P_PARITY_ADDR_ADDR29                         *((volatile unsigned int*)(0x427800F4UL))
#define bM0P_PARITY_ADDR_ADDR30                         *((volatile unsigned int*)(0x427800F8UL))
#define bM0P_PARITY_ADDR_ADDR31                         *((volatile unsigned int*)(0x427800FCUL))
#define bM0P_PCG_CLKEN0_MSCCLK0                         *((volatile unsigned int*)(0x42782000UL))
#define bM0P_PCG_CLKEN0_MSCCLK1                         *((volatile unsigned int*)(0x42782004UL))
#define bM0P_PCG_CLKEN0_MSCCLK2                         *((volatile unsigned int*)(0x42782008UL))
#define bM0P_PCG_CLKEN0_MSCCLK4                         *((volatile unsigned int*)(0x4278200CUL))
#define bM0P_PCG_CLKEN0_MSCCLK5                         *((volatile unsigned int*)(0x42782010UL))
#define bM0P_PCG_CLKEN0_MSCCLK6                         *((volatile unsigned int*)(0x42782014UL))
#define bM0P_PCG_CLKEN0_ADCCLK                          *((volatile unsigned int*)(0x42782040UL))
#define bM0P_PCG_CLKEN0_GIOCLK                          *((volatile unsigned int*)(0x42782070UL))
#define bM0P_PCG_RSTCTL0_MSCRST0                        *((volatile unsigned int*)(0x42782080UL))
#define bM0P_PCG_RSTCTL0_MSCRST1                        *((volatile unsigned int*)(0x42782084UL))
#define bM0P_PCG_RSTCTL0_MSCRST2                        *((volatile unsigned int*)(0x42782088UL))
#define bM0P_PCG_RSTCTL0_MSCRST4                        *((volatile unsigned int*)(0x4278208CUL))
#define bM0P_PCG_RSTCTL0_MSCRST5                        *((volatile unsigned int*)(0x42782090UL))
#define bM0P_PCG_RSTCTL0_MSCRST6                        *((volatile unsigned int*)(0x42782094UL))
#define bM0P_PCG_RSTCTL0_ADCRST                         *((volatile unsigned int*)(0x427820C0UL))
#define bM0P_PCG_CLKEN1_CTMCLK0123                      *((volatile unsigned int*)(0x42782200UL))
#define bM0P_PCG_CLKEN1_CTMCLK4567                      *((volatile unsigned int*)(0x42782204UL))
#define bM0P_PCG_CLKEN1_VCCLK                           *((volatile unsigned int*)(0x42782210UL))
#define bM0P_PCG_RSTCTL1_CTMRST0123                     *((volatile unsigned int*)(0x42782280UL))
#define bM0P_PCG_RSTCTL1_CTMRST4567                     *((volatile unsigned int*)(0x42782284UL))
#define bM0P_PCG_RSTCTL1_VCRST                          *((volatile unsigned int*)(0x42782290UL))
#define bM0P_PCG_CLKEN2_BUZCLK                          *((volatile unsigned int*)(0x42782410UL))
#define bM0P_PCG_CLKEN2_AESCLK                          *((volatile unsigned int*)(0x42782420UL))
#define bM0P_PCG_CLKEN2_SCICLK                          *((volatile unsigned int*)(0x42782430UL))
#define bM0P_PCG_CLKEN2_LCDCCLK                         *((volatile unsigned int*)(0x42782440UL))
#define bM0P_PCG_RSTCTL2_BUZRST                         *((volatile unsigned int*)(0x42782490UL))
#define bM0P_PCG_RSTCTL2_AESRST                         *((volatile unsigned int*)(0x427824A0UL))
#define bM0P_PCG_RSTCTL2_SCIRST                         *((volatile unsigned int*)(0x427824B0UL))
#define bM0P_PCG_RSTCTL2_LCDCRST                        *((volatile unsigned int*)(0x427824C0UL))
#define bM0P_RTC_RTCCTL1_ST                             *((volatile unsigned int*)(0x42760000UL))
#define bM0P_RTC_RTCCTL1_STAT                           *((volatile unsigned int*)(0x42760008UL))
#define bM0P_RTC_RTCCTL1_SWRST                          *((volatile unsigned int*)(0x4276000CUL))
#define bM0P_RTC_RTCCTL1_SENSP                          *((volatile unsigned int*)(0x42760010UL))
#define bM0P_RTC_RTCCTL1_SENRST                         *((volatile unsigned int*)(0x42760014UL))
#define bM0P_RTC_RTCCTL1_BUSY                           *((volatile unsigned int*)(0x42760018UL))
#define bM0P_RTC_RTCCTL1_SENE                           *((volatile unsigned int*)(0x42760020UL))
#define bM0P_RTC_RTCCTL1_MINE                           *((volatile unsigned int*)(0x42760024UL))
#define bM0P_RTC_RTCCTL1_HOUE                           *((volatile unsigned int*)(0x42760028UL))
#define bM0P_RTC_RTCCTL1_DAYE                           *((volatile unsigned int*)(0x4276002CUL))
#define bM0P_RTC_RTCCTL1_MONE                           *((volatile unsigned int*)(0x42760030UL))
#define bM0P_RTC_RTCCTL1_YEAE                           *((volatile unsigned int*)(0x42760034UL))
#define bM0P_RTC_RTCCTL1_INTSSF                         *((volatile unsigned int*)(0x42760040UL))
#define bM0P_RTC_RTCCTL1_INTSF                          *((volatile unsigned int*)(0x42760044UL))
#define bM0P_RTC_RTCCTL1_INTMF                          *((volatile unsigned int*)(0x42760048UL))
#define bM0P_RTC_RTCCTL1_INTHF                          *((volatile unsigned int*)(0x4276004CUL))
#define bM0P_RTC_RTCCTL1_INTTMF                         *((volatile unsigned int*)(0x42760050UL))
#define bM0P_RTC_RTCCTL1_INTALF                         *((volatile unsigned int*)(0x42760054UL))
#define bM0P_RTC_RTCCTL1_INTERF                         *((volatile unsigned int*)(0x42760058UL))
#define bM0P_RTC_RTCCTL1_INTCRF                         *((volatile unsigned int*)(0x4276005CUL))
#define bM0P_RTC_RTCCTL1_INTSSIEN                       *((volatile unsigned int*)(0x42760060UL))
#define bM0P_RTC_RTCCTL1_INTSIEN                        *((volatile unsigned int*)(0x42760064UL))
#define bM0P_RTC_RTCCTL1_INTMIEN                        *((volatile unsigned int*)(0x42760068UL))
#define bM0P_RTC_RTCCTL1_INTHIEN                        *((volatile unsigned int*)(0x4276006CUL))
#define bM0P_RTC_RTCCTL1_INTTMIEN                       *((volatile unsigned int*)(0x42760070UL))
#define bM0P_RTC_RTCCTL1_INTALIEN                       *((volatile unsigned int*)(0x42760074UL))
#define bM0P_RTC_RTCCTL1_INTERIEN                       *((volatile unsigned int*)(0x42760078UL))
#define bM0P_RTC_RTCCTL1_INTCRIEN                       *((volatile unsigned int*)(0x4276007CUL))
#define bM0P_RTC_RTCCTL2_RCTRL                          *((volatile unsigned int*)(0x42760080UL))
#define bM0P_RTC_RTCCTL2_TCST                           *((volatile unsigned int*)(0x427600A0UL))
#define bM0P_RTC_RTCCTL2_TCEN                           *((volatile unsigned int*)(0x427600A4UL))
#define bM0P_RTC_RTCCTL2_TCRUN                          *((volatile unsigned int*)(0x427600A8UL))
#define bM0P_RTC_CCS_CC0                                *((volatile unsigned int*)(0x42760100UL))
#define bM0P_RTC_CCS_CC1                                *((volatile unsigned int*)(0x42760104UL))
#define bM0P_RTC_CCS_CC2                                *((volatile unsigned int*)(0x42760108UL))
#define bM0P_RTC_CCS_CC3                                *((volatile unsigned int*)(0x4276010CUL))
#define bM0P_RTC_CCS_CC4                                *((volatile unsigned int*)(0x42760110UL))
#define bM0P_RTC_CCS_CC5                                *((volatile unsigned int*)(0x42760114UL))
#define bM0P_RTC_CCS_CC6                                *((volatile unsigned int*)(0x42760118UL))
#define bM0P_RTC_CCS_CC7                                *((volatile unsigned int*)(0x4276011CUL))
#define bM0P_RTC_CCS_CC8                                *((volatile unsigned int*)(0x42760120UL))
#define bM0P_RTC_CCS_CC9                                *((volatile unsigned int*)(0x42760124UL))
#define bM0P_RTC_CCS_CC10                               *((volatile unsigned int*)(0x42760128UL))
#define bM0P_RTC_CCS_CC11                               *((volatile unsigned int*)(0x4276012CUL))
#define bM0P_RTC_CCS_CC12                               *((volatile unsigned int*)(0x42760130UL))
#define bM0P_RTC_CCS_CC13                               *((volatile unsigned int*)(0x42760134UL))
#define bM0P_RTC_CCS_CC14                               *((volatile unsigned int*)(0x42760138UL))
#define bM0P_RTC_CCS_CC15                               *((volatile unsigned int*)(0x4276013CUL))
#define bM0P_RTC_CCS_CC16                               *((volatile unsigned int*)(0x42760140UL))
#define bM0P_RTC_CCS_CC17                               *((volatile unsigned int*)(0x42760144UL))
#define bM0P_RTC_CCS_CC18                               *((volatile unsigned int*)(0x42760148UL))
#define bM0P_RTC_CCS_CC19                               *((volatile unsigned int*)(0x4276014CUL))
#define bM0P_RTC_CCS_CC20                               *((volatile unsigned int*)(0x42760150UL))
#define bM0P_RTC_CCS_CC21                               *((volatile unsigned int*)(0x42760154UL))
#define bM0P_RTC_CCS_CC22                               *((volatile unsigned int*)(0x42760158UL))
#define bM0P_RTC_CCS_CC23                               *((volatile unsigned int*)(0x4276015CUL))
#define bM0P_RTC_SEN_LS0                                *((volatile unsigned int*)(0x42760180UL))
#define bM0P_RTC_SEN_LS1                                *((volatile unsigned int*)(0x42760184UL))
#define bM0P_RTC_SEN_LS2                                *((volatile unsigned int*)(0x42760188UL))
#define bM0P_RTC_SEN_LS3                                *((volatile unsigned int*)(0x4276018CUL))
#define bM0P_RTC_SEN_HS0                                *((volatile unsigned int*)(0x42760190UL))
#define bM0P_RTC_SEN_HS1                                *((volatile unsigned int*)(0x42760194UL))
#define bM0P_RTC_SEN_HS2                                *((volatile unsigned int*)(0x42760198UL))
#define bM0P_RTC_MIN_LM0                                *((volatile unsigned int*)(0x427601A0UL))
#define bM0P_RTC_MIN_LM1                                *((volatile unsigned int*)(0x427601A4UL))
#define bM0P_RTC_MIN_LM2                                *((volatile unsigned int*)(0x427601A8UL))
#define bM0P_RTC_MIN_LM3                                *((volatile unsigned int*)(0x427601ACUL))
#define bM0P_RTC_MIN_HM0                                *((volatile unsigned int*)(0x427601B0UL))
#define bM0P_RTC_MIN_HM1                                *((volatile unsigned int*)(0x427601B4UL))
#define bM0P_RTC_MIN_HM2                                *((volatile unsigned int*)(0x427601B8UL))
#define bM0P_RTC_HOUR_LH0                               *((volatile unsigned int*)(0x427601C0UL))
#define bM0P_RTC_HOUR_LH1                               *((volatile unsigned int*)(0x427601C4UL))
#define bM0P_RTC_HOUR_LH2                               *((volatile unsigned int*)(0x427601C8UL))
#define bM0P_RTC_HOUR_LH3                               *((volatile unsigned int*)(0x427601CCUL))
#define bM0P_RTC_HOUR_HH0                               *((volatile unsigned int*)(0x427601D0UL))
#define bM0P_RTC_HOUR_HH1                               *((volatile unsigned int*)(0x427601D4UL))
#define bM0P_RTC_DATE_LD0                               *((volatile unsigned int*)(0x427601E0UL))
#define bM0P_RTC_DATE_LD1                               *((volatile unsigned int*)(0x427601E4UL))
#define bM0P_RTC_DATE_LD2                               *((volatile unsigned int*)(0x427601E8UL))
#define bM0P_RTC_DATE_LD3                               *((volatile unsigned int*)(0x427601ECUL))
#define bM0P_RTC_DATE_HD0                               *((volatile unsigned int*)(0x427601F0UL))
#define bM0P_RTC_DATE_HD1                               *((volatile unsigned int*)(0x427601F4UL))
#define bM0P_RTC_WEEK_WK0                               *((volatile unsigned int*)(0x42760200UL))
#define bM0P_RTC_WEEK_WK1                               *((volatile unsigned int*)(0x42760204UL))
#define bM0P_RTC_WEEK_WK2                               *((volatile unsigned int*)(0x42760208UL))
#define bM0P_RTC_MON_LMON0                              *((volatile unsigned int*)(0x42760220UL))
#define bM0P_RTC_MON_LMON1                              *((volatile unsigned int*)(0x42760224UL))
#define bM0P_RTC_MON_LMON2                              *((volatile unsigned int*)(0x42760228UL))
#define bM0P_RTC_MON_LMON3                              *((volatile unsigned int*)(0x4276022CUL))
#define bM0P_RTC_MON_HMON                               *((volatile unsigned int*)(0x42760230UL))
#define bM0P_RTC_YEAR_LY0                               *((volatile unsigned int*)(0x42760240UL))
#define bM0P_RTC_YEAR_LY1                               *((volatile unsigned int*)(0x42760244UL))
#define bM0P_RTC_YEAR_LY2                               *((volatile unsigned int*)(0x42760248UL))
#define bM0P_RTC_YEAR_LY3                               *((volatile unsigned int*)(0x4276024CUL))
#define bM0P_RTC_YEAR_HY0                               *((volatile unsigned int*)(0x42760250UL))
#define bM0P_RTC_YEAR_HY1                               *((volatile unsigned int*)(0x42760254UL))
#define bM0P_RTC_YEAR_HY2                               *((volatile unsigned int*)(0x42760258UL))
#define bM0P_RTC_YEAR_HY3                               *((volatile unsigned int*)(0x4276025CUL))
#define bM0P_RTC_ASEN_LS0                               *((volatile unsigned int*)(0x42760280UL))
#define bM0P_RTC_ASEN_LS1                               *((volatile unsigned int*)(0x42760284UL))
#define bM0P_RTC_ASEN_LS2                               *((volatile unsigned int*)(0x42760288UL))
#define bM0P_RTC_ASEN_LS3                               *((volatile unsigned int*)(0x4276028CUL))
#define bM0P_RTC_ASEN_HS0                               *((volatile unsigned int*)(0x42760290UL))
#define bM0P_RTC_ASEN_HS1                               *((volatile unsigned int*)(0x42760294UL))
#define bM0P_RTC_ASEN_HS2                               *((volatile unsigned int*)(0x42760298UL))
#define bM0P_RTC_AMIN_LM0                               *((volatile unsigned int*)(0x427602A0UL))
#define bM0P_RTC_AMIN_LM1                               *((volatile unsigned int*)(0x427602A4UL))
#define bM0P_RTC_AMIN_LM2                               *((volatile unsigned int*)(0x427602A8UL))
#define bM0P_RTC_AMIN_LM3                               *((volatile unsigned int*)(0x427602ACUL))
#define bM0P_RTC_AMIN_HM0                               *((volatile unsigned int*)(0x427602B0UL))
#define bM0P_RTC_AMIN_HM1                               *((volatile unsigned int*)(0x427602B4UL))
#define bM0P_RTC_AMIN_HM2                               *((volatile unsigned int*)(0x427602B8UL))
#define bM0P_RTC_AHOUR_LH0                              *((volatile unsigned int*)(0x427602C0UL))
#define bM0P_RTC_AHOUR_LH1                              *((volatile unsigned int*)(0x427602C4UL))
#define bM0P_RTC_AHOUR_LH2                              *((volatile unsigned int*)(0x427602C8UL))
#define bM0P_RTC_AHOUR_LH3                              *((volatile unsigned int*)(0x427602CCUL))
#define bM0P_RTC_AHOUR_HH0                              *((volatile unsigned int*)(0x427602D0UL))
#define bM0P_RTC_AHOUR_HH1                              *((volatile unsigned int*)(0x427602D4UL))
#define bM0P_RTC_ADATE_LD0                              *((volatile unsigned int*)(0x427602E0UL))
#define bM0P_RTC_ADATE_LD1                              *((volatile unsigned int*)(0x427602E4UL))
#define bM0P_RTC_ADATE_LD2                              *((volatile unsigned int*)(0x427602E8UL))
#define bM0P_RTC_ADATE_LD3                              *((volatile unsigned int*)(0x427602ECUL))
#define bM0P_RTC_ADATE_HD0                              *((volatile unsigned int*)(0x427602F0UL))
#define bM0P_RTC_ADATE_HD1                              *((volatile unsigned int*)(0x427602F4UL))
#define bM0P_RTC_AMON_LMON0                             *((volatile unsigned int*)(0x42760320UL))
#define bM0P_RTC_AMON_LMON1                             *((volatile unsigned int*)(0x42760324UL))
#define bM0P_RTC_AMON_LMON2                             *((volatile unsigned int*)(0x42760328UL))
#define bM0P_RTC_AMON_LMON3                             *((volatile unsigned int*)(0x4276032CUL))
#define bM0P_RTC_AMON_HMON                              *((volatile unsigned int*)(0x42760330UL))
#define bM0P_RTC_AYEAR_LY0                              *((volatile unsigned int*)(0x42760340UL))
#define bM0P_RTC_AYEAR_LY1                              *((volatile unsigned int*)(0x42760344UL))
#define bM0P_RTC_AYEAR_LY2                              *((volatile unsigned int*)(0x42760348UL))
#define bM0P_RTC_AYEAR_LY3                              *((volatile unsigned int*)(0x4276034CUL))
#define bM0P_RTC_AYEAR_HY0                              *((volatile unsigned int*)(0x42760350UL))
#define bM0P_RTC_AYEAR_HY1                              *((volatile unsigned int*)(0x42760354UL))
#define bM0P_RTC_AYEAR_HY2                              *((volatile unsigned int*)(0x42760358UL))
#define bM0P_RTC_AYEAR_HY3                              *((volatile unsigned int*)(0x4276035CUL))
#define bM0P_RTC_TVAL_VAL0                              *((volatile unsigned int*)(0x42760380UL))
#define bM0P_RTC_TVAL_VAL1                              *((volatile unsigned int*)(0x42760384UL))
#define bM0P_RTC_TVAL_VAL2                              *((volatile unsigned int*)(0x42760388UL))
#define bM0P_RTC_TVAL_VAL3                              *((volatile unsigned int*)(0x4276038CUL))
#define bM0P_RTC_TVAL_VAL4                              *((volatile unsigned int*)(0x42760390UL))
#define bM0P_RTC_TVAL_VAL5                              *((volatile unsigned int*)(0x42760394UL))
#define bM0P_RTC_TVAL_VAL6                              *((volatile unsigned int*)(0x42760398UL))
#define bM0P_RTC_TVAL_VAL7                              *((volatile unsigned int*)(0x4276039CUL))
#define bM0P_RTC_TVAL_VAL8                              *((volatile unsigned int*)(0x427603A0UL))
#define bM0P_RTC_TVAL_VAL9                              *((volatile unsigned int*)(0x427603A4UL))
#define bM0P_RTC_TVAL_VAL10                             *((volatile unsigned int*)(0x427603A8UL))
#define bM0P_RTC_TVAL_VAL11                             *((volatile unsigned int*)(0x427603ACUL))
#define bM0P_RTC_TVAL_VAL12                             *((volatile unsigned int*)(0x427603B0UL))
#define bM0P_RTC_TVAL_VAL13                             *((volatile unsigned int*)(0x427603B4UL))
#define bM0P_RTC_TVAL_VAL14                             *((volatile unsigned int*)(0x427603B8UL))
#define bM0P_RTC_TVAL_VAL15                             *((volatile unsigned int*)(0x427603BCUL))
#define bM0P_RTC_TVAL_VAL16                             *((volatile unsigned int*)(0x427603C0UL))
#define bM0P_RTC_TVAL_VAL17                             *((volatile unsigned int*)(0x427603C4UL))
#define bM0P_RTC_SCLKI_SCLKI                            *((volatile unsigned int*)(0x42760400UL))
#define bM0P_RTC_SCLKS_SCLKS0                           *((volatile unsigned int*)(0x42760420UL))
#define bM0P_RTC_SCLKS_SCLKS1                           *((volatile unsigned int*)(0x42760424UL))
#define bM0P_RTC_CALVAL_CALVAL0                         *((volatile unsigned int*)(0x42760480UL))
#define bM0P_RTC_CALVAL_CALVAL1                         *((volatile unsigned int*)(0x42760484UL))
