tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_RTC_CALVAL_CALVAL2                         *((volatile unsigned int*)(0x42760488UL))
#define bM0P_RTC_CALVAL_CALVAL3                         *((volatile unsigned int*)(0x4276048CUL))
#define bM0P_RTC_CALVAL_CALVAL4                         *((volatile unsigned int*)(0x42760490UL))
#define bM0P_RTC_CALVAL_CALVAL5                         *((volatile unsigned int*)(0x42760494UL))
#define bM0P_RTC_CALVAL_CALVAL6                         *((volatile unsigned int*)(0x42760498UL))
#define bM0P_RTC_CALVAL_CALVAL7                         *((volatile unsigned int*)(0x4276049CUL))
#define bM0P_RTC_CALVAL_CALVAL8                         *((volatile unsigned int*)(0x427604A0UL))
#define bM0P_RTC_CALVAL_CALVAL9                         *((volatile unsigned int*)(0x427604A4UL))
#define bM0P_RTC_CALEN_CALEN                            *((volatile unsigned int*)(0x427604C0UL))
#define bM0P_RTC_CLKDIVX_DIVX0                          *((volatile unsigned int*)(0x42760500UL))
#define bM0P_RTC_CLKDIVX_DIVX1                          *((volatile unsigned int*)(0x42760504UL))
#define bM0P_RTC_CLKDIVX_DIVX2                          *((volatile unsigned int*)(0x42760508UL))
#define bM0P_RTC_CLKDIVX_DIVX3                          *((volatile unsigned int*)(0x4276050CUL))
#define bM0P_RTC_CLKDIVC_DIVEN                          *((volatile unsigned int*)(0x42760520UL))
#define bM0P_RTC_CLKDIVC_DIVRDY                         *((volatile unsigned int*)(0x42760524UL))
#define bM0P_RTC_CALCYC_CALCYC0                         *((volatile unsigned int*)(0x42760580UL))
#define bM0P_RTC_CALCYC_CALCYC1                         *((volatile unsigned int*)(0x42760584UL))
#define bM0P_RTC_CALCYC_CALCYC2                         *((volatile unsigned int*)(0x42760588UL))
#define bM0P_RTC_CALCYC_CALCYC3                         *((volatile unsigned int*)(0x4276058CUL))
#define bM0P_RTC_CALCYC_CALCYC4                         *((volatile unsigned int*)(0x42760590UL))
#define bM0P_RTC_CALCYC_CALCYC5                         *((volatile unsigned int*)(0x42760594UL))
#define bM0P_RTC_CALCYC_CALCYC6                         *((volatile unsigned int*)(0x42760598UL))
#define bM0P_RTC_CALCYC_CALCYC7                         *((volatile unsigned int*)(0x4276059CUL))
#define bM0P_RTC_CALCYC_CALCYC8                         *((volatile unsigned int*)(0x427605A0UL))
#define bM0P_RTC_RTCODIV_CODIV2                         *((volatile unsigned int*)(0x42760600UL))
#define bM0P_SBSSR_CTSSSR_SSSR0                         *((volatile unsigned int*)(0x424BFF80UL))
#define bM0P_SBSSR_CTSSSR_SSSR1                         *((volatile unsigned int*)(0x424BFF84UL))
#define bM0P_SBSSR_CTSSSR_SSSR2                         *((volatile unsigned int*)(0x424BFF88UL))
#define bM0P_SBSSR_CTSSSR_SSSR3                         *((volatile unsigned int*)(0x424BFF8CUL))
#define bM0P_SBSSR_CTSSSR_SSSR4                         *((volatile unsigned int*)(0x424BFF90UL))
#define bM0P_SBSSR_CTSSSR_SSSR5                         *((volatile unsigned int*)(0x424BFF94UL))
#define bM0P_SBSSR_CTSSSR_SSSR6                         *((volatile unsigned int*)(0x424BFF98UL))
#define bM0P_SBSSR_CTSSSR_SSSR7                         *((volatile unsigned int*)(0x424BFF9CUL))
#define bM0P_SCI_CON_EN                                 *((volatile unsigned int*)(0x42790000UL))
#define bM0P_SCI_CON_FL_EN                              *((volatile unsigned int*)(0x42790004UL))
#define bM0P_SCI_CON_PARITY_CHECK_EN                    *((volatile unsigned int*)(0x42790008UL))
#define bM0P_SCI_CON_RETRY_EN                           *((volatile unsigned int*)(0x4279000CUL))
#define bM0P_SCI_CON_EDC_EN                             *((volatile unsigned int*)(0x42790010UL))
#define bM0P_SCI_CON_ETU_CNT_EN                         *((volatile unsigned int*)(0x42790014UL))
#define bM0P_SCI_CON_RX_FIFO_CLR                        *((volatile unsigned int*)(0x42790018UL))
#define bM0P_SCI_CON_TX_FIFO_CLR                        *((volatile unsigned int*)(0x4279001CUL))
#define bM0P_SCI_MODE_T_MODE                            *((volatile unsigned int*)(0x42790080UL))
#define bM0P_SCI_MODE_PARITY                            *((volatile unsigned int*)(0x42790084UL))
#define bM0P_SCI_MODE_CDCVT                             *((volatile unsigned int*)(0x42790088UL))
#define bM0P_SCI_MODE_EDC_MODE                          *((volatile unsigned int*)(0x42790090UL))
#define bM0P_SCI_MODE_RETRY_TIMES0                      *((volatile unsigned int*)(0x42790094UL))
#define bM0P_SCI_MODE_RETRY_TIMES1                      *((volatile unsigned int*)(0x42790098UL))
#define bM0P_SCI_MODE_RETRY_TIMES2                      *((volatile unsigned int*)(0x4279009CUL))
#define bM0P_SCI_STATUS_RX_FIN                          *((volatile unsigned int*)(0x42790100UL))
#define bM0P_SCI_STATUS_RX_ERR                          *((volatile unsigned int*)(0x42790104UL))
#define bM0P_SCI_STATUS_TX_FIN                          *((volatile unsigned int*)(0x42790108UL))
#define bM0P_SCI_STATUS_TX_ERR                          *((volatile unsigned int*)(0x4279010CUL))
#define bM0P_SCI_STATUS_ETU_CNT_FIN                     *((volatile unsigned int*)(0x42790110UL))
#define bM0P_SCI_STATUS_STAT                            *((volatile unsigned int*)(0x42790114UL))
#define bM0P_SCI_STATUS_RX_OVR                          *((volatile unsigned int*)(0x42790118UL))
#define bM0P_SCI_STATUS_RX_NE                           *((volatile unsigned int*)(0x4279011CUL))
#define bM0P_SCI_FIFO_STATUS_RX_EPTB                    *((volatile unsigned int*)(0x42790180UL))
#define bM0P_SCI_FIFO_STATUS_RX_FUL                     *((volatile unsigned int*)(0x42790184UL))
#define bM0P_SCI_FIFO_STATUS_RX_UDR                     *((volatile unsigned int*)(0x42790188UL))
#define bM0P_SCI_FIFO_STATUS_RX_OVR                     *((volatile unsigned int*)(0x4279018CUL))
#define bM0P_SCI_FIFO_STATUS_TX_EPTB                    *((volatile unsigned int*)(0x42790190UL))
#define bM0P_SCI_FIFO_STATUS_TX_FUL                     *((volatile unsigned int*)(0x42790194UL))
#define bM0P_SCI_FIFO_STATUS_TX_UDR                     *((volatile unsigned int*)(0x42790198UL))
#define bM0P_SCI_FIFO_STATUS_TX_EPT                     *((volatile unsigned int*)(0x4279019CUL))
#define bM0P_SCI_FIFO_DEPTH_RX_FIFO_DEPTH0              *((volatile unsigned int*)(0x42790200UL))
#define bM0P_SCI_FIFO_DEPTH_RX_FIFO_DEPTH1              *((volatile unsigned int*)(0x42790204UL))
#define bM0P_SCI_FIFO_DEPTH_RX_FIFO_DEPTH2              *((volatile unsigned int*)(0x42790208UL))
#define bM0P_SCI_FIFO_DEPTH_RX_FIFO_DEPTH3              *((volatile unsigned int*)(0x4279020CUL))
#define bM0P_SCI_FIFO_DEPTH_TX_FIFO_DEPTH0              *((volatile unsigned int*)(0x42790210UL))
#define bM0P_SCI_FIFO_DEPTH_TX_FIFO_DEPTH1              *((volatile unsigned int*)(0x42790214UL))
#define bM0P_SCI_FIFO_DEPTH_TX_FIFO_DEPTH2              *((volatile unsigned int*)(0x42790218UL))
#define bM0P_SCI_FIFO_DEPTH_TX_FIFO_DEPTH3              *((volatile unsigned int*)(0x4279021CUL))
#define bM0P_SCI_DATA_DATA0                             *((volatile unsigned int*)(0x42790280UL))
#define bM0P_SCI_DATA_DATA1                             *((volatile unsigned int*)(0x42790284UL))
#define bM0P_SCI_DATA_DATA2                             *((volatile unsigned int*)(0x42790288UL))
#define bM0P_SCI_DATA_DATA3                             *((volatile unsigned int*)(0x4279028CUL))
#define bM0P_SCI_DATA_DATA4                             *((volatile unsigned int*)(0x42790290UL))
#define bM0P_SCI_DATA_DATA5                             *((volatile unsigned int*)(0x42790294UL))
#define bM0P_SCI_DATA_DATA6                             *((volatile unsigned int*)(0x42790298UL))
#define bM0P_SCI_DATA_DATA7                             *((volatile unsigned int*)(0x4279029CUL))
#define bM0P_SCI_EDC_DATA_EDC_DATA0                     *((volatile unsigned int*)(0x42790300UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA1                     *((volatile unsigned int*)(0x42790304UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA2                     *((volatile unsigned int*)(0x42790308UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA3                     *((volatile unsigned int*)(0x4279030CUL))
#define bM0P_SCI_EDC_DATA_EDC_DATA4                     *((volatile unsigned int*)(0x42790310UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA5                     *((volatile unsigned int*)(0x42790314UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA6                     *((volatile unsigned int*)(0x42790318UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA7                     *((volatile unsigned int*)(0x4279031CUL))
#define bM0P_SCI_EDC_DATA_EDC_DATA8                     *((volatile unsigned int*)(0x42790320UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA9                     *((volatile unsigned int*)(0x42790324UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA10                    *((volatile unsigned int*)(0x42790328UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA11                    *((volatile unsigned int*)(0x4279032CUL))
#define bM0P_SCI_EDC_DATA_EDC_DATA12                    *((volatile unsigned int*)(0x42790330UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA13                    *((volatile unsigned int*)(0x42790334UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA14                    *((volatile unsigned int*)(0x42790338UL))
#define bM0P_SCI_EDC_DATA_EDC_DATA15                    *((volatile unsigned int*)(0x4279033CUL))
#define bM0P_SCI_SBDR_SBDR0                             *((volatile unsigned int*)(0x42790380UL))
#define bM0P_SCI_SBDR_SBDR1                             *((volatile unsigned int*)(0x42790384UL))
#define bM0P_SCI_SBDR_SBDR2                             *((volatile unsigned int*)(0x42790388UL))
#define bM0P_SCI_SBDR_SBDR3                             *((volatile unsigned int*)(0x4279038CUL))
#define bM0P_SCI_SBDR_SBDR4                             *((volatile unsigned int*)(0x42790390UL))
#define bM0P_SCI_SBDR_SBDR5                             *((volatile unsigned int*)(0x42790394UL))
#define bM0P_SCI_SBDR_SBDR6                             *((volatile unsigned int*)(0x42790398UL))
#define bM0P_SCI_SBDR_SBDR7                             *((volatile unsigned int*)(0x4279039CUL))
#define bM0P_SCI_SBDR_SBDR8                             *((volatile unsigned int*)(0x427903A0UL))
#define bM0P_SCI_SBDR_SBDR9                             *((volatile unsigned int*)(0x427903A4UL))
#define bM0P_SCI_SBDR_SBDR10                            *((volatile unsigned int*)(0x427903A8UL))
#define bM0P_SCI_SBDR_SBDR11                            *((volatile unsigned int*)(0x427903ACUL))
#define bM0P_SCI_SBDR_SBDR12                            *((volatile unsigned int*)(0x427903B0UL))
#define bM0P_SCI_SBDR_SBDR13                            *((volatile unsigned int*)(0x427903B4UL))
#define bM0P_SCI_SBDR_ETU_SEL0                          *((volatile unsigned int*)(0x427903B8UL))
#define bM0P_SCI_SBDR_ETU_SEL1                          *((volatile unsigned int*)(0x427903BCUL))
#define bM0P_SCI_ETU_CNT_ETU_CNT0                       *((volatile unsigned int*)(0x42790400UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT1                       *((volatile unsigned int*)(0x42790404UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT2                       *((volatile unsigned int*)(0x42790408UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT3                       *((volatile unsigned int*)(0x4279040CUL))
#define bM0P_SCI_ETU_CNT_ETU_CNT4                       *((volatile unsigned int*)(0x42790410UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT5                       *((volatile unsigned int*)(0x42790414UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT6                       *((volatile unsigned int*)(0x42790418UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT7                       *((volatile unsigned int*)(0x4279041CUL))
#define bM0P_SCI_ETU_CNT_ETU_CNT8                       *((volatile unsigned int*)(0x42790420UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT9                       *((volatile unsigned int*)(0x42790424UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT10                      *((volatile unsigned int*)(0x42790428UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT11                      *((volatile unsigned int*)(0x4279042CUL))
#define bM0P_SCI_ETU_CNT_ETU_CNT12                      *((volatile unsigned int*)(0x42790430UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT13                      *((volatile unsigned int*)(0x42790434UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT14                      *((volatile unsigned int*)(0x42790438UL))
#define bM0P_SCI_ETU_CNT_ETU_CNT15                      *((volatile unsigned int*)(0x4279043CUL))
#define bM0P_SCI_F1_NUM_FL_NUM0                         *((volatile unsigned int*)(0x42790480UL))
#define bM0P_SCI_F1_NUM_FL_NUM1                         *((volatile unsigned int*)(0x42790484UL))
#define bM0P_SCI_F1_NUM_FL_NUM2                         *((volatile unsigned int*)(0x42790488UL))
#define bM0P_SCI_CLK_RST_RESET_EN                       *((volatile unsigned int*)(0x42790500UL))
#define bM0P_SCI_CLK_RST_RESET                          *((volatile unsigned int*)(0x42790504UL))
#define bM0P_SCI_CLK_RST_CLK_EN                         *((volatile unsigned int*)(0x42790508UL))
#define bM0P_SCI_CLK_RST_CLK_SEL0                       *((volatile unsigned int*)(0x4279050CUL))
#define bM0P_SCI_CLK_RST_CLK_SEL1                       *((volatile unsigned int*)(0x42790510UL))
#define bM0P_SCI_INT_EN_WAKEUP_INT_EN                   *((volatile unsigned int*)(0x42790580UL))
#define bM0P_SCI_INT_EN_ETU_CNT_INT_EN                  *((volatile unsigned int*)(0x42790584UL))
#define bM0P_SCI_INT_EN_INT_EN                          *((volatile unsigned int*)(0x42790588UL))
#define bM0P_SCI_WAKEUP_INT_WAKEUP_INT                  *((volatile unsigned int*)(0x42790600UL))
#define bM0P_SWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42240100UL))
#define bM0P_SWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42240104UL))
#define bM0P_SWWDT_WDT_CTL_TMWD0                        *((volatile unsigned int*)(0x42240108UL))
#define bM0P_SWWDT_WDT_CTL_TMWD1                        *((volatile unsigned int*)(0x4224010CUL))
#define bM0P_SWWDT_WDT_CTL_WDM                          *((volatile unsigned int*)(0x42240110UL))
#define bM0P_SWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42240200UL))
#define bM0P_SWWDT_WDT_MDC_TRG                          *((volatile unsigned int*)(0x42240300UL))
#define bM0P_UID_UIDR0_UID0                             *((volatile unsigned int*)(0x42004000UL))
#define bM0P_UID_UIDR0_UID1                             *((volatile unsigned int*)(0x42004004UL))
#define bM0P_UID_UIDR0_UID2                             *((volatile unsigned int*)(0x42004008UL))
#define bM0P_UID_UIDR0_UID3                             *((volatile unsigned int*)(0x4200400CUL))
#define bM0P_UID_UIDR0_UID4                             *((volatile unsigned int*)(0x42004010UL))
#define bM0P_UID_UIDR0_UID5                             *((volatile unsigned int*)(0x42004014UL))
#define bM0P_UID_UIDR0_UID6                             *((volatile unsigned int*)(0x42004018UL))
#define bM0P_UID_UIDR0_UID7                             *((volatile unsigned int*)(0x4200401CUL))
#define bM0P_UID_UIDR0_UID8                             *((volatile unsigned int*)(0x42004020UL))
#define bM0P_UID_UIDR0_UID9                             *((volatile unsigned int*)(0x42004024UL))
#define bM0P_UID_UIDR0_UID10                            *((volatile unsigned int*)(0x42004028UL))
#define bM0P_UID_UIDR0_UID11                            *((volatile unsigned int*)(0x4200402CUL))
#define bM0P_UID_UIDR0_UID12                            *((volatile unsigned int*)(0x42004030UL))
#define bM0P_UID_UIDR0_UID13                            *((volatile unsigned int*)(0x42004034UL))
#define bM0P_UID_UIDR0_UID14                            *((volatile unsigned int*)(0x42004038UL))
#define bM0P_UID_UIDR0_UID15                            *((volatile unsigned int*)(0x4200403CUL))
#define bM0P_UID_UIDR0_UID16                            *((volatile unsigned int*)(0x42004040UL))
#define bM0P_UID_UIDR0_UID17                            *((volatile unsigned int*)(0x42004044UL))
#define bM0P_UID_UIDR0_UID18                            *((volatile unsigned int*)(0x42004048UL))
#define bM0P_UID_UIDR0_UID19                            *((volatile unsigned int*)(0x4200404CUL))
#define bM0P_UID_UIDR0_UID20                            *((volatile unsigned int*)(0x42004050UL))
#define bM0P_UID_UIDR0_UID21                            *((volatile unsigned int*)(0x42004054UL))
#define bM0P_UID_UIDR0_UID22                            *((volatile unsigned int*)(0x42004058UL))
#define bM0P_UID_UIDR0_UID23                            *((volatile unsigned int*)(0x4200405CUL))
#define bM0P_UID_UIDR0_UID24                            *((volatile unsigned int*)(0x42004060UL))
#define bM0P_UID_UIDR0_UID25                            *((volatile unsigned int*)(0x42004064UL))
#define bM0P_UID_UIDR0_UID26                            *((volatile unsigned int*)(0x42004068UL))
#define bM0P_UID_UIDR0_UID27                            *((volatile unsigned int*)(0x4200406CUL))
#define bM0P_UID_UIDR0_UID28                            *((volatile unsigned int*)(0x42004070UL))
#define bM0P_UID_UIDR0_UID29                            *((volatile unsigned int*)(0x42004074UL))
#define bM0P_UID_UIDR0_UID30                            *((volatile unsigned int*)(0x42004078UL))
#define bM0P_UID_UIDR0_UID31                            *((volatile unsigned int*)(0x4200407CUL))
#define bM0P_UID_UIDR1_UID0                             *((volatile unsigned int*)(0x42004080UL))
#define bM0P_UID_UIDR1_UID1                             *((volatile unsigned int*)(0x42004084UL))
#define bM0P_UID_UIDR1_UID2                             *((volatile unsigned int*)(0x42004088UL))
#define bM0P_UID_UIDR1_UID3                             *((volatile unsigned int*)(0x4200408CUL))
#define bM0P_UID_UIDR1_UID4                             *((volatile unsigned int*)(0x42004090UL))
#define bM0P_UID_UIDR1_UID5                             *((volatile unsigned int*)(0x42004094UL))
#define bM0P_UID_UIDR1_UID6                             *((volatile unsigned int*)(0x42004098UL))
#define bM0P_UID_UIDR1_UID7                             *((volatile unsigned int*)(0x4200409CUL))
#define bM0P_UID_UIDR1_UID8                             *((volatile unsigned int*)(0x420040A0UL))
#define bM0P_UID_UIDR1_UID9                             *((volatile unsigned int*)(0x420040A4UL))
#define bM0P_UID_UIDR1_UID10                            *((volatile unsigned int*)(0x420040A8UL))
#define bM0P_UID_UIDR1_UID11                            *((volatile unsigned int*)(0x420040ACUL))
#define bM0P_UID_UIDR1_UID12                            *((volatile unsigned int*)(0x420040B0UL))
#define bM0P_UID_UIDR1_UID13                            *((volatile unsigned int*)(0x420040B4UL))
#define bM0P_UID_UIDR1_UID14                            *((volatile unsigned int*)(0x420040B8UL))
#define bM0P_UID_UIDR1_UID15                            *((volatile unsigned int*)(0x420040BCUL))
#define bM0P_UID_UIDR1_UID16                            *((volatile unsigned int*)(0x420040C0UL))
#define bM0P_UID_UIDR1_UID17                            *((volatile unsigned int*)(0x420040C4UL))
#define bM0P_UID_UIDR1_UID18                            *((volatile unsigned int*)(0x420040C8UL))
#define bM0P_UID_UIDR1_UID19                            *((volatile unsigned int*)(0x420040CCUL))
#define bM0P_UID_UIDR1_UID20                            *((volatile unsigned int*)(0x420040D0UL))
#define bM0P_UID_UIDR1_UID21                            *((volatile unsigned int*)(0x420040D4UL))
#define bM0P_UID_UIDR1_UID22                            *((volatile unsigned int*)(0x420040D8UL))
#define bM0P_UID_UIDR1_UID23                            *((volatile unsigned int*)(0x420040DCUL))
#define bM0P_UID_UIDR1_UID24                            *((volatile unsigned int*)(0x420040E0UL))
#define bM0P_UID_UIDR1_UID25                            *((volatile unsigned int*)(0x420040E4UL))
#define bM0P_UID_UIDR1_UID26                            *((volatile unsigned int*)(0x420040E8UL))
#define bM0P_UID_UIDR1_UID27                            *((volatile unsigned int*)(0x420040ECUL))
#define bM0P_UID_UIDR1_UID28                            *((volatile unsigned int*)(0x420040F0UL))
#define bM0P_UID_UIDR1_UID29                            *((volatile unsigned int*)(0x420040F4UL))
#define bM0P_UID_UIDR1_UID30                            *((volatile unsigned int*)(0x420040F8UL))
#define bM0P_UID_UIDR1_UID31                            *((volatile unsigned int*)(0x420040FCUL))
#define bM0P_UID_UIDR2_UID0                             *((volatile unsigned int*)(0x42004100UL))
#define bM0P_UID_UIDR2_UID1                             *((volatile unsigned int*)(0x42004104UL))
#define bM0P_UID_UIDR2_UID2                             *((volatile unsigned int*)(0x42004108UL))
#define bM0P_UID_UIDR2_UID3                             *((volatile unsigned int*)(0x4200410CUL))
#define bM0P_UID_UIDR2_UID4                             *((volatile unsigned int*)(0x42004110UL))
#define bM0P_UID_UIDR2_UID5                             *((volatile unsigned int*)(0x42004114UL))
#define bM0P_UID_UIDR2_UID6                             *((volatile unsigned int*)(0x42004118UL))
#define bM0P_UID_UIDR2_UID7                             *((volatile unsigned int*)(0x4200411CUL))
#define bM0P_UID_UIDR2_UID8                             *((volatile unsigned int*)(0x42004120UL))
#define bM0P_UID_UIDR2_UID9                             *((volatile unsigned int*)(0x42004124UL))
#define bM0P_UID_UIDR2_UID10                            *((volatile unsigned int*)(0x42004128UL))
#define bM0P_UID_UIDR2_UID11                            *((volatile unsigned int*)(0x4200412CUL))
#define bM0P_UID_UIDR2_UID12                            *((volatile unsigned int*)(0x42004130UL))
#define bM0P_UID_UIDR2_UID13                            *((volatile unsigned int*)(0x42004134UL))
#define bM0P_UID_UIDR2_UID14                            *((volatile unsigned int*)(0x42004138UL))
#define bM0P_UID_UIDR2_UID15                            *((volatile unsigned int*)(0x4200413CUL))
#define bM0P_VC_CTL1_VC_EN                              *((volatile unsigned int*)(0x42786000UL))
#define bM0P_VC_CTL1_VC_OUT                             *((volatile unsigned int*)(0x42786004UL))
#define bM0P_VC_CTL1_VC_NMODE0                          *((volatile unsigned int*)(0x42786008UL))
#define bM0P_VC_CTL1_VC_NMODE1                          *((volatile unsigned int*)(0x4278600CUL))
#define bM0P_VC_CTL1_VC_PMODE0                          *((volatile unsigned int*)(0x42786010UL))
#define bM0P_VC_CTL1_VC_PMODE1                          *((volatile unsigned int*)(0x42786014UL))
#define bM0P_VC_CTL1_VCVOL_SEL0                         *((volatile unsigned int*)(0x42786020UL))
#define bM0P_VC_CTL1_VCVOL_SEL1                         *((volatile unsigned int*)(0x42786024UL))
#define bM0P_VC_CTL1_VCVOL_SEL2                         *((volatile unsigned int*)(0x42786028UL))
#define bM0P_VC_CTL1_VCVOL_SEL3                         *((volatile unsigned int*)(0x4278602CUL))
#define bM0P_VC_CTL1_VCVOL_SEL4                         *((volatile unsigned int*)(0x42786030UL))
#define bM0P_VC_CTL1_VCVOL_SEL5                         *((volatile unsigned int*)(0x42786034UL))
#define bM0P_VC_CTL1_VCDIV_EN                           *((volatile unsigned int*)(0x42786038UL))
#define bM0P_VC_CTL1_VCDIV_SEL                          *((volatile unsigned int*)(0x4278603CUL))
#define bM0P_VC_CTL2_VC_FILTER_EN                       *((volatile unsigned int*)(0x42786080UL))
#define bM0P_VC_CTL2_VC_RESPONSE0                       *((volatile unsigned int*)(0x42786084UL))
#define bM0P_VC_CTL2_VC_RESPONSE1                       *((volatile unsigned int*)(0x42786088UL))
