tivacc/token4SZT/inmiga/mcu/common/hc32l15.h
#define bM0P_VC_CTL2_VC_RESPONSE2                       *((volatile unsigned int*)(0x4278608CUL))
#define bM0P_VC_CTL2_VC_EXBUF                           *((volatile unsigned int*)(0x42786090UL))
#define bM0P_VC_CTL2_VCINT_FALLING                      *((volatile unsigned int*)(0x42786094UL))
#define bM0P_VC_CTL2_VCINT_RISING                       *((volatile unsigned int*)(0x42786098UL))
#define bM0P_VC_CTL2_VCINT_HIGH                         *((volatile unsigned int*)(0x4278609CUL))
#define bM0P_VC_CTL2_VC2PT                              *((volatile unsigned int*)(0x427860A0UL))
#define bM0P_VC_CTL2_VCIE                               *((volatile unsigned int*)(0x427860A4UL))
#define bM0P_VC_CTL2_VCIF                               *((volatile unsigned int*)(0x427860A8UL))
#define bM0P_VC_CTL2_VC_HYS_SEL0                        *((volatile unsigned int*)(0x427860ACUL))
#define bM0P_VC_CTL2_VC_HYS_SEL1                        *((volatile unsigned int*)(0x427860B0UL))
#define bM0P_VC_CTL3_VC_TM0G                            *((volatile unsigned int*)(0x42786100UL))
#define bM0P_VC_CTL3_VC_TM2G                            *((volatile unsigned int*)(0x42786108UL))
#define bM0P_VC_CTL3_VCIN_NEG_SEL0                      *((volatile unsigned int*)(0x42786110UL))
#define bM0P_VC_CTL3_VCIN_NEG_SEL1                      *((volatile unsigned int*)(0x42786114UL))
#define bM0P_VC_CTL3_VCIN_POS_SEL0                      *((volatile unsigned int*)(0x42786118UL))
#define bM0P_VC_CTL3_VCIN_POS_SEL1                      *((volatile unsigned int*)(0x4278611CUL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_EN                    *((volatile unsigned int*)(0x426A0000UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_SRST                  *((volatile unsigned int*)(0x426A0004UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VIN0                  *((volatile unsigned int*)(0x426A0008UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VIN1                  *((volatile unsigned int*)(0x426A000CUL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VSET0                 *((volatile unsigned int*)(0x426A0010UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VSET1                 *((volatile unsigned int*)(0x426A0014UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VSET2                 *((volatile unsigned int*)(0x426A0018UL))
#define bM0P_WSUNIT_LVD_CTRL1_LVD_VSET3                 *((volatile unsigned int*)(0x426A001CUL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_HYS_EN                *((volatile unsigned int*)(0x426A0080UL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_F_EN                  *((volatile unsigned int*)(0x426A0084UL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_F_SET0                *((volatile unsigned int*)(0x426A0088UL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_F_SET1                *((volatile unsigned int*)(0x426A008CUL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_F_SET2                *((volatile unsigned int*)(0x426A0090UL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_IE0                   *((volatile unsigned int*)(0x426A0094UL))
#define bM0P_WSUNIT_LVD_CTRL2_LVD_IE1                   *((volatile unsigned int*)(0x426A0098UL))
#define bM0P_WSUNIT_LVD_STR_LVD_IRQ                     *((volatile unsigned int*)(0x426A0100UL))
#define bM0P_WSUNIT_LVD_STR_LVD_OUT                     *((volatile unsigned int*)(0x426A0120UL))
#define bM0P_WSUNIT_LVD_CLR_LVD_CLR                     *((volatile unsigned int*)(0x426A0180UL))
#define bM0P_WSUNIT_LVD2_CTL_LVD2_EN                    *((volatile unsigned int*)(0x426A0280UL))
#define bM0P_WSUNIT_LVD2_CTL_LVD2_VSET0                 *((volatile unsigned int*)(0x426A0284UL))
#define bM0P_WSUNIT_LVD2_CTL_LVD2_VSET1                 *((volatile unsigned int*)(0x426A0288UL))
#define bM0P_WSUNIT_LVD2_CTL_LVD2_VSET2                 *((volatile unsigned int*)(0x426A028CUL))
#define bM0P_WSUNIT_LVD2_CTL_LVD2_IE                    *((volatile unsigned int*)(0x426A0290UL))
#define bM0P_WSUNIT_LVD2_STR_LVD2_IRQ                   *((volatile unsigned int*)(0x426A0300UL))
#define bM0P_WSUNIT_LVD2_STR_SENSE_STA                  *((volatile unsigned int*)(0x426A0320UL))
#define bM0P_WSUNIT_LVD2_STR_LVD2_STA                   *((volatile unsigned int*)(0x426A0324UL))
#define bM0P_WSUNIT_LVD2_CLR_LVD2_CLR                   *((volatile unsigned int*)(0x426A0380UL))
#define bM0P_WSUNIT_LDO_CTL_AUTOSWEN                    *((volatile unsigned int*)(0x426A0420UL))
#define bM0P_WSUNIT_LDO_CTL_KEY0                        *((volatile unsigned int*)(0x426A0440UL))
#define bM0P_WSUNIT_LDO_CTL_KEY1                        *((volatile unsigned int*)(0x426A0444UL))
#define bM0P_WSUNIT_LDO_CTL_KEY2                        *((volatile unsigned int*)(0x426A0448UL))
#define bM0P_WSUNIT_LDO_CTL_KEY3                        *((volatile unsigned int*)(0x426A044CUL))
#define bM0P_WSUNIT_LDO_CTL_KEY4                        *((volatile unsigned int*)(0x426A0450UL))
#define bM0P_WSUNIT_LDO_CTL_KEY5                        *((volatile unsigned int*)(0x426A0454UL))
#define bM0P_WSUNIT_LDO_CTL_KEY6                        *((volatile unsigned int*)(0x426A0458UL))
#define bM0P_WSUNIT_LDO_CTL_KEY7                        *((volatile unsigned int*)(0x426A045CUL))
#define bM0P_WSUNIT_LDO_CTL_KEY8                        *((volatile unsigned int*)(0x426A0460UL))
#define bM0P_WSUNIT_LDO_CTL_KEY9                        *((volatile unsigned int*)(0x426A0464UL))
#define bM0P_WSUNIT_LDO_CTL_KEY10                       *((volatile unsigned int*)(0x426A0468UL))
#define bM0P_WSUNIT_LDO_CTL_KEY11                       *((volatile unsigned int*)(0x426A046CUL))
#define bM0P_WSUNIT_LDO_CTL_KEY12                       *((volatile unsigned int*)(0x426A0470UL))
#define bM0P_WSUNIT_LDO_CTL_KEY13                       *((volatile unsigned int*)(0x426A0474UL))
#define bM0P_WSUNIT_LDO_CTL_KEY14                       *((volatile unsigned int*)(0x426A0478UL))
#define bM0P_WSUNIT_LDO_CTL_KEY15                       *((volatile unsigned int*)(0x426A047CUL))
#define bM0P_WSUNIT_BGR_CTL_BGR_EN                      *((volatile unsigned int*)(0x426A0600UL))
#define bM0P_WSUNIT_CLK_CTL1_RTCE                       *((volatile unsigned int*)(0x426A2000UL))
#define bM0P_WSUNIT_CLK_CTL2_RTCCKE                     *((volatile unsigned int*)(0x426A2080UL))
#define bM0P_WSUNIT_CLK_CTL2_LCDCKE                     *((volatile unsigned int*)(0x426A2084UL))
#define bM0P_WSUNIT_CLK_CTL2_WDTCKE                     *((volatile unsigned int*)(0x426A2088UL))
#define bM0P_WSUNIT_CLK_CTL2_UARTCKE                    *((volatile unsigned int*)(0x426A2090UL))
#define bM0P_WSUNIT_MOSC_CTL_IMAINSEL0                  *((volatile unsigned int*)(0x426A2100UL))
#define bM0P_WSUNIT_MOSC_CTL_IMAINSEL1                  *((volatile unsigned int*)(0x426A2104UL))
#define bM0P_WSUNIT_DS_RAMP_RAMP                        *((volatile unsigned int*)(0x426A2180UL))
#define bM0P_WSUNIT_WAKE_RSR_REINTX                     *((volatile unsigned int*)(0x426A4000UL))
#define bM0P_WSUNIT_WAKE_RSR_RELVDR                     *((volatile unsigned int*)(0x426A4004UL))
#define bM0P_WSUNIT_WAKE_ISR_RERTCI                     *((volatile unsigned int*)(0x426A4080UL))
#define bM0P_WSUNIT_WAKE_ISR_RELVDI                     *((volatile unsigned int*)(0x426A4084UL))
#define bM0P_WSUNIT_WAKE_ISR_REWU0I                     *((volatile unsigned int*)(0x426A4088UL))
#define bM0P_WSUNIT_WAKE_ISR_REWU1I                     *((volatile unsigned int*)(0x426A408CUL))
#define bM0P_WSUNIT_WAKE_ISR_REWU2I                     *((volatile unsigned int*)(0x426A4090UL))
#define bM0P_WSUNIT_WAKE_ISR_REWU3I                     *((volatile unsigned int*)(0x426A4094UL))
#define bM0P_WSUNIT_WAKE_IER_RERTCE                     *((volatile unsigned int*)(0x426A4100UL))
#define bM0P_WSUNIT_WAKE_IER_RELVDE                     *((volatile unsigned int*)(0x426A4104UL))
#define bM0P_WSUNIT_WAKE_IER_REWU0E                     *((volatile unsigned int*)(0x426A4108UL))
#define bM0P_WSUNIT_WAKE_IER_REWU1E                     *((volatile unsigned int*)(0x426A410CUL))
#define bM0P_WSUNIT_WAKE_IER_REWU2E                     *((volatile unsigned int*)(0x426A4110UL))
#define bM0P_WSUNIT_WAKE_IER_REWU3E                     *((volatile unsigned int*)(0x426A4114UL))
#define bM0P_WSUNIT_WAKE_LVR_WUI0LV                     *((volatile unsigned int*)(0x426A4180UL))
#define bM0P_WSUNIT_WAKE_LVR_WUI1LV                     *((volatile unsigned int*)(0x426A4184UL))
#define bM0P_WSUNIT_WAKE_LVR_WUI2LV                     *((volatile unsigned int*)(0x426A4188UL))
#define bM0P_WSUNIT_WAKE_LVR_WUI3LV                     *((volatile unsigned int*)(0x426A418CUL))


#ifdef __cplusplus
}
#endif

#endif /* __HC32L15_H__ */

